
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>密码朋克运动 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.2">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="2-crypto.html" />
    
    
    <link rel="prev" href="./" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.2" data-path="1-punk.html">
            
                <a href="1-punk.html">
            
                    
                    密码朋克运动
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="2-crypto.html">
            
                <a href="2-crypto.html">
            
                    
                    什么是密码学
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="3-hash.html">
            
                <a href="3-hash.html">
            
                    
                    哈希算法
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="4-pub.html">
            
                <a href="4-pub.html">
            
                    
                    公开密钥加密
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="5-com.html">
            
                <a href="5-com.html">
            
                    
                    加密通信
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="6-sign.html">
            
                <a href="6-sign.html">
            
                    
                    数字签名
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="7-ca.html">
            
                <a href="7-ca.html">
            
                    
                    数字证书
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="8-idea.html">
            
                <a href="8-idea.html">
            
                    
                    RSA 算法--基本原理篇
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="9-math.html">
            
                <a href="9-math.html">
            
                    
                    RSA 算法--粗略数学推导篇
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="10-merk.html">
            
                <a href="10-merk.html">
            
                    
                    Merkle Tree
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="11-ecc.html">
            
                <a href="11-ecc.html">
            
                    
                    椭圆曲线密码学简介
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >密码朋克运动</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <p>&#x8FD9;&#x8282; Peter &#x8DDF;&#x5927;&#x5BB6;&#x804A;&#x804A;&#x5BC6;&#x7801;&#x670B;&#x514B;&#x8FD0;&#x52A8;&#x3002;&#x8FD9;&#x4E2A;&#x65E9;&#x671F;&#x53EA;&#x6709;&#x5C11;&#x6570;&#x7CBE;&#x82F1;&#x5F62;&#x6210;&#x7684;&#x5C0F;&#x5708;&#x5B50;&#xFF0C;&#x4ECA;&#x5929;&#x53D1;&#x5C55;&#x6210;&#x52A0;&#x5BC6;&#x8D27;&#x5E01;&#x548C;&#x533A;&#x5757;&#x94FE;&#x7684;&#x5168;&#x6C11;&#x70ED;&#x6F6E;&#xFF0C;&#x60F3;&#x60F3;&#x8FD8;&#x771F;&#x662F;&#x6CE2;&#x6F9C;&#x58EE;&#x9614;&#x800C;&#x53C8;&#x8BE1;&#x5F02;&#x3002;&#x6211;&#x4EEC;&#x5148;&#x804A;&#x5BC6;&#x7801;&#x670B;&#x514B;&#x8FD0;&#x52A8;&#x662F;&#x4EC0;&#x4E48;&#xFF0C;&#x7136;&#x540E;&#x4ECB;&#x7ECD;&#x5386;&#x53F2;&#x4E0A;&#x7684;&#x5173;&#x952E;&#x65F6;&#x95F4;&#x70B9;&#x6709;&#x54EA;&#x4E9B;&#xFF0C;&#x6700;&#x540E;&#x7ED9;&#x51FA;&#x4E00;&#x4E9B;&#x540D;&#x4EBA;&#x7684;&#x8A00;&#x8BBA;&#x4E30;&#x6EE1;&#x4E00;&#x4E0B;&#x6211;&#x4EEC;&#x5BF9;&#x8FD9;&#x4E2A;&#x8FD0;&#x52A8;&#x7684;&#x8BA4;&#x8BC6;&#x3002;</p>
<h2 id="&#x5B9A;&#x4E49;">&#x5B9A;&#x4E49;</h2>
<p>&#x6211;&#x4EEC;&#x5148;&#x5B66;&#x7A76;&#x4E00;&#x4E9B;&#xFF0C;&#x7ED9;&#x51FA;&#x5BC6;&#x7801;&#x670B;&#x514B;&#x8FD0;&#x52A8;&#x7684;&#x5B9A;&#x4E49;&#x3002;&#x6240;&#x8C13;&#x670B;&#x514B;&#xFF0C;&#x5C31;&#x662F;&#x4E00;&#x4E9B;&#x4E3B;&#x5F20;&#x5F7B;&#x5E95;&#x7834;&#x574F;&#x7136;&#x540E;&#x5F7B;&#x5E95;&#x91CD;&#x5EFA;&#x7684;&#x4EBA;&#xFF0C;&#x6700;&#x65E9;&#x6307;&#x7684;&#x662F;&#x4E00;&#x4E9B;&#x5947;&#x88C5;&#x5F02;&#x670D;&#x7684;&#x97F3;&#x4E50;&#x4EBA;&#x3002;&#x4F46;&#x662F;&#x5BC6;&#x7801;&#x670B;&#x514B;&#x90FD;&#x662F;&#x4E00;&#x4E9B;&#x5BC6;&#x7801;&#x5B66;&#x7684;&#x9AD8;&#x624B;&#xFF0C;&#x4ED6;&#x4EEC;&#x4E3B;&#x5F20;&#x7528;&#x5BC6;&#x7801;&#x5B66;&#x7684;&#x65B9;&#x5F0F;&#x6765;&#x6700;&#x5927;&#x5316;&#x7684;&#x4FDD;&#x8BC1;&#x4E2A;&#x4F53;&#x9690;&#x79C1;&#x3002;</p>
<p>&#x9996;&#x5148;&#x5BC6;&#x7801;&#x670B;&#x514B;&#x662F;&#x4E00;&#x4E2A;&#x793E;&#x533A;&#x3002;&#x8FD9;&#x53E5;&#x8BDD;&#x600E;&#x4E48;&#x7406;&#x89E3;&#x5462;&#xFF1F;&#x4EFB;&#x4F55;&#x7684;&#x601D;&#x6F6E;&#x90FD;&#x5728;&#x65E9;&#x671F;&#x90FD;&#x4F1A;&#x6709;&#x4E00;&#x4E9B;&#x652F;&#x6301;&#x8005;&#xFF0C;&#x5728;&#x4E92;&#x8054;&#x7F51;&#x65E9;&#x671F;&#x5F88;&#x5E38;&#x89C1;&#x7684;&#x4E00;&#x79CD;&#x7EC4;&#x7EC7;&#x5F62;&#x5F0F;&#x662F;&#xFF0C;&#x652F;&#x6301;&#x8005;&#x4EEC;&#x4F1A;&#x53BB;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x90AE;&#x4EF6;&#x5217;&#x8868;&#xFF0C;&#x5BC6;&#x7801;&#x670B;&#x514B;&#x4E5F;&#x4E0D;&#x4F8B;&#x5916;&#x3002;&#x56F4;&#x7ED5;&#x90AE;&#x4EF6;&#x5217;&#x8868;&#x548C;&#x4E00;&#x4E9B;&#x7F51;&#x4E0A;&#x7684;&#x8D44;&#x6599;&#x5C31;&#x4F1A;&#x81EA;&#x7136;&#x800C;&#x7136;&#x7684;&#x5F62;&#x6210;&#x4E00;&#x4E2A;&#x89C2;&#x4F17;&#x7FA4;&#xFF0C;&#x8FD9;&#x91CC;&#x9762;&#x6709;&#x652F;&#x6301;&#x8005;&#x4E5F;&#x6709;&#x53CD;&#x5BF9;&#x8005;&#x3002;&#x793E;&#x533A;&#x662F;&#x4E00;&#x4E2A;&#x81EA;&#x7531;&#x8FDB;&#x51FA;&#x7684;&#x56E2;&#x4F53;&#xFF0C;&#x4E00;&#x822C;&#x8C01;&#x5C5E;&#x4E8E;&#x8FD9;&#x4E2A;&#x793E;&#x533A;&#xFF0C;&#x8C01;&#x4E0D;&#x5C5E;&#x4E8E;&#xFF0C;&#x6CA1;&#x6709;&#x7279;&#x522B;&#x660E;&#x786E;&#x7684;&#x754C;&#x9650;&#x3002;&#x5C31;&#x50CF; Peter &#x81EA;&#x5DF1;&#x603B;&#x8BF4;&#x81EA;&#x5DF1;&#x662F;&#x5F00;&#x6E90;&#x793E;&#x533A;&#x7684;&#x4EBA;&#xFF0C;&#x4F46;&#x662F;&#x5BF9;&#x4E8E;&#x5F00;&#x6E90;&#x793E;&#x533A;&#x67D0;&#x4E9B;&#x5B50;&#x793E;&#x533A;&#x7684;&#x89C2;&#x70B9;&#xFF0C;&#x6211;&#x4E5F;&#x4E0D;&#x662F;&#x7279;&#x522B;&#x8BA4;&#x540C;&#xFF0C;&#x53EA;&#x662F;&#x56F4;&#x89C2;&#x800C;&#x5DF2;&#x3002;&#x793E;&#x533A;&#x4E0D;&#x662F;&#x6B63;&#x5F0F;&#x7EC4;&#x7EC7;&#xFF0C;&#x4E5F;&#x53CD;&#x5BF9;&#x5B97;&#x6559;&#x5F0F;&#x7684;&#x4FE1;&#x4EF0;&#xFF0C;&#x63D0;&#x5021;&#x6000;&#x7591;&#x7CBE;&#x795E;&#x3002;</p>
<p>&#x5176;&#x6B21;&#xFF0C;&#x7406;&#x89E3;&#x5BC6;&#x7801;&#x670B;&#x514B;&#x8FD0;&#x52A8;&#xFF0C;&#x5C31;&#x8981;&#x7406;&#x89E3;&#x9690;&#x79C1;&#x8FD9;&#x4E2A;&#x6982;&#x5FF5;&#x3002;Eric Hughes &#x5728; 1993 &#x5E74;&#xFF0C;&#x5199;&#x8FC7;&#x4E00;&#x7BC7;&#x6587;&#x7AE0;&#x300A;&#x5BC6;&#x7801;&#x670B;&#x514B;&#x5BA3;&#x8A00;&#x300B;&#x3002;&#x5BC6;&#x7801;&#x670B;&#x514B;&#x8FD9;&#x4E2A;&#x8BCD;&#xFF0C;&#x6700;&#x65E9;&#x5C31;&#x662F;&#x5728;&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x4E2D;&#x8BDE;&#x751F;&#x7684;&#x3002;&#x6587;&#x7AE0;&#x7B2C;&#x4E00;&#x53E5;&#x4F5C;&#x8005;&#x5C31;&#x63D0;&#x5230;&#xFF1A;</p>
<blockquote>
<p>Privacy is necessary for an open society</p>
</blockquote>
<p>&#x7FFB;&#x8BD1;&#x8FC7;&#x6765;&#x5C31;&#x662F;&#xFF1A;&#x9690;&#x79C1;&#x5BF9;&#x4E8E;&#x6784;&#x5EFA;&#x5F00;&#x653E;&#x793E;&#x4F1A;&#x662F;&#x5FC5;&#x8981;&#x7684;&#x3002;&#x9690;&#x79C1;&#x4E0D;&#x662F;&#x79D8;&#x5BC6;&#x3002;&#x9690;&#x79C1;&#x662F;&#x67D0;&#x4E9B;&#x6211;&#x81EA;&#x5DF1;&#x7684;&#x4E0D;&#x5E0C;&#x671B;&#x5168;&#x4E16;&#x754C;&#x90FD;&#x77E5;&#x9053;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x79D8;&#x5BC6;&#x662F;&#x4E0D;&#x5E0C;&#x671B;&#x4EFB;&#x4F55;&#x4EBA;&#x77E5;&#x9053;&#x3002;</p>
<p>&#x7B2C;&#x4E09;&#x70B9;&#x53EF;&#x80FD;&#x4E5F;&#x662F;&#x6700;&#x91CD;&#x8981;&#x7684;&#x4E00;&#x70B9;&#xFF0C;&#x5BC6;&#x7801;&#x670B;&#x514B;&#x8981;&#x61C2;&#x5BC6;&#x7801;&#x5B66;&#x3002;&#x5BC6;&#x7801;&#x670B;&#x514B;&#x76EE;&#x524D;&#x4E5F;&#x7528;&#x6765;&#x6CDB;&#x6307;&#x5BC6;&#x7801;&#x5B66;&#x4E13;&#x5BB6;&#xFF0C;&#x4ED6;&#x4EEC;&#x652F;&#x6301;&#x7528;&#x52A0;&#x5BC6;&#x6280;&#x672F;&#x6765;&#x4FDD;&#x62A4;&#x7528;&#x6237;&#x9690;&#x79C1;&#x3002;&#x300A;&#x5BA3;&#x8A00;&#x300B;&#x91CC;&#x9762;&#x6709;&#x53E6;&#x5916;&#x4E00;&#x53E5;&#x8BDD;&#xFF1A;</p>
<blockquote>
<p>&#x5BC6;&#x7801;&#x670B;&#x514B;&#x8981;&#x4F1A;&#x5199;&#x4EE3;&#x7801;&#x3002;</p>
</blockquote>
<p>&#x5199;&#x4EE3;&#x7801;&#x7684;&#x76EE;&#x7684;&#x662F;&#x8981;&#x7EF4;&#x62A4;&#x6211;&#x4EEC;&#x81EA;&#x5DF1;&#x7684;&#x9690;&#x79C1;&#x3002;&#x5BC6;&#x7801;&#x670B;&#x514B;&#x7684;&#x89C2;&#x70B9;&#x662F;&#xFF0C;&#x653F;&#x5E9C;&#x548C;&#x5927;&#x7EC4;&#x7EC7;&#x662F;&#x6CA1;&#x6709;&#x52A8;&#x529B;&#x53BB;&#x7EF4;&#x62A4;&#x4E2A;&#x4EBA;&#x9690;&#x79C1;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x6070;&#x597D;&#x4E8E;&#x4ED6;&#x4EEC;&#x7684;&#x6838;&#x5FC3;&#x5229;&#x76CA;&#x51B2;&#x7A81;&#x3002;</p>
<p>&#x603B;&#x4E4B;&#xFF0C;&#x5BC6;&#x7801;&#x670B;&#x514B;&#x8FD0;&#x52A8;&#x5C31;&#x662F;&#x8FD9;&#x4E48;&#x4E00;&#x4E2A;&#x793E;&#x533A;&#xFF0C;&#x4E00;&#x80A1;&#x601D;&#x6F6E;&#xFF0C;&#x5927;&#x5BB6;&#x4E3B;&#x5F20;&#x4E2A;&#x4EBA;&#x5E94;&#x8BE5;&#x4FDD;&#x62A4;&#x81EA;&#x5DF1;&#x7684;&#x9690;&#x79C1;&#x3002;&#x55EF;&#xFF0C;&#x5173;&#x952E;&#x601D;&#x60F3;&#x5176;&#x5B9E;&#x5C31;&#x662F;&#x56DB;&#x4E2A;&#x5B57;&#x201C;&#x4FDD;&#x969C;&#x9690;&#x79C1;&#x201D;&#xFF0C;&#x4F46;&#x662F;&#x660E;&#x663E;&#x8FD9;&#x4E00;&#x70B9;&#x80FD;&#x5F15;&#x7533;&#x51FA;&#x6765;&#x7684;&#x6280;&#x672F;&#x548C;&#x4EBA;&#x6587;&#x4E3B;&#x5F20;&#x662F;&#x975E;&#x5E38;&#x4E30;&#x5BCC;&#x7684;&#x3002;</p>
<h2 id="&#x5386;&#x53F2;">&#x5386;&#x53F2;</h2>
<p>&#x4E0B;&#x9762;&#x6765;&#x8BB2;&#x8BB2;&#x6545;&#x4E8B;&#xFF0C;&#x56DE;&#x987E;&#x4E00;&#x4E0B;&#x8FD9;&#x4E00;&#x5207;&#x90FD;&#x662F;&#x4ECE;&#x54EA;&#x91CC;&#x6765;&#x7684;&#x3002;</p>
<p>&#x5148;&#x8BF4;&#x8BF4;&#x90AE;&#x4EF6;&#x5217;&#x8868;&#x7684;&#x8BDE;&#x751F;&#x3002;&#x4E0D;&#x53EF;&#x5426;&#x8BA4;&#xFF0C;&#x5BC6;&#x7801;&#x5B66;&#x6700;&#x65E9;&#x5C31;&#x662F;&#x519B;&#x706B;&#xFF0C;&#x4E8C;&#x6218;&#x4E4B;&#x540E;&#xFF0C;&#x653F;&#x5E9C;&#x4E5F;&#x4E25;&#x683C;&#x63A7;&#x5236;&#x5BC6;&#x7801;&#x5B66;&#x7684;&#x53D1;&#x5C55;&#x3002;&#x76F4;&#x5230;&#x516B;&#x4E5D;&#x5341;&#x5E74;&#x4EE3;&#xFF0C;&#x5BC6;&#x7801;&#x5B66;&#x624D;&#x9010;&#x6E10;&#x8F6C;&#x4E3A;&#x6C11;&#x7528;&#x3002;&#x800C;&#x5BC6;&#x7801;&#x670B;&#x514B;&#x7684;&#x601D;&#x6F6E;&#xFF0C;&#x4E5F;&#x5728;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x4E2D;&#x9010;&#x6E10;&#x5F62;&#x6210;&#x3002;&#x5BC6;&#x7801;&#x670B;&#x514B;&#x8FD9;&#x4E2A;&#x8BCD;&#xFF0C;&#x662F;&#x8BDE;&#x751F;&#x5728;&#x5BC6;&#x7801;&#x670B;&#x514B;&#x90AE;&#x4EF6;&#x5217;&#x8868;&#x91CC;&#x9762;&#x7684;&#x3002;&#x90AE;&#x4EF6;&#x5217;&#x8868;&#x7684;&#x521B;&#x4E16;&#x4EBA;&#x6709;&#x4E09;&#x4E2A;&#xFF0C;&#x7B2C;&#x4E00;&#x4F4D;&#x662F; Intel &#x7684;&#x8D44;&#x6DF1;&#x79D1;&#x5B66;&#x5BB6; Tim May &#xFF0C;&#x7B2C;&#x4E8C;&#x4F4D;&#x5C31;&#x662F;&#x521A;&#x521A;&#x63D0;&#x5230;&#x7684; Eric Hughes &#xFF0C;&#x7F8E;&#x56FD;&#x8BA1;&#x7B97;&#x673A;&#x9876;&#x7EA7;&#x540D;&#x6821; UC &#x4F2F;&#x514B;&#x5229;&#x7684;&#x6570;&#x5B66;&#x5BB6;&#x3002;&#x7B2C;&#x4E09;&#x4F4D;&#x662F;&#xFF0C;&#x5F00;&#x6E90;&#x8F6F;&#x4EF6;&#x7684;&#x65E9;&#x671F;&#x6838;&#x5FC3;&#x4EBA;&#x7269;&#x4E4B;&#x4E00;&#x7684; John Gilmore &#xFF0C;&#x4F1A; Linux &#x7684;&#x540C;&#x5B66;&#x4E00;&#x822C;&#x90FD;&#x7528;&#x8FC7; DHCP &#x8FD9;&#x4E2A;&#x547D;&#x4EE4;&#x6765;&#x5206;&#x914D;&#x7F51;&#x5740;&#xFF0C;&#x6CA1;&#x9519; John &#x5C31;&#x662F; DHCP &#x4E4B;&#x7236;&#x3002;&#x4ED6;&#x4EEC;&#x4E09;&#x4E2A;&#x4EBA;&#x7ECF;&#x5E38;&#x805A;&#x4F1A;&#x804A;&#x4E00;&#x4E9B;&#x5BC6;&#x7801;&#x5B66;&#x76F8;&#x5173;&#x7684;&#x8BDD;&#x9898;&#xFF0C;&#x4F46;&#x662F;&#x540E;&#x6765;&#x5927;&#x5BB6;&#x8FD8;&#x662F;&#x89C9;&#x5F97;&#x6210;&#x7ACB;&#x4E00;&#x4E2A;&#x90AE;&#x4EF6;&#x5217;&#x8868;&#xFF0C;&#x8BA9;&#x66F4;&#x591A;&#x7684;&#x4EBA;&#x53C2;&#x4E0E;&#x8FDB;&#x6765;&#x6BD4;&#x8F83;&#x597D;&#xFF0C;&#x4E8E;&#x662F;&#x5728;90&#x5E74;&#x4EE3;&#x521D;&#xFF0C;&#x5BC6;&#x7801;&#x670B;&#x514B;&#x90AE;&#x4EF6;&#x5217;&#x8868;&#x5C31;&#x8BDE;&#x751F;&#x4E86;&#xFF0C;&#x867D;&#x7136;&#x6700;&#x65E9;&#x7684;&#x540D;&#x5B57;&#x4E0D;&#x53EB;&#x5BC6;&#x7801;&#x670B;&#x514B;&#x3002;</p>
<p>&#x540D;&#x5B57;&#x4E0D;&#x662F;&#x6700;&#x91CD;&#x8981;&#x7684;&#xFF0C;&#x6700;&#x91CD;&#x8981;&#x7684;&#x662F;&#x8FD9;&#x4E2A;&#x90AE;&#x4EF6;&#x5217;&#x8868;&#x91CC;&#x7684;&#x4EBA;&#x59CB;&#x7EC8;&#x6CA1;&#x6709;&#x505C;&#x6B62;&#x8FC7;&#x5DE5;&#x4F5C;&#xFF0C;&#x800C;&#x533A;&#x5757;&#x94FE;&#x548C;&#x6BD4;&#x7279;&#x5E01;&#x5E76;&#x4E0D;&#x662F;&#x4ECE;&#x771F;&#x7A7A;&#x4E2D;&#x8E66;&#x51FA;&#x6765;&#x7684;&#x3002;&#x5BC6;&#x7801;&#x670B;&#x514B;&#x4EEC;&#x5F88;&#x5FEB;&#x5C31;&#x4F1A;&#x53D1;&#x73B0;&#xFF0C;&#x5BC6;&#x7801;&#x5B66;&#x6280;&#x672F;&#x672C;&#x8EAB;&#x4FDD;&#x62A4;&#x7684;&#x53EA;&#x662F;&#x4FE1;&#x606F;&#x4EA4;&#x6D41;&#x7684;&#x9690;&#x79C1;&#xFF0C;&#x4F46;&#x662F;&#x771F;&#x6B63;&#x7684;&#x9690;&#x79C1;&#x5305;&#x542B;&#x7684;&#x5185;&#x5BB9;&#x5176;&#x5B9E;&#x5E94;&#x8BE5;&#x66F4;&#x5E7F;&#x6CDB;&#x3002;1992 &#x5E74;&#x7684;&#x65F6;&#x5019;&#xFF0C;Tim May &#x5C31;&#x8BF4;&#x8FC7; <a href="https://www.activism.net/cypherpunk/crypto-anarchy.html" target="_blank">https://www.activism.net/cypherpunk/crypto-anarchy.html</a> &#xFF1A;</p>
<blockquote>
<p>&#x4EBA;&#x4EEC;&#x5E94;&#x8BE5;&#x80FD;&#x591F;&#x5728;&#x7F51;&#x4E0A;&#x533F;&#x540D;&#x7684;&#x8FDB;&#x884C;&#x4FE1;&#x606F;&#x6C9F;&#x901A;&#xFF0C;&#x5546;&#x52A1;&#x5408;&#x4F5C;&#xFF0C;&#x7B7E;&#x7F72;&#x7535;&#x5B50;&#x5408;&#x540C;&#x3002;</p>
</blockquote>
<p>&#x8FD9;&#x91CC;&#x9762;&#x663E;&#x7136;&#x6D89;&#x53CA;&#x5230;&#x4E00;&#x4E2A;&#x660E;&#x663E;&#x7684;&#x8981;&#x6C42;&#xFF0C;&#x4E92;&#x8054;&#x7F51;&#x4E0A;&#x4E0D;&#x4F46;&#x8981;&#x80FD;&#x4F20;&#x9012;&#x4FE1;&#x606F;&#xFF0C;&#x8FD8;&#x8981;&#x80FD;&#x591F;&#x4F20;&#x9012;&#x4EF7;&#x503C;&#xFF0C;&#x6216;&#x8005;&#x8BF4;&#x4E92;&#x8054;&#x7F51;&#x5E94;&#x8BE5;&#x62E5;&#x6709;&#x81EA;&#x5DF1;&#x7684;&#x94B1;&#x3002;&#x4E8E;&#x662F;&#x5728;&#x8FD9;&#x6761;&#x9053;&#x8DEF;&#x4E0A;&#xFF0C; 1994&#x5E74;&#xFF0C;Nick Szabo &#x63D0;&#x51FA;&#x4E86;&#x667A;&#x80FD;&#x5408;&#x7EA6;&#x7684;&#x6982;&#x5FF5;&#x3002;1998&#x5E74; Wei Dai &#xFF0C;&#x8BBE;&#x8BA1;&#x4E86; B-Money &#xFF0C;&#x91C7;&#x7528;&#x7684;&#x5C31;&#x662F;&#x6240;&#x6709;&#x4EBA;&#x90FD;&#x53C2;&#x4E0E;&#x8BB0;&#x8D26;&#x7684;&#x65B9;&#x5F0F;&#x3002;2002&#x5E74; Adam Back &#x53D1;&#x660E;&#x4E86; Hashcash &#x7CFB;&#x7EDF;&#xFF0C;&#x6BD4;&#x7279;&#x5E01;&#x7684; POW &#x6316;&#x77FF;&#x601D;&#x8DEF;&#xFF0C;&#x5C31;&#x6765;&#x81EA; Hashcash  <a href="http://www.hashcash.org/papers/hashcash.pdf" target="_blank">http://www.hashcash.org/papers/hashcash.pdf</a> &#x3002;2008&#x5E74;&#xFF0C;&#x51FA;&#x4E86;&#x4E2A;&#x96C6;&#x5927;&#x6210;&#x8005;&#x4E2D;&#x672C;&#x806A;&#xFF0C;&#x53D1;&#x5E03;&#x4E86;&#x300A;&#x6BD4;&#x7279;&#x5E01;&#x300B;&#x521B;&#x4E16;&#x8BBA;&#x6587;&#x3002;</p>
<p>&#x4ECE;&#x5BC6;&#x7801;&#x5B66;&#x6C11;&#x7528;&#xFF0C;&#x5230;&#x5BC6;&#x7801;&#x670B;&#x514B;&#x8FD0;&#x52A8;&#xFF0C;&#x5230;&#x533A;&#x5757;&#x94FE;&#x548C;&#x6BD4;&#x7279;&#x5E01;&#x53D8;&#x5F97;&#x8857;&#x77E5;&#x5DF7;&#x95FB;&#xFF0C;&#x4E00;&#x8DEF;&#x8D70;&#x6765;&#xFF0C;&#x8FD9;&#x80CC;&#x540E;&#x7684;&#x4E3B;&#x529B;&#x4E0D;&#x662F;&#x516C;&#x53F8;&#xFF0C;&#x800C;&#x662F;&#x793E;&#x533A;&#x3002;</p>
<h2 id="&#x5173;&#x952E;&#x8A00;&#x8BBA;">&#x5173;&#x952E;&#x8A00;&#x8BBA;</h2>
<p>&#x6700;&#x540E;&#x4E00;&#x90E8;&#x5206;&#x6765;&#x5C55;&#x793A;&#x4E00;&#x4E0B;&#x793E;&#x533A;&#x7684;&#x540D;&#x4EBA;&#x7684;&#x8A00;&#x8BBA;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x66F4;&#x7ACB;&#x4F53;&#x7684;&#x4F53;&#x4F1A;&#x5BC6;&#x7801;&#x670B;&#x514B;&#x8FD0;&#x52A8;&#x7684;&#x4E3B;&#x5F20;&#x3002;</p>
<p>&#x9996;&#x5148;&#x7B2C;&#x4E00;&#x4E2A;&#x4E3B;&#x5F20;&#x5C31;&#x662F;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x3002;&#x56FD;&#x5185;&#x62A5;&#x9053;&#x6BD4;&#x8F83;&#x5E7F;&#x7684;&#x4E00;&#x4E2A;&#x4EBA;&#x5C31;&#x662F;&#x963F;&#x6851;&#x5947;&#x4E86;&#x3002;&#x963F;&#x6851;&#x5947;&#x662F;&#x7EF4;&#x57FA;&#x89E3;&#x5BC6;&#x7684;&#x521B;&#x59CB;&#x4EBA;&#xFF0C;&#x662F;&#x76EE;&#x524D;&#x7EF4;&#x57FA;&#x89E3;&#x5BC6;&#x7684;&#x8138;&#x9762;&#xFF0C;&#x4E5F;&#x662F;&#x5BC6;&#x7801;&#x670B;&#x514B;&#x8FD0;&#x52A8;&#x7684;&#x9886;&#x5BFC;&#x4EBA;&#x7269;&#x4E4B;&#x4E00;&#x3002;&#x4ED6;&#x5728;&#x81EA;&#x5DF1;&#x7684;&#x4E66;&#x300A;&#x5BC6;&#x7801;&#x670B;&#x514B;&#xFF1A;&#x81EA;&#x7531;&#x4E0E;&#x4E92;&#x8054;&#x7F51;&#x7684;&#x672A;&#x6765;&#x300B;&#x4E2D;&#x63D0;&#x5230;&#xFF0C;&#x4EE5; Facebook &#x548C;&#x8C37;&#x6B4C;&#x8FD9;&#x4E9B;&#x4E3A;&#x4EE3;&#x8868;&#x7684;&#x5927;&#x7EC4;&#x7EC7;&#x5DF2;&#x7ECF;&#x5BF9;&#x4E2A;&#x4EBA;&#x9690;&#x79C1;&#x5F62;&#x6210;&#x4E86;&#x4E25;&#x91CD;&#x7684;&#x5A01;&#x80C1;&#x3002;&#x4E07;&#x7EF4;&#x7F51;&#x4E4B;&#x7236; Tim Berner-Lee &#x8BF4;</p>
<blockquote>
<p>&#x533A;&#x5757;&#x94FE;&#x7684;&#x7CBE;&#x795E;&#x662F;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x7684;&#xFF0C;&#x4E2A;&#x4EBA;&#x83B7;&#x5F97;&#x4E86;&#x6781;&#x5927;&#x7684;&#x6743;&#x529B;&#x3002;&#x533A;&#x5757;&#x94FE;&#x4F1A;&#x8BA9;&#x4E92;&#x8054;&#x7F51;&#x53D8;&#x6210;&#x4E00;&#x4E2A;&#x4EBA;&#x4EBA;&#x66F4;&#x52A0;&#x5E73;&#x7B49;&#x7684;&#x7CFB;&#x7EDF;&#x3002;&#x628A;&#x6743;&#x529B;&#x4ECE;&#x4E2D;&#x592E;&#x6743;&#x5A01;&#x624B;&#x91CC;&#x8FD8;&#x7ED9;&#x6BCF;&#x4E2A;&#x4EBA;&#x3002;</p>
</blockquote>
<p>&#x7B2C;&#x4E8C;&#x4E2A;&#x4E3B;&#x5F20;&#xFF0C;&#x7528;&#x6280;&#x672F;&#x521B;&#x5EFA;&#x66F4;&#x52A0;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x548C;&#x9AD8;&#x6548;&#x7387;&#x7684;&#x793E;&#x4F1A;&#x3002;&#x4E2D;&#x5FC3;&#x5316;&#x7684;&#x597D;&#x5904;&#x5C31;&#x662F;&#x9AD8;&#x6548;&#xFF0C;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x7684;&#x597D;&#x5904;&#x662F;&#x516C;&#x5E73;&#x3002;&#x672A;&#x6765;&#x7684;&#x65B9;&#x5411;&#x4E00;&#x5B9A;&#x662F;&#x5728;&#x516C;&#x5E73;&#x7684;&#x57FA;&#x7840;&#x4E0A;&#x66F4;&#x597D;&#x7684;&#x63D0;&#x9AD8;&#x793E;&#x4F1A;&#x6548;&#x7387;&#x3002;&#x667A;&#x80FD;&#x5408;&#x7EA6;&#x7684;&#x63D0;&#x51FA;&#x8005; Nick Szabo &#x5728;2015&#x5E74;&#x4EE5;&#x592A;&#x574A;&#x7684;&#x4E00;&#x6B21;&#x4F1A;&#x8BAE;&#x4E0A;&#x63D0;&#x5230;&#xFF0C;&#x4E2D;&#x5FC3;&#x5316;&#x7CFB;&#x7EDF;&#x6700;&#x5927;&#x7684;&#x95EE;&#x9898;&#x662F;&#x4E0D;&#x5B89;&#x5168;&#xFF0C;&#x56E0;&#x4E3A;&#x4EFB;&#x4F55;&#x7CFB;&#x7EDF;&#x8BBE;&#x8BA1;&#x7684;&#x6700;&#x5927;&#x6F0F;&#x6D1E;&#x5C31;&#x662F;&#x53BB;&#x76F8;&#x4FE1;&#x964C;&#x751F;&#x4EBA;&#xFF0C;&#x800C;&#x4E2D;&#x5FC3;&#x5F80;&#x5F80;&#x5C31;&#x662F;&#x964C;&#x751F;&#x4EBA;&#x3002;&#x52A0;&#x5BC6;&#x6280;&#x672F;&#x548C;&#x4E92;&#x8054;&#x7F51;&#x878D;&#x5408;&#x800C;&#x6210;&#x7684;&#x533A;&#x5757;&#x94FE;&#xFF0C;&#x8981;&#x5B9E;&#x73B0;&#x7684;&#x5C31;&#x662F;&#x201D;&#x53BB;&#x4FE1;&#x4EFB;&#x201C;&#x3002;&#x53E6;&#x5916;&#xFF0C;&#x6CD5;&#x5F8B;&#x662F;&#x6F6E;&#x6E7F;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x4EE3;&#x7801;&#x662F;&#x6652;&#x5E72;&#x540E;&#x7684;&#x6CD5;&#x5F8B;&#xFF0C;&#x56E0;&#x4E3A;&#x4EE3;&#x7801;&#x662F;&#x660E;&#x786E;&#x7684;&#xFF0C;&#x6CD5;&#x5F8B;&#x7684;&#x89E3;&#x8BFB;&#x662F;&#x4F1A;&#x6709;&#x6B67;&#x4E49;&#x7684;&#xFF0C;&#x53D6;&#x51B3;&#x4E0E;&#x4EBA;&#x6587;&#x89C2;&#x5FF5;&#x7684;&#x53D8;&#x5316;&#x548C;&#x6267;&#x6CD5;&#x8005;&#x7684;&#x4E2A;&#x4EBA;&#x7406;&#x89E3;&#x3002;</p>
<p>&#x5F53;&#x7136;&#xFF0C;&#x793E;&#x533A;&#x91CC;&#x6CA1;&#x6709;&#x4EBA;&#x6709;&#x8D44;&#x683C;&#x8BF4;&#x81EA;&#x5DF1;&#x7684;&#x8A00;&#x8BBA;&#x5C31;&#x80FD;&#x4EE3;&#x8868;&#x793E;&#x533A;&#x771F;&#x6B63;&#x7684;&#x601D;&#x60F3;&#x3002;&#x793E;&#x533A;&#x7684;&#x771F;&#x6B63;&#x63A8;&#x52A8;&#x529B;&#x662F;&#x5728;&#x4E0D;&#x65AD;&#x7684;&#x535A;&#x5F08;&#x4E2D;&#x8FBE;&#x6210;&#x7684;&#x5171;&#x8BC6;&#x3002;</p>
<h2 id="&#x603B;&#x7ED3;">&#x603B;&#x7ED3;</h2>
<p>&#x8FD9;&#x5C31;&#x662F; Peter &#x60F3;&#x8DDF;&#x5927;&#x5BB6;&#x5206;&#x4EAB;&#x7684;&#x5BC6;&#x7801;&#x670B;&#x514B;&#x8FD0;&#x52A8;&#x7684;&#x6240;&#x6709;&#x5185;&#x5BB9;&#x4E86;&#x3002;&#x4ECE;&#x5386;&#x53F2;&#x4E0A;&#x770B;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x7531;&#x793E;&#x4F1A;&#x9876;&#x7EA7;&#x77E5;&#x8BC6;&#x5206;&#x5B50;&#x53D1;&#x8D77;&#x7684;&#x6C11;&#x6743;&#x8FD0;&#x52A8;&#xFF0C;&#x4E3B;&#x5F20;&#x7528;&#x5BC6;&#x7801;&#x5B66;&#x7684;&#x65B9;&#x5F0F;&#x9650;&#x5236;&#x5F3A;&#x52BF;&#x7FA4;&#x4F53;&#x5BF9;&#x5F31;&#x52BF;&#x7FA4;&#x4F53;&#x7684;&#x9690;&#x79C1;&#x7684;&#x5265;&#x593A;&#x3002;&#x5BC6;&#x7801;&#x670B;&#x514B;&#x793E;&#x533A;&#x4E5F;&#x662F;&#x5F00;&#x6E90;&#x8F6F;&#x4EF6;&#x793E;&#x533A;&#x7684;&#x4E00;&#x4E2A;&#x5206;&#x652F;&#xFF0C;&#x4ECE;&#x90AE;&#x4EF6;&#x5217;&#x8868;&#x7684;&#x53D1;&#x8D77;&#x4EBA; John Gilmore &#x7684;&#x8EAB;&#x4EFD;&#x4E5F;&#x80FD;&#x4F53;&#x73B0;&#x51FA;&#x6765;&#x3002;&#x4E92;&#x8054;&#x7F51;&#x7684;&#x57FA;&#x77F3;&#x662F;&#x5F00;&#x6E90;&#x8F6F;&#x4EF6;&#xFF0C;&#x8BF4;&#x4E92;&#x8054;&#x7F51;&#x8BDE;&#x751F;&#x5728;&#x5F00;&#x6E90;&#x8F6F;&#x4EF6;&#x793E;&#x533A;&#x662F;&#x4E00;&#x70B9;&#x90FD;&#x4E0D;&#x4E3A;&#x8FC7;&#x7684;&#x3002;&#x4F46;&#x662F;&#x4E92;&#x8054;&#x7F51;&#x672C;&#x8EAB;&#x7F3A;&#x4E4F;&#x9690;&#x79C1;&#x4FDD;&#x62A4;&#x5C42;&#xFF0C;&#x800C;&#x52A0;&#x5BC6;&#x6280;&#x672F;&#x4F1A;&#x63A8;&#x52A8;&#x4E92;&#x8054;&#x7F51;&#x671D;&#x7740;&#x66F4;&#x52A0;&#x516C;&#x5E73;&#x548C;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x7684;&#x65B9;&#x5411;&#x53D1;&#x5C55;&#xFF0C;&#x6709;&#x4EBA;&#x628A;&#x533A;&#x5757;&#x94FE;&#x6280;&#x672F;&#x79F0;&#x4E3A;&#x4E92;&#x8054;&#x7F51;2.0&#xFF0C;&#x5C31;&#x5305;&#x542B;&#x8FD9;&#x4E2A;&#x610F;&#x601D;&#x3002;</p>
<p>&#x53C2;&#x8003;&#xFF1A;</p>
<ul>
<li><a href="https://en.wikipedia.org/wiki/Cypherpunk" target="_blank">https://en.wikipedia.org/wiki/Cypherpunk</a></li>
<li><a href="https://www.youtube.com/watch?v=YpSeOU1VVj4" target="_blank">https://www.youtube.com/watch?v=YpSeOU1VVj4</a></li>
<li><a href="https://www.activism.net/cypherpunk/manifesto.html" target="_blank">https://www.activism.net/cypherpunk/manifesto.html</a></li>
</ul>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="./" class="navigation navigation-prev " aria-label="Previous page: Introduction">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="2-crypto.html" class="navigation navigation-next " aria-label="Next page: 什么是密码学">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"密码朋克运动","level":"1.2","depth":1,"next":{"title":"什么是密码学","level":"1.3","depth":1,"path":"2-crypto.md","ref":"2-crypto.md","articles":[]},"previous":{"title":"Introduction","level":"1.1","depth":1,"path":"README.md","ref":"README.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["livereload"],"pluginsConfig":{"livereload":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"1-punk.md","mtime":"2019-07-30T23:37:08.637Z","type":"markdown"},"gitbook":{"version":"3.2.2","time":"2019-07-30T23:38:07.793Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

