
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>Merkle Tree · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.2">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="11-ecc.html" />
    
    
    <link rel="prev" href="9-math.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="1-punk.html">
            
                <a href="1-punk.html">
            
                    
                    密码朋克运动
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="2-crypto.html">
            
                <a href="2-crypto.html">
            
                    
                    什么是密码学
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="3-hash.html">
            
                <a href="3-hash.html">
            
                    
                    哈希算法
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="4-pub.html">
            
                <a href="4-pub.html">
            
                    
                    公开密钥加密
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="5-com.html">
            
                <a href="5-com.html">
            
                    
                    加密通信
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="6-sign.html">
            
                <a href="6-sign.html">
            
                    
                    数字签名
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="7-ca.html">
            
                <a href="7-ca.html">
            
                    
                    数字证书
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="8-idea.html">
            
                <a href="8-idea.html">
            
                    
                    RSA 算法--基本原理篇
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="9-math.html">
            
                <a href="9-math.html">
            
                    
                    RSA 算法--粗略数学推导篇
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.11" data-path="10-merk.html">
            
                <a href="10-merk.html">
            
                    
                    Merkle Tree
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="11-ecc.html">
            
                <a href="11-ecc.html">
            
                    
                    椭圆曲线密码学简介
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >Merkle Tree</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <p>&#x6211;&#x4EEC;&#x4E3A;&#x5565;&#x53C8;&#x804A; Merkle Tree &#x5462;&#xFF1F; &#x5730;&#x7403;&#x4E0A;&#x5927;&#x90E8;&#x5206;&#x4EBA;&#x5E94;&#x8BE5;&#x8FDE;&#x5B83;&#x7684;&#x540D;&#x5B57;&#x90FD;&#x6CA1;&#x6709;&#x542C;&#x8FC7;&#x3002;Merkle Tree &#x662F;&#x7531;&#x8BA1;&#x7B97;&#x673A;&#x79D1;&#x5B66;&#x5BB6; Ralph Merkle &#x5728;&#x5F88;&#x591A;&#x5E74;&#x524D;&#x63D0;&#x51FA;&#x7684;&#xFF0C;&#x5E76;&#x4EE5;&#x4ED6;&#x672C;&#x4EBA;&#x7684;&#x540D;&#x5B57;&#x6765;&#x547D;&#x540D;&#xFF0C;&#x4E2D;&#x6587;&#x7FFB;&#x8BD1;&#x8FC7;&#x6765;&#x53EB;&#x9ED8;&#x514B;&#x5C14;&#x6811;&#xFF0C;&#x4E5F;&#x53EB;&#x54C8;&#x5E0C;&#x6811;&#x3002;Merkle Tree &#x53F7;&#x79F0;&#x533A;&#x5757;&#x94FE;&#x9762;&#x8BD5;&#x5FC5;&#x8003;&#x9898;&#xFF0C;&#x56E0;&#x4E3A;&#x7684;&#x786E;&#x592A;&#x5E38;&#x7528;&#x4E86;&#x3002;&#x8BF4;&#x5230;&#x6839;&#x672C;&#x4E0A; Merkle Tree &#x5C31;&#x662F;&#x7528;&#x6765;&#x505A;&#x5B8C;&#x6574;&#x6027;&#x6821;&#x9A8C;&#x7684;&#xFF0C;&#x6240;&#x8C13;&#x7684;&#x5B8C;&#x6574;&#x6027;&#x6821;&#x9A8C;&#xFF0C;&#x5C31;&#x662F;&#x68C0;&#x67E5;&#x4E00;&#x4E0B;&#x6570;&#x636E;&#x6709;&#x6CA1;&#x6709;&#x635F;&#x574F;&#x6216;&#x8005;&#x88AB;&#x6076;&#x610F;&#x7BE1;&#x6539;&#x3002;Merkle Tree &#x7684;&#x6700;&#x5927;&#x7684;&#x5E94;&#x7528;&#x573A;&#x5408;&#x5C31;&#x662F;&#x5728;&#x70B9;&#x5BF9;&#x70B9;&#x7F51;&#x7EDC;&#x4E0A;&#xFF0C;Git &#x7248;&#x672C;&#x63A7;&#x5236;&#x7CFB;&#x7EDF;&#xFF0C;IPFS &#x534F;&#x8BAE;&#x4EE5;&#x53CA;&#x6BD4;&#x7279;&#x5E01;&#x4EE5;&#x592A;&#x574A;&#x7B49;&#x7B49;&#x9879;&#x76EE;&#xFF0C;&#x90FD;&#x7528;&#x5230;&#x4E86;&#x5B83;&#x3002;</p>
<h2 id="&#x54C8;&#x5E0C;-hash">&#x54C8;&#x5E0C; Hash</h2>
<p>Merkle Tree &#x5982;&#x679C;&#x76F4;&#x63A5;&#x53BB;&#x770B;&#x5B9A;&#x4E49;&#xFF0C;&#x4F1A;&#x770B;&#x5230;&#x4E00;&#x5F20;&#x6BD4;&#x8F83;&#x590D;&#x6742;&#x7684;&#x56FE;&#xFF0C;&#x53EF;&#x80FD;&#x4F1A;&#x628A;&#x4F60;&#x4E00;&#x4E0B;&#x5B50;&#x5413;&#x5230;&#xFF0C;&#x7136;&#x540E;&#x5C31;&#x4E0D;&#x60F3;&#x5B66;&#x4E86;&#x3002;&#x4F46;&#x662F;&#x522B;&#x5FD8;&#x4E86;&#xFF0C;Merkle Tree &#x8FD8;&#x6709;&#x53E6;&#x5916;&#x4E00;&#x4E2A;&#x540D;&#x5B57;&#xFF0C;&#x53EB;&#x54C8;&#x5E0C;&#x6811;&#x3002;&#x8FD9;&#x91CC;&#xFF0C;Peter &#x4F1A;&#x5148;&#x8BB2;&#x54C8;&#x5E0C;&#xFF0C;&#x518D;&#x8BB2;&#x4EC0;&#x4E48;&#x662F;&#x54C8;&#x5E0C;&#x5217;&#x8868;&#xFF0C;&#x6700;&#x540E;&#x5728;&#x9012;&#x8FDB;&#x5230;&#x54C8;&#x5E0C;&#x6811;&#xFF0C;&#x8FD9;&#x6837;&#x4E09;&#x6B65;&#x4E0B;&#x6765;&#xFF0C;&#x6BCF;&#x4E00;&#x6B65;&#x90FD;&#x5176;&#x5B9E;&#x5F88;&#x597D;&#x7406;&#x89E3;&#xFF0C;&#x4FDD;&#x8BC1;&#x4F60;&#x80FD;&#x4E00;&#x4E0B;&#x5B50;&#x5C31;&#x638C;&#x63E1; Merkle Tree &#x7684;&#x6982;&#x5FF5;&#x3002;</p>
<p>&#x5148;&#x4ECB;&#x7ECD;&#x4EC0;&#x4E48;&#x662F;&#x54C8;&#x5E0C;&#x3002;&#x5176;&#x5B9E;&#x8981;&#x5B9E;&#x73B0;&#x5B8C;&#x6574;&#x6027;&#x6821;&#x9A8C;&#xFF0C;&#x6700;&#x7B80;&#x5355;&#x7684;&#x65B9;&#x6CD5;&#x5C31;&#x662F;&#x5BF9;&#x8981;&#x6821;&#x9A8C;&#x7684;&#x6574;&#x4E2A;&#x7684;&#x6570;&#x636E;&#x6587;&#x4EF6;&#x505A;&#x4E2A;&#x54C8;&#x5E0C;&#x8FD0;&#x7B97;&#xFF0C;&#x628A;&#x5F97;&#x5230;&#x7684;&#x54C8;&#x5E0C;&#x503C;&#x516C;&#x5E03;&#x5728;&#x7F51;&#x4E0A;&#xFF0C;&#x8FD9;&#x6837;&#x6211;&#x4EEC;&#x628A;&#x6570;&#x636E;&#x4E0B;&#x8F7D;&#x5230;&#x624B;&#x4E4B;&#x540E;&#xFF0C;&#x518D;&#x6B21;&#x8FD0;&#x7B97;&#x4E00;&#x4E0B;&#x54C8;&#x5E0C;&#x503C;&#xFF0C;&#x5982;&#x679C;&#x8FD0;&#x7B97;&#x7ED3;&#x679C;&#x76F8;&#x7B49;&#xFF0C;&#x5C31;&#x8868;&#x793A;&#x6211;&#x4EEC;&#x4E0B;&#x8F7D;&#x8FC7;&#x7A0B;&#x4E2D;&#x6587;&#x4EF6;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x7684;&#x635F;&#x574F;&#x3002;&#x56E0;&#x4E3A;&#x54C8;&#x5E0C;&#x7684;&#x6700;&#x5927;&#x7279;&#x70B9;&#x662F;&#xFF0C;&#x5982;&#x679C;&#x6570;&#x636E;&#x7A0D;&#x5FAE;&#x53D8;&#x4E86;&#x4E00;&#x70B9;&#x70B9;&#xFF0C;&#x90A3;&#x4E48;&#x7ECF;&#x8FC7;&#x54C8;&#x5E0C;&#x8FD0;&#x7B97;&#xFF0C;&#x5F97;&#x5230;&#x7684;&#x54C8;&#x5E0C;&#x503C;&#x5C06;&#x4F1A;&#x53D8;&#x5F97;&#x9762;&#x76EE;&#x5168;&#x975E;&#x3002;&#x6CA1;&#x6709;&#x4EBA;&#x53EF;&#x4EE5;&#x628A;&#x6570;&#x636E;&#x7BE1;&#x6539;&#x4E86;&#xFF0C;&#x540C;&#x65F6;&#x8FD8;&#x80FD;&#x4FDD;&#x8BC1;&#x6570;&#x636E;&#x7684;&#x54C8;&#x5E0C;&#x4E0D;&#x53D8;&#x3002;</p>
<p><img src="https://img.haoqicat.com/2018092401.jpg" alt=""></p>
<p>&#x8FD9;&#x79CD;&#x7B80;&#x5355;&#x7684;&#x91C7;&#x7528;&#x54C8;&#x5E0C;&#x7684;&#x65B9;&#x5F0F;&#x505A;&#x6570;&#x636E;&#x8FD0;&#x7B97;&#xFF0C;&#x6BD4;&#x8F83;&#x9002;&#x5408;&#x6570;&#x636E;&#x672C;&#x8EAB;&#x4E0D;&#x505A;&#x5206;&#x5272;&#xFF0C;&#x540C;&#x65F6;&#x662F;&#x653E;&#x5728;&#x4E00;&#x53F0;&#x670D;&#x52A1;&#x5668;&#x4E0A;&#x7684;&#x60C5;&#x51B5;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5982;&#x679C;&#x53BB;&#x67D0;&#x4E2A;&#x516C;&#x53F8;&#x7F51;&#x7AD9;&#x4E0A;&#x53BB;&#x4E0B;&#x8F7D;&#x4ED6;&#x4EEC;&#x7684;&#x4E00;&#x4E2A;&#x8F6F;&#x4EF6;&#xFF0C;&#x5C31;&#x4F1A;&#x770B;&#x5230;&#x516C;&#x53F8;&#x7F51;&#x7AD9;&#x4E0A;&#x516C;&#x5E03;&#x4E86;&#x8FD9;&#x4E2A;&#x4E0B;&#x8F7D;&#x5305;&#x7684;&#x54C8;&#x5E0C;&#x503C;&#xFF0C;&#x8FD9;&#x4E2A;&#x54C8;&#x5E0C;&#x503C;&#x975E;&#x5E38;&#x91CD;&#x8981;&#xFF0C;&#x56E0;&#x4E3A;&#x6709;&#x4E86;&#x8FD9;&#x4E32;&#x6570;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x53EF;&#x4EE5;&#x653E;&#x5FC3;&#x7684;&#x53BB;&#x4E0B;&#x8F7D;&#x8FD9;&#x4E2A;&#x8F6F;&#x4EF6;&#xFF0C;&#x4E0B;&#x8F7D;&#x5B8C;&#x505A;&#x4E00;&#x4E0B;&#x5B8C;&#x6574;&#x6027;&#x6821;&#x9A8C;&#xFF0C;&#x5C31;&#x77E5;&#x9053;&#x8FD9;&#x4E2A;&#x8F6F;&#x4EF6;&#x6CA1;&#x6709;&#x635F;&#x574F;&#x3002;&#x751A;&#x81F3;&#x53EF;&#x4EE5;&#x653E;&#x5FC3;&#x4ECE;&#x5176;&#x4ED6;&#x7684;&#x4E0D;&#x53EF;&#x4FE1;&#x7F51;&#x7AD9;&#x4E0A;&#x53BB;&#x4E0B;&#x8F7D;&#x8FD9;&#x4E2A;&#x8F6F;&#x4EF6;&#x5305;&#xFF0C;&#x56E0;&#x4E3A;&#x6709;&#x4E86;&#x6821;&#x9A8C;&#x673A;&#x5236;&#xFF0C;&#x4E5F;&#x4E00;&#x6837;&#x53EF;&#x4EE5;&#x4FDD;&#x8BC1;&#x8FD9;&#x4E2A;&#x5305;&#x662F;&#x8DDF;&#x5B98;&#x65B9;&#x7684;&#x5305;&#x4E1D;&#x6BEB;&#x4E0D;&#x5DEE;&#x7684;&#x3002;</p>
<h2 id="&#x54C8;&#x5E0C;&#x5217;&#x8868;-hash-list">&#x54C8;&#x5E0C;&#x5217;&#x8868; Hash List</h2>
<p>&#x4F46;&#x662F;&#x5728;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x7F51;&#x7EDC;&#xFF0C;&#x6216;&#x8005;&#x53EB;&#x70B9;&#x5BF9;&#x70B9;&#x7F51;&#x7EDC;&#x4E0A;&#xFF0C;&#x6570;&#x636E;&#x5F80;&#x5F80;&#x90FD;&#x662F;&#x62C6;&#x5206;&#x6210;&#x5F88;&#x591A;&#x5C0F;&#x788E;&#x7247;&#x53BB;&#x4E0B;&#x8F7D;&#x7684;&#xFF0C;&#x800C;&#x4E14;&#x5176;&#x4E2D;&#x5F88;&#x591A;&#x673A;&#x5668;&#x53EF;&#x4EE5;&#x8BA4;&#x4E3A;&#x662F;&#x4E0D;&#x7A33;&#x5B9A;&#x6216;&#x8005;&#x662F;&#x4E0D;&#x53EF;&#x4FE1;&#x7684;&#xFF0C;&#x8FD9;&#x65F6;&#x9700;&#x8981;&#x6709;&#x66F4;&#x52A0;&#x5DE7;&#x5999;&#x7684;&#x505A;&#x6CD5;&#x3002;&#x6700;&#x7B80;&#x5355;&#x7684;&#x65B9;&#x5F0F;&#x5C31;&#x662F;&#x7528; Hash List &#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x54C8;&#x5E0C;&#x5217;&#x8868;&#x3002;</p>
<p><img src="https://img.haoqicat.com/2018092402.jpg" alt=""></p>
<p>&#x5B9E;&#x9645;&#x4E2D;&#xFF0C;&#x70B9;&#x5BF9;&#x70B9;&#x7F51;&#x7EDC;&#x5728;&#x4F20;&#x8F93;&#x6570;&#x636E;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5176;&#x5B9E;&#x90FD;&#x662F;&#x628A;&#x6BD4;&#x8F83;&#x5927;&#x7684;&#x4E00;&#x4E2A;&#x6587;&#x4EF6;&#xFF0C;&#x5207;&#x6210;&#x5C0F;&#x7684;&#x6570;&#x636E;&#x5757;&#x3002;&#x8FD9;&#x6837;&#x7684;&#x597D;&#x5904;&#x662F;&#xFF0C;&#x5982;&#x679C;&#x6709;&#x4E00;&#x4E2A;&#x5C0F;&#x5757;&#x6570;&#x636E;&#x5728;&#x4F20;&#x8F93;&#x8FC7;&#x7A0B;&#x4E2D;&#x635F;&#x574F;&#x4E86;&#xFF0C;&#x90A3;&#x6211;&#x53EA;&#x8981;&#x91CD;&#x65B0;&#x4E0B;&#x8F7D;&#x8FD9;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x5757;&#x5C31;&#x884C;&#x4E86;&#xFF0C;&#x4E0D;&#x7528;&#x91CD;&#x65B0;&#x4E0B;&#x8F7D;&#x6574;&#x4E2A;&#x6587;&#x4EF6;&#x3002;&#x5F53;&#x7136;&#x8FD9;&#x5C31;&#x8981;&#x6C42;&#x5BF9;&#x6BCF;&#x4E2A;&#x6570;&#x636E;&#x5757;&#x8BA1;&#x7B97;&#x54C8;&#x5E0C;&#x503C;&#xFF0C;&#x6240;&#x6709;&#x8FD9;&#x4E9B;&#x5C0F;&#x6570;&#x636E;&#x5757;&#x7684;&#x54C8;&#x5E0C;&#x503C;&#x90FD;&#x662F;&#x5144;&#x5F1F;&#x5173;&#x7CFB;&#xFF0C;&#x8FD9;&#x6837;&#x5927;&#x5BB6;&#x5C31;&#x7EC4;&#x6210;&#x4E86;&#x4E00;&#x4E2A;&#x54C8;&#x5E0C;&#x5217;&#x8868;&#x3002;BT &#x4E0B;&#x8F7D;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5728;&#x4E0B;&#x8F7D;&#x771F;&#x6B63;&#x7684;&#x6570;&#x636E;&#x4E4B;&#x524D;&#xFF0C;&#x4F1A;&#x5148;&#x4E0B;&#x8F7D;&#x4E00;&#x4E2A;&#x54C8;&#x5E0C;&#x5217;&#x8868;&#x7684;&#xFF0C;&#x8FD9;&#x4E2A;&#x5C31;&#x662F;&#x6240;&#x8C13;&#x7684;&#x79CD;&#x5B50;&#x6587;&#x4EF6;&#x3002;&#x6709;&#x4E86;&#x5404;&#x4E2A; hash &#x4E4B;&#x540E;&#xFF0C;&#x6570;&#x636E;&#x672C;&#x8EAB;&#x5C31;&#x53EF;&#x4EE5;&#x4ECE;&#x4EFB;&#x610F;&#x7684;&#x673A;&#x5668;&#x4E0A;&#x4E0B;&#x8F7D;&#x4E86;&#xFF0C;&#x4E0D;&#x7528;&#x7BA1;&#x90A3;&#x4E9B;&#x673A;&#x5668;&#x662F;&#x5426;&#x662F;&#x5B89;&#x5168;&#x53EF;&#x4FE1;&#x7684;&#x3002;</p>
<p>&#x8FD9;&#x65F6;&#x6709;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#x5C31;&#x51FA;&#x73B0;&#x4E86;&#xFF0C;&#x90A3;&#x4E48;&#x591A;&#x7684;&#x54C8;&#x5E0C;&#xFF0C;&#x6211;&#x4EEC;&#x600E;&#x4E48;&#x4FDD;&#x8BC1;&#x5B83;&#x4EEC;&#x672C;&#x8EAB;&#x90FD;&#x662F;&#x6B63;&#x786E;&#x5730;&#x5462;&#xFF1F;</p>
<p><img src="https://img.haoqicat.com/2018092403.jpg" alt=""></p>
<p>&#x7B54;&#x6848;&#x662F;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x6839;&#x54C8;&#x5E0C;&#xFF0C;&#x6839;&#x5C31;&#x662F;&#x6811;&#x6839;&#x7684;&#x6839;&#x3002;&#x628A;&#x6BCF;&#x4E2A;&#x5C0F;&#x5757;&#x7684;&#x54C8;&#x5E0C;&#x503C;&#x62FC;&#x5230;&#x4E00;&#x8D77;&#xFF0C;&#x7136;&#x540E;&#x5BF9;&#x6574;&#x4E2A;&#x8FD9;&#x4E2A;&#x957F;&#x957F;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x518D;&#x505A;&#x4E00;&#x6B21;&#x54C8;&#x5E0C;&#x8FD0;&#x7B97;&#xFF0C;&#x6700;&#x7EC8;&#x7684;&#x7ED3;&#x679C;&#x5C31;&#x662F;&#x54C8;&#x5E0C;&#x5217;&#x8868;&#x7684;&#x6839;&#x54C8;&#x5E0C;&#x3002;&#x4E8E;&#x662F;&#xFF0C;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x80FD;&#x591F;&#x4FDD;&#x8BC1;&#x4ECE;&#x4E00;&#x4E2A;&#x7EDD;&#x5BF9;&#x53EF;&#x4FE1;&#x7684;&#x7F51;&#x7AD9;&#xFF0C;&#x6216;&#x8005;&#x4ECE;&#x6211;&#x4EEC;&#x7684;&#x670B;&#x53CB;&#x624B;&#x91CC;&#x62FF;&#x5230;&#x4E00;&#x4E2A;&#x6B63;&#x786E;&#x7684;&#x6839;&#x54C8;&#x5E0C;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x7528;&#x5B83;&#x6765;&#x6821;&#x9A8C;&#x54C8;&#x5E0C;&#x5217;&#x8868;&#x4E2D;&#x7684;&#x6BCF;&#x4E00;&#x4E2A;&#x54C8;&#x5E0C;&#x90FD;&#x662F;&#x6B63;&#x786E;&#x7684;&#xFF0C;&#x8FDB;&#x800C;&#x53EF;&#x4EE5;&#x4FDD;&#x8BC1;&#x4E0B;&#x8F7D;&#x7684;&#x6BCF;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x5757;&#x7684;&#x6B63;&#x786E;&#x6027;&#x4E86;&#x3002;</p>
<p>Hash List &#x4E5F;&#x5C31;&#x662F;&#x54C8;&#x5E0C;&#x5217;&#x8868;&#x5F62;&#x5F0F;&#xFF0C;&#x5C31;&#x975E;&#x5E38;&#x9002;&#x5408;&#x5728;&#x70B9;&#x5BF9;&#x70B9;&#x7F51;&#x7EDC;&#x4E0A;&#x5B58;&#x50A8;&#x7684;&#x5927;&#x578B;&#x6570;&#x636E;&#x4E86;&#x3002;</p>
<h2 id="merkle-tree-&#x54C8;&#x5E0C;&#x6811;">Merkle Tree &#x54C8;&#x5E0C;&#x6811;</h2>
<p>&#x5176;&#x5B9E; Merkle Tree &#x672C;&#x8EAB;&#x4E5F;&#x7B97;&#x662F;&#x4E00;&#x4E2A;&#x54C8;&#x5E0C;&#x5217;&#x8868;&#xFF0C;&#x53EA;&#x4E0D;&#x8FC7;&#x662F;&#x5728;&#x8FD9;&#x4E2A;&#x57FA;&#x7840;&#x4E0A;&#x53C8;&#x5F15;&#x5165;&#x4E86;&#x6811;&#x5F62;&#x7ED3;&#x6784;&#xFF0C;&#x4ECE;&#x800C;&#x83B7;&#x5F97;&#x4E86;&#x66F4;&#x9AD8;&#x7684;&#x7075;&#x6D3B;&#x6027;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x5148;&#x8BF4;&#x8BA1;&#x7B97;&#x673A;&#x79D1;&#x5B66;&#x4E2D;&#x7684;&#x6811;&#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x6811;&#x8DDF;&#x81EA;&#x7136;&#x754C;&#x4E00;&#x68F5;&#x6811;&#x6709;&#x7740;&#x7C7B;&#x4F3C;&#x7684;&#x7ED3;&#x6784;&#xFF0C;&#x53EA;&#x4E0D;&#x8FC7;&#x8BA1;&#x7B97;&#x673A;&#x79D1;&#x5B66;&#x4E2D;&#x7684;&#x6811;&#x901A;&#x5E38;&#x90FD;&#x662F;&#x5012;&#x7740;&#x753B;&#xFF0C;&#x6839;&#x5728;&#x4E0A;&#x9762;&#xFF0C;&#x7136;&#x540E;&#x4E00;&#x8DEF;&#x5F80;&#x4E0B;&#x5F00;&#x679D;&#x6563;&#x53F6;&#x3002;&#x4E3E;&#x4E00;&#x4E2A;&#x6700;&#x7B80;&#x5355;&#x7684;&#x4F8B;&#x5B50;&#xFF0C;&#x6240;&#x6709;&#x7684;&#x6587;&#x4EF6;&#x90FD;&#x5B58;&#x653E;&#x5728;&#x4E00;&#x4E2A;&#x6587;&#x4EF6;&#x5939;&#x4E2D;&#xFF0C;&#x8FD9;&#x4E2A;&#x6587;&#x4EF6;&#x5939;&#x5C31;&#x53EB;&#x6839;&#x6587;&#x4EF6;&#x5939;&#xFF0C;&#x6839;&#x5C31;&#x662F;&#x6811;&#x6839;&#x7684;&#x610F;&#x601D;&#xFF0C;&#x8FD9;&#x4E2A;&#x6587;&#x4EF6;&#x5939;&#x53C8;&#x4F1A;&#x5305;&#x542B;&#x5176;&#x4ED6;&#x6587;&#x4EF6;&#x5939;&#xFF0C;&#x5B50;&#x6587;&#x4EF6;&#x5939;&#x4E2D;&#x53C8;&#x4F1A;&#x5305;&#x542B;&#x5B59;&#x5B50;&#x8F88;&#x7684;&#x6587;&#x4EF6;&#x5939;&#x3002;&#x8FD9;&#x6837;&#x5C42;&#x5C42;&#x7684;&#x5305;&#x542B;&#x6216;&#x8005;&#x8BF4;&#x4ECE;&#x5C5E;&#x5173;&#x7CFB;&#xFF0C;&#x753B;&#x6210;&#x56FE;&#x5C31;&#x662F;&#x4E00;&#x68F5;&#x5012;&#x6302;&#x7684;&#x6811;&#xFF0C;&#x800C;&#x8FD9;&#x4E2A;&#x7ED3;&#x6784;&#x5C31;&#x662F;&#x8BA1;&#x7B97;&#x673A;&#x79D1;&#x5B66;&#x4E2D;&#x968F;&#x5904;&#x53EF;&#x89C1;&#x7684;&#x6811;&#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x600E;&#x4E48;&#x6837;&#xFF0C;&#x7B80;&#x5355;&#x5427;&#xFF1F;</p>
<p><img src="https://img.haoqicat.com/2018092404.jpg" alt=""></p>
<p>&#x7136;&#x540E;&#x5C31;&#x8BF4;&#x5230;&#x4E3B;&#x89D2; Merkle Tree &#x4E86;&#x3002;&#x5728;&#x6700;&#x5E95;&#x5C42;&#xFF0C;&#x548C;&#x54C8;&#x5E0C;&#x5217;&#x8868;&#x4E00;&#x6837;&#xFF0C;&#x6211;&#x4EEC;&#x628A;&#x6570;&#x636E;&#x5206;&#x6210;&#x5C0F;&#x7684;&#x6570;&#x636E;&#x5757;&#xFF0C;&#x6709;&#x76F8;&#x5E94;&#x5730;&#x54C8;&#x5E0C;&#x548C;&#x5B83;&#x5BF9;&#x5E94;&#x3002;&#x4F46;&#x662F;&#x5F80;&#x4E0A;&#x8D70;&#xFF0C;&#x5E76;&#x4E0D;&#x662F;&#x76F4;&#x63A5;&#x53BB;&#x8FD0;&#x7B97;&#x6839;&#x54C8;&#x5E0C;&#xFF0C;&#x800C;&#x662F;&#x628A;&#x76F8;&#x90BB;&#x7684;&#x4E24;&#x4E2A;&#x54C8;&#x5E0C;&#x5408;&#x5E76;&#x6210;&#x4E00;&#x4E2A;&#x5B57;&#x7B26;&#x4E32;&#xFF0C;&#x7136;&#x540E;&#x8FD0;&#x7B97;&#x8FD9;&#x4E2A;&#x5B57;&#x7B26;&#x4E32;&#x7684;&#x54C8;&#x5E0C;&#xFF0C;&#x8FD9;&#x6837;&#x6BCF;&#x4E24;&#x4E2A;&#x54C8;&#x5E0C;&#x5C31;&#x7ED3;&#x5A5A;&#x751F;&#x5B50;&#xFF0C;&#x5F97;&#x5230;&#x4E86;&#x4E00;&#x4E2A;&#x201D;&#x5B50;&#x54C8;&#x5E0C;&#x201C;&#x3002;&#x5982;&#x679C;&#x6700;&#x5E95;&#x5C42;&#x7684;&#x54C8;&#x5E0C;&#x603B;&#x6570;&#x662F;&#x5355;&#x6570;&#xFF0C;&#x90A3;&#x5230;&#x6700;&#x540E;&#x5FC5;&#x7136;&#x51FA;&#x73B0;&#x4E00;&#x4E2A;&#x5355;&#x8EAB;&#x54C8;&#x5E0C;&#xFF0C;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x5C31;&#x76F4;&#x63A5;&#x5BF9;&#x5B83;&#x8FDB;&#x884C;&#x54C8;&#x5E0C;&#x8FD0;&#x7B97;&#xFF0C;&#x6240;&#x4EE5;&#x4E5F;&#x80FD;&#x5F97;&#x5230;&#x5B83;&#x7684;&#x5B50;&#x54C8;&#x5E0C;&#x3002;&#x4E8E;&#x662F;&#x5F80;&#x4E0A;&#x63A8;&#xFF0C;&#x4F9D;&#x7136;&#x662F;&#x4E00;&#x6837;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x53EF;&#x4EE5;&#x5F97;&#x5230;&#x6570;&#x76EE;&#x66F4;&#x5C11;&#x7684;&#x65B0;&#x4E00;&#x7EA7;&#x54C8;&#x5E0C;&#xFF0C;&#x6700;&#x7EC8;&#x5FC5;&#x7136;&#x5F62;&#x6210;&#x4E00;&#x68F5;&#x5012;&#x6302;&#x7684;&#x6811;&#xFF0C;&#x5230;&#x4E86;&#x6811;&#x6839;&#x7684;&#x8FD9;&#x4E2A;&#x4F4D;&#x7F6E;&#xFF0C;&#x8FD9;&#x4E00;&#x4EE3;&#x5C31;&#x5269;&#x4E0B;&#x4E00;&#x4E2A;&#x6839;&#x54C8;&#x5E0C;&#x4E86;&#xFF0C;&#x6211;&#x4EEC;&#x628A;&#x5B83;&#x53EB;&#x505A; Merkle Root &#x3002;&#x9700;&#x8981;&#x8865;&#x5145;&#x4E00;&#x4E0B;&#x7684;&#x662F;&#xFF0C;&#x6839;&#x54C8;&#x5E0C;&#x6709;&#x65F6;&#x5019;&#x4E5F;&#x53EB;&#x4E3B;&#x54C8;&#x5E0C; Master Hash &#xFF0C;&#x4E5F;&#x6709;&#x4EBA;&#x53EB;&#x5B83;&#x9876;&#x54C8;&#x5E0C; Top Hash &#xFF0C;&#x56E0;&#x4E3A;&#x753B;&#x56FE;&#x7684;&#x65F6;&#x5019;&#x901A;&#x5E38;&#x90FD;&#x662F;&#x5012;&#x7740;&#x753B;&#x8FD9;&#x6839;&#x6811;&#xFF0C;&#x53CD;&#x6B63;&#x4E0D;&#x7BA1;&#x53EB;&#x4EC0;&#x4E48;&#xFF0C;&#x8BF4;&#x7684;&#x90FD;&#x662F;&#x4E00;&#x4E2A;&#x4E1C;&#x897F;&#x3002;</p>
<p><img src="https://img.haoqicat.com/2018092405.jpg" alt=""></p>
<p>&#x4E8E;&#x662F;&#x6211;&#x4EEC;&#x770B;&#x5230; Merkle Tree &#x6BD4;&#x666E;&#x901A;&#x7684;&#x54C8;&#x5E0C;&#x5217;&#x8868;&#x7A0D;&#x5FAE;&#x590D;&#x6742;&#x4E86;&#x4E00;&#x70B9;&#x70B9;&#xFF0C;&#x90A3;&#x4E48;&#x4F18;&#x70B9;&#x662F;&#x4EC0;&#x4E48;&#x5462;&#xFF1F;&#x76F8;&#x5BF9;&#x4E8E; Hash List&#xFF0C;Merkle Tree &#x7684;&#x660E;&#x663E;&#x7684;&#x4E00;&#x4E2A;&#x597D;&#x5904;&#x662F;&#x53EF;&#x4EE5;&#x5355;&#x72EC;&#x62FF;&#x51FA;&#x4E00;&#x4E2A;&#x5206;&#x652F;&#x6765;&#xFF08;&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x5C0F;&#x6811;&#xFF09;&#x5BF9;&#x90E8;&#x5206;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x6821;&#x9A8C;&#xFF0C;&#x8FD9;&#x7ED9;&#x5F88;&#x591A;&#x4F7F;&#x7528;&#x573A;&#x5408;&#x5C31;&#x5E26;&#x6765;&#x4E86;&#x54C8;&#x5E0C;&#x5217;&#x8868;&#x6240;&#x4E0D;&#x80FD;&#x6BD4;&#x62DF;&#x7684;&#x7075;&#x6D3B;&#x548C;&#x9AD8;&#x6027;&#x80FD;&#x3002;</p>
<p><img src="https://img.haoqicat.com/2018092406.jpg" alt=""></p>
<p>Merkle Tree &#x662F;&#x4E09;&#x4E2A;&#x6982;&#x5FF5;&#x7684;&#x53E0;&#x52A0;&#xFF0C;&#x4E00;&#x4E2A;&#x662F;&#x54C8;&#x5E0C;&#xFF0C;&#x7B2C;&#x4E8C;&#x4E2A;&#x662F;&#x54C8;&#x5E0C;&#x5217;&#x8868;&#xFF0C;&#x7B2C;&#x4E09;&#x4E2A;&#x662F;&#x6811;&#x3002;</p>
<h2 id="&#x603B;&#x7ED3;">&#x603B;&#x7ED3;</h2>
<p>&#x672C;&#x8282;&#x7684;&#x5185;&#x5BB9;&#x5C31;&#x662F;&#x4E3A;&#x4E86;&#x8BB2;&#x6E05;&#x695A; Merkle Tree &#x8FD9;&#x4E2A;&#x6982;&#x5FF5;&#xFF0C;&#x5185;&#x5BB9;&#x5DEE;&#x4E0D;&#x591A;&#x4E86;&#xFF0C;&#x6765;&#x603B;&#x7ED3;&#x4E00;&#x4E0B;&#x3002;&#x54C8;&#x5E0C;&#x548C;&#x6811;&#x90FD;&#x662F;&#x8BA1;&#x7B97;&#x673A;&#x79D1;&#x5B66;&#x4E2D;&#x6700;&#x57FA;&#x7840;&#x6700;&#x91CD;&#x8981;&#x7684;&#x4E24;&#x4E2A;&#x6982;&#x5FF5;&#xFF0C;&#x53EF;&#x4EE5;&#x7528;&#x5728;&#x5F88;&#x591A;&#x4E0D;&#x540C;&#x573A;&#x5408;&#x3002;&#x5355;&#x4E2A;&#x54C8;&#x5E0C;&#x4E0D;&#x80FD;&#x62C5;&#x5F53;&#x5927;&#x6587;&#x4EF6;&#x5728;&#x5206;&#x5E03;&#x5F0F;&#x70B9;&#x5BF9;&#x70B9;&#x7F51;&#x7EDC;&#x4E0A;&#x7684;&#x6821;&#x9A8C;&#x5DE5;&#x4F5C;&#xFF0C;&#x4E8E;&#x662F;&#x6211;&#x4EEC;&#x6709;&#x4E86;&#x54C8;&#x5E0C;&#x5217;&#x8868;&#x7684;&#x6982;&#x5FF5;&#x3002; Merkle Tree &#x53EF;&#x4EE5;&#x8BA4;&#x4E3A;&#x662F;&#x54C8;&#x5E0C;&#x5217;&#x8868;&#x7684;&#x4E00;&#x4E2A;&#x53D8;&#x4F53;&#xFF0C;&#x8BA9;&#x54C8;&#x5E0C;&#x5217;&#x8868;&#x53D8;&#x5F97;&#x66F4;&#x52A0;&#x7075;&#x6D3B;&#x9AD8;&#x6548;&#xFF0C;&#x56E0;&#x4E3A;&#x6BCF;&#x6B21;&#x6821;&#x9A8C;&#x90FD;&#x53EF;&#x4EE5;&#x5355;&#x7EAF;&#x62FF;&#x51FA;&#x6811;&#x7684;&#x4E00;&#x4E2A;&#x5206;&#x652F;&#x6765;&#x64CD;&#x4F5C;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="9-math.html" class="navigation navigation-prev " aria-label="Previous page: RSA 算法--粗略数学推导篇">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="11-ecc.html" class="navigation navigation-next " aria-label="Next page: 椭圆曲线密码学简介">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"Merkle Tree","level":"1.11","depth":1,"next":{"title":"椭圆曲线密码学简介","level":"1.12","depth":1,"path":"11-ecc.md","ref":"11-ecc.md","articles":[]},"previous":{"title":"RSA 算法--粗略数学推导篇","level":"1.10","depth":1,"path":"9-math.md","ref":"9-math.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["livereload"],"pluginsConfig":{"livereload":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"10-merk.md","mtime":"2019-07-30T23:37:08.637Z","type":"markdown"},"gitbook":{"version":"3.2.2","time":"2019-07-30T23:38:07.793Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

