
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>哈希算法 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.2">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="4-pub.html" />
    
    
    <link rel="prev" href="2-crypto.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="1-punk.html">
            
                <a href="1-punk.html">
            
                    
                    密码朋克运动
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="2-crypto.html">
            
                <a href="2-crypto.html">
            
                    
                    什么是密码学
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.4" data-path="3-hash.html">
            
                <a href="3-hash.html">
            
                    
                    哈希算法
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="4-pub.html">
            
                <a href="4-pub.html">
            
                    
                    公开密钥加密
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="5-com.html">
            
                <a href="5-com.html">
            
                    
                    加密通信
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="6-sign.html">
            
                <a href="6-sign.html">
            
                    
                    数字签名
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="7-ca.html">
            
                <a href="7-ca.html">
            
                    
                    数字证书
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="8-idea.html">
            
                <a href="8-idea.html">
            
                    
                    RSA 算法--基本原理篇
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="9-math.html">
            
                <a href="9-math.html">
            
                    
                    RSA 算法--粗略数学推导篇
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="10-merk.html">
            
                <a href="10-merk.html">
            
                    
                    Merkle Tree
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="11-ecc.html">
            
                <a href="11-ecc.html">
            
                    
                    椭圆曲线密码学简介
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >哈希算法</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <p>&#x54B1;&#x4EEC;&#x4F5C;&#x4E3A;&#x975E;&#x8BA1;&#x7B97;&#x673A;&#x4E13;&#x4E1A;&#x7684;&#x4EBA;&#x53BB;&#x770B;&#x4E00;&#x4E9B;&#x533A;&#x5757;&#x94FE;&#x76F8;&#x5173;&#x7684;&#x6280;&#x672F;&#x8D44;&#x6599;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x7ECF;&#x5E38;&#x4F1A;&#x88AB;&#x4E00;&#x4E9B;&#x8BA8;&#x538C;&#x7684;&#x672F;&#x8BED;&#x6321;&#x5728;&#x95E8;&#x5916;&#x3002;&#x8FD9;&#x6B21;&#x54B1;&#x4EEC;&#x804A;&#x7684;&#x54C8;&#x5E0C;&#x5C31;&#x662F;&#x975E;&#x5E38;&#x91CD;&#x8981;&#x7684;&#x4E00;&#x4E2A;&#x3002;&#x54C8;&#x5E0C;&#x662F;&#x5BC6;&#x7801;&#x5B66;&#x7684;&#x57FA;&#x7840;&#xFF0C;&#x7406;&#x89E3;&#x54C8;&#x5E0C;&#x662F;&#x7406;&#x89E3;&#x6570;&#x5B57;&#x7B7E;&#x540D;&#x548C;&#x52A0;&#x5BC6;&#x901A;&#x4FE1;&#x7B49;&#x6280;&#x672F;&#x7684;&#x5FC5;&#x8981;&#x524D;&#x63D0;&#x3002;</p>
<h2 id="&#x57FA;&#x672C;&#x542B;&#x4E49;">&#x57FA;&#x672C;&#x542B;&#x4E49;</h2>
<p>&#x5148;&#x6765;&#x4ECE;&#x57FA;&#x672C;&#x5B9A;&#x4E49;&#x5165;&#x624B;&#x3002;&#x54C8;&#x5E0C;&#xFF0C;&#x82F1;&#x6587;&#x662F; hash &#xFF0C;&#x672C;&#x6765;&#x610F;&#x601D;&#x662F;&#x201D;&#x5207;&#x788E;&#x5E76;&#x6405;&#x62CC;&#x201C;&#xFF0C;&#x6709;&#x4E00;&#x79CD;&#x98DF;&#x7269;&#x5C31;&#x53EB; Hash &#xFF0C;&#x5C31;&#x662F;&#x628A;&#x98DF;&#x6750;&#x5207;&#x788E;&#x5E76;&#x6405;&#x62CC;&#x4E00;&#x4E0B;&#x505A;&#x6210;&#x7684;&#x3002;&#x54C8;&#x5E0C;&#x51FD;&#x6570;&#x7684;&#x8FD0;&#x7B97;&#x7ED3;&#x679C;&#x5C31;&#x662F;&#x54C8;&#x5E0C;&#x503C;&#xFF0C;&#x901A;&#x5E38;&#x7B80;&#x79F0;&#x4E3A;&#x54C8;&#x5E0C;&#x3002;&#x54C8;&#x5E0C;&#x51FD;&#x6570;&#x6709;&#x65F6;&#x5019;&#x4E5F;&#x7FFB;&#x8BD1;&#x505A;&#x6563;&#x5217;&#x51FD;&#x6570;&#x3002;</p>
<p><img src="https://img.haoqicat.com/2018100101.jpg" alt=""></p>
<p>&#x6839;&#x636E;&#x7EF4;&#x57FA;&#x767E;&#x79D1;&#x7684;&#x5B9A;&#x4E49;&#xFF0C;&#x54C8;&#x5E0C;&#x51FD;&#x6570;&#x8981;&#x505A;&#x7684;&#x4E8B;&#x60C5;&#x662F;&#x7ED9;&#x4E00;&#x4E2A;&#x4EFB;&#x610F;&#x5927;&#x5C0F;&#x7684;&#x6570;&#x636E;&#x751F;&#x6210;&#x51FA;&#x4E00;&#x4E2A;&#x56FA;&#x5B9A;&#x957F;&#x5EA6;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x4F5C;&#x4E3A;&#x5B83;&#x7684;&#x6620;&#x5C04;&#x3002;&#x6240;&#x8C13;&#x6620;&#x5C04;&#x5C31;&#x662F;&#x4E00;&#x4E00;&#x5BF9;&#x5E94;&#x3002;&#x4E00;&#x4E2A;&#x53EF;&#x9760;&#x7684;&#x54C8;&#x5E0C;&#x7B97;&#x6CD5;&#x8981;&#x6EE1;&#x8DB3;&#x4E09;&#x70B9;&#x3002;&#x7B2C;&#x4E00;&#x662F;&#x5B89;&#x5168;&#xFF0C;&#x7ED9;&#x5B9A;&#x6570;&#x636E; M &#x5BB9;&#x6613;&#x7B97;&#x51FA;&#x54C8;&#x5E0C;&#x503C; X &#xFF0C;&#x800C;&#x7ED9;&#x5B9A; X &#x4E0D;&#x80FD;&#x7B97;&#x51FA; M &#xFF0C;&#x6216;&#x8005;&#x8BF4;&#x54C8;&#x5E0C;&#x7B97;&#x6CD5;&#x5E94;&#x8BE5;&#x662F;&#x4E00;&#x4E2A;&#x5355;&#x5411;&#x7B97;&#x6CD5;&#x3002;&#x7B2C;&#x4E8C;&#x662F;&#x72EC;&#x4E00;&#x65E0;&#x4E8C;&#xFF0C;&#x4E24;&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x8981;&#x62E5;&#x6709;&#x4E0D;&#x76F8;&#x540C;&#x7684;&#x54C8;&#x5E0C;&#x3002;&#x7B2C;&#x4E09;&#x662F;&#x957F;&#x5EA6;&#x56FA;&#x5B9A;&#xFF0C;&#x7ED9;&#x5B9A;&#x4E00;&#x79CD;&#x54C8;&#x5E0C;&#x7B97;&#x6CD5;&#xFF0C;&#x4E0D;&#x7BA1;&#x8F93;&#x5165;&#x662F;&#x591A;&#x5927;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x8F93;&#x51FA;&#x957F;&#x5EA6;&#x90FD;&#x662F;&#x56FA;&#x5B9A;&#x7684;&#x3002;&#x4F46;&#x662F;&#x4ED4;&#x7EC6;&#x60F3;&#x4E00;&#x4E0B;&#xFF0C;&#x5982;&#x679C;&#x54C8;&#x5E0C;&#x7684;&#x957F;&#x5EA6;&#x662F;&#x56FA;&#x5B9A;&#x7684;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x53D6;&#x503C;&#x8303;&#x56F4;&#x662F;&#x6709;&#x9650;&#x7684;&#xFF0C;&#x800C;&#x8F93;&#x5165;&#x6570;&#x636E;&#x7684;&#x53D6;&#x503C;&#x8303;&#x56F4;&#x662F;&#x65E0;&#x9650;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x603B;&#x4F1A;&#x627E;&#x5230;&#x4E24;&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x8F93;&#x5165;&#x62E5;&#x6709;&#x76F8;&#x540C;&#x7684;&#x54C8;&#x5E0C;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x54C8;&#x5E0C;&#x51FD;&#x6570;&#x7684;&#x5B89;&#x5168;&#x6027;&#x80AF;&#x5B9A;&#x662F;&#x4E2A;&#x76F8;&#x5BF9;&#x6982;&#x5FF5;&#x3002;&#x5982;&#x679C;&#x51FA;&#x73B0;&#x4E86;&#x4E24;&#x4E2A;&#x4E0D;&#x540C;&#x8F93;&#x5165;&#x6709;&#x76F8;&#x540C;&#x8F93;&#x51FA;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x5C31;&#x53EB;&#x78B0;&#x649E;&#xFF0C;collision &#x3002;&#x4E0D;&#x540C;&#x7684;&#x54C8;&#x5E0C;&#x7B97;&#x6CD5;&#xFF0C;&#x54C8;&#x5E0C;&#x4F4D;&#x6570;&#x8D8A;&#x591A;&#xFF0C;&#x4E5F;&#x5C31;&#x57FA;&#x672C;&#x610F;&#x5473;&#x7740;&#x5B89;&#x5168;&#x7EA7;&#x522B;&#x8D8A;&#x9AD8;&#xFF0C;&#x6216;&#x8005;&#x8BF4;&#x5B83;&#x7684;&#x201D;&#x6297;&#x78B0;&#x649E;&#x6027;&#x201C;&#x5C31;&#x8D8A;&#x597D;&#x3002;</p>
<p>&#x518D;&#x6765;&#x8BF4;&#x8BF4;&#x54C8;&#x5E0C;&#x51FD;&#x6570;&#x7684;&#x4E3B;&#x8981;&#x4F5C;&#x7528;&#x3002;&#x54C8;&#x5E0C;&#x7684;&#x72EC;&#x4E00;&#x65E0;&#x4E8C;&#x6027;&#xFF0C;&#x4FDD;&#x8BC1;&#x4E86;&#x5982;&#x679C;&#x6570;&#x636E;&#x5728;&#x5B58;&#x50A8;&#x6216;&#x8005;&#x4F20;&#x8F93;&#x8FC7;&#x7A0B;&#x4E2D;&#x6709;&#x4E1D;&#x6BEB;&#x635F;&#x574F;&#xFF0C;&#x90A3;&#x4E48;&#x5B83;&#x7684;&#x54C8;&#x5E0C;&#x5C31;&#x4F1A;&#x53D8;&#x3002;&#x54C8;&#x5E0C;&#x51FD;&#x6570;&#x7684;&#x6700;&#x5E38;&#x89C1;&#x7684;&#x4E00;&#x4E2A;&#x4F5C;&#x7528;&#x5C31;&#x662F;&#x8FDB;&#x884C;&#x5B8C;&#x6574;&#x6027;&#x6821;&#x9A8C;&#xFF08; Integrity Check &#xFF09;&#xFF0C;&#x5B8C;&#x6574;&#x7684;&#x610F;&#x601D;&#x662F;&#x6570;&#x636E;&#x65E0;&#x635F;&#x574F;&#x3002;&#x54C8;&#x5E0C;&#x6709;&#x5F88;&#x591A;&#x4E0D;&#x540C;&#x7684;&#x79F0;&#x547C;&#xFF0C;&#x6709;&#x65F6;&#x5019;&#x53EB; Digest &#x6458;&#x8981;&#xFF0C;&#x6709;&#x65F6;&#x5019;&#x53EB; Checksum &#x6821;&#x9A8C;&#x503C;&#xFF0C;&#x6709;&#x65F6;&#x5019;&#x53EB; Fingerprint &#x6307;&#x7EB9;&#xFF0C;&#x5176;&#x5B9E;&#x8BF4;&#x7684;&#x610F;&#x601D;&#x5DEE;&#x4E0D;&#x591A;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#x54C8;&#x5E0C;&#x53EF;&#x4EE5;&#x7528;&#x6765;&#x4EE3;&#x8868;&#x6570;&#x636E;&#x672C;&#x8EAB;&#x3002;&#x4F8B;&#x5982;&#x670B;&#x53CB;&#x7ED9;&#x6211;&#x4F20;&#x9012;&#x4E00;&#x4EFD;&#x6570;&#x636E;&#xFF0C;&#x4F20;&#x5B8C;&#x4E4B;&#x540E;&#xFF0C;&#x6211;&#x6709;&#x4E00;&#x4EFD;&#xFF0C;&#x4ED6;&#x624B;&#x91CC;&#x4E5F;&#x6709;&#x4E00;&#x4EFD;&#xFF0C;&#x5982;&#x679C;&#x4E24;&#x4EFD;&#x6570;&#x636E;&#x7684;&#x54C8;&#x5E0C;&#x503C;&#x662F;&#x4E00;&#x6837;&#x7684;&#xFF0C;&#x90A3;&#x4E48;&#x8FD9;&#x4E24;&#x4EFD;&#x6570;&#x636E;&#x7684;&#x5185;&#x5BB9;&#x5C31;&#x662F;&#x4E00;&#x6837;&#x7684;&#xFF0C;&#x6216;&#x8005;&#x8BF4;&#x53EF;&#x4EE5;&#x8BA4;&#x4E3A;&#x4F20;&#x9012;&#x8FC7;&#x7A0B;&#x4E2D;&#x6570;&#x636E;&#x6CA1;&#x6709;&#x635F;&#x574F;&#xFF0C;&#x6211;&#x624B;&#x91CC;&#x62FF;&#x5230;&#x7684;&#x6570;&#x636E;&#x662F;&#x5B8C;&#x6574;&#x7684;&#x3002;</p>
<p>&#x6240;&#x4EE5;&#x8BF4;&#xFF0C;&#x54C8;&#x5E0C;&#x51FD;&#x6570;&#x7684;&#x57FA;&#x672C;&#x4F5C;&#x7528;&#x5C31;&#x662F;&#x7ED9;&#x5927;&#x6570;&#x636E;&#x7B97;&#x51FA;&#x4E00;&#x4E2A;&#x6458;&#x8981;&#x6027;&#x7684;&#x957F;&#x5EA6;&#x56FA;&#x5B9A;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x6240;&#x8C13;&#x7684;&#x54C8;&#x5E0C;&#x3002;&#x54C8;&#x5E0C;&#x7684;&#x4F5C;&#x7528;&#x4E3B;&#x8981;&#x662F;&#x8FDB;&#x884C;&#x5B8C;&#x6574;&#x6027;&#x6821;&#x9A8C;&#x3002;</p>
<h2 id="&#x54C8;&#x5E0C;&#x7B97;&#x6CD5;&#x7684;&#x5206;&#x7C7B;">&#x54C8;&#x5E0C;&#x7B97;&#x6CD5;&#x7684;&#x5206;&#x7C7B;</h2>
<p>&#x4E0B;&#x4E00;&#x6B65;&#x6211;&#x4EEC;&#x628A;&#x54C8;&#x5E0C;&#x51FD;&#x6570;&#x5206;&#x7C7B;&#xFF0C;&#x66F4;&#x7EC6;&#x81F4;&#x7684;&#x804A;&#x804A;&#x54C8;&#x5E0C;&#x7B97;&#x6CD5;&#x7684;&#x7279;&#x70B9;&#x3002;&#x9996;&#x5148;&#x8BF4;&#x54C8;&#x5E0C;&#x7B97;&#x6CD5;&#x6709;&#x5F88;&#x591A;&#x79CD;&#xFF0C;&#x4F8B;&#x5982; md5 &#xFF0C;sha256 &#x7B49;&#x7B49;&#xFF0C;&#x4F46;&#x662F;&#x5B83;&#x4EEC;&#x603B;&#x4F53;&#x4E0A;&#x53EF;&#x4EE5;&#x5206;&#x4E3A;&#x4E24;&#x5927;&#x7C7B;&#xFF0C;&#x4E00;&#x7C7B;&#x662F;&#x666E;&#x901A;&#x54C8;&#x5E0C;&#xFF0C;&#x53E6;&#x5916;&#x4E00;&#x7C7B;&#x662F;&#x52A0;&#x5BC6;&#x54C8;&#x5E0C;&#xFF0C;cryptographic hash function &#x3002;</p>
<p>&#x4E1A;&#x754C;&#x53EF;&#x4EE5;&#x627E;&#x5230;&#x7684;&#x54C8;&#x5E0C;&#x7B97;&#x6CD5;&#x662F;&#x6709;&#x5F88;&#x591A;&#x79CD;&#x7684;&#x3002;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5927;&#x81F4;&#x6309;&#x7167;&#x8F93;&#x51FA;&#x7684;&#x54C8;&#x5E0C;&#x7684;&#x957F;&#x5EA6;&#x6765;&#x804A;&#xFF0C;&#x867D;&#x7136;&#x54C8;&#x5E0C;&#x7B97;&#x6CD5;&#x7684;&#x5B89;&#x5168;&#x6027;&#x4E5F;&#x4E0D;&#x5355;&#x5355;&#x662F;&#x8DDF;&#x54C8;&#x5E0C;&#x957F;&#x5EA6;&#x6709;&#x5173;&#xFF0C;&#x4F46;&#x662F;&#x4E00;&#x822C;&#x54C8;&#x5E0C;&#x503C;&#x8D8A;&#x957F;&#x4E5F;&#x5C31;&#x662F;&#x8D8A;&#x5B89;&#x5168;&#x3002;&#x4F8B;&#x5982; CRC-32 &#x7684;&#x8F93;&#x51FA;&#x662F;32 bit&#xFF0C;&#x4E5F;&#x5C31;&#x662F;32&#x4F4D;&#x7684;&#x4E8C;&#x8FDB;&#x5236;&#x6570;&#xFF0C;&#x8868;&#x793A;&#x6210;&#x5341;&#x516D;&#x8FDB;&#x5236;&#x5C31;&#x662F;8&#x4F4D;&#x3002;MD5 &#x7B97;&#x6CD5;&#x7684;&#x54C8;&#x5E0C;&#x662F;32&#x4F4D;16&#x8FDB;&#x5236;&#x6570;&#xFF0C;&#x6BD4;&#x8F83;&#x5E38;&#x89C1;&#x3002;SHA-256&#x662F;256&#x4E2A; Bit &#xFF0C;&#x5341;&#x516D;&#x8FDB;&#x5236;&#x8868;&#x793A;&#x5C31;&#x662F;64&#x4F4D;&#x3002;&#x8FD9;&#x4E9B;&#x7B97;&#x6CD5;&#x53EF;&#x4EE5;&#x5206;&#x6210;&#x666E;&#x901A;&#x54C8;&#x5E0C;&#x548C;&#x52A0;&#x5BC6;&#x54C8;&#x5E0C;&#x7B97;&#x6CD5;&#xFF0C;&#x4E24;&#x79CD;&#x7B97;&#x6CD5;&#x4E4B;&#x95F4;&#x6CA1;&#x6709;&#x7279;&#x522B;&#x660E;&#x663E;&#x7684;&#x533A;&#x522B;&#x3002;&#x4F8B;&#x5982;&#x672C;&#x6765; MD5 &#x5C31;&#x662F;&#x8BBE;&#x8BA1;&#x51FA;&#x6765;&#x505A;&#x52A0;&#x5BC6;&#x54C8;&#x5E0C;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x540E;&#x6765;&#x7531;&#x4E8E;&#x8BA1;&#x7B97;&#x673A;&#x7684;&#x53D1;&#x5C55; MD5 &#x51FA;&#x73B0;&#x78B0;&#x649E;&#x7684;&#x53EF;&#x80FD;&#x6027;&#x5C31;&#x5F88;&#x5927;&#x4E86;&#xFF0C;&#x6240;&#x4EE5;&#x76EE;&#x524D; MD5 &#x53EA;&#x80FD;&#x5F53;&#x666E;&#x901A;&#x54C8;&#x5E0C;&#x7528;&#xFF0C;&#x7528;&#x6765;&#x505A;&#x6570;&#x636E;&#x6821;&#x9A8C;&#x3002;&#x52A0;&#x5BC6;&#x54C8;&#x5E0C;&#x8DDF;&#x666E;&#x901A;&#x54C8;&#x5E0C;&#x7684;&#x533A;&#x522B;&#x5C31;&#x662F;&#x5B89;&#x5168;&#x6027;&#xFF0C;&#x4E00;&#x822C;&#x539F;&#x5219;&#x662F;&#x53EA;&#x8981;&#x4E00;&#x79CD;&#x54C8;&#x5E0C;&#x7B97;&#x6CD5;&#x51FA;&#x73B0;&#x8FC7;&#x78B0;&#x649E;&#xFF0C;&#x5C31;&#x4F1A;&#x4E0D;&#x88AB;&#x63A8;&#x8350;&#x6210;&#x4E3A;&#x52A0;&#x5BC6;&#x54C8;&#x5E0C;&#x4E86;&#xFF0C;&#x53EA;&#x6709;&#x5B89;&#x5168;&#x5EA6;&#x9AD8;&#x7684;&#x54C8;&#x5E0C;&#x7B97;&#x6CD5;&#x624D;&#x80FD;&#x7528;&#x4F5C;&#x52A0;&#x5BC6;&#x54C8;&#x5E0C;&#x3002;&#x540C;&#x65F6;&#x52A0;&#x5BC6;&#x54C8;&#x5E0C;&#x5176;&#x5B9E;&#x4E5F;&#x80FD;&#x5F53;&#x666E;&#x901A;&#x54C8;&#x5E0C;&#x6765;&#x7528;&#xFF0C;Git &#x7248;&#x672C;&#x63A7;&#x5236;&#x5DE5;&#x5177;&#x5C31;&#x662F;&#x7528; SHA-1 &#x8FD9;&#x4E2A;&#x52A0;&#x5BC6;&#x54C8;&#x5E0C;&#x7B97;&#x6CD5;&#x6765;&#x505A;&#x5B8C;&#x6574;&#x6027;&#x6821;&#x9A8C;&#x7684;&#x3002;&#x4E00;&#x822C;&#x6765;&#x8BB2;&#x8D8A;&#x5B89;&#x5168;&#x7684;&#x54C8;&#x5E0C;&#x7B97;&#x6CD5;&#xFF0C;&#x5904;&#x7406;&#x901F;&#x5EA6;&#x4E5F;&#x5C31;&#x8D8A;&#x6162;&#xFF0C;&#x6240;&#x4EE5;&#x5E76;&#x4E0D;&#x662F;&#x6240;&#x6709;&#x7684;&#x573A;&#x5408;&#x90FD;&#x9002;&#x5408;&#x7528;&#x52A0;&#x5BC6;&#x54C8;&#x5E0C;&#x6765;&#x66FF;&#x4EE3;&#x666E;&#x901A;&#x54C8;&#x5E0C;&#x3002;</p>
<p><img src="https://img.haoqicat.com/2018100102.jpg" alt=""></p>
<p>&#x5728;&#x5BC6;&#x7801;&#x5B66;&#x9886;&#x57DF;&#xFF0C;&#x6709;&#x4E24;&#x4E2A;&#x7B97;&#x6CD5;&#x90FD;&#x662F;&#x628A;&#x6570;&#x636E;&#x505A;&#x8F93;&#x5165;&#xFF0C;&#x800C;&#x8F93;&#x51FA;&#x662F;&#x4E00;&#x6BB5;&#x8C01;&#x4E5F;&#x770B;&#x4E0D;&#x61C2;&#x7684;&#x6570;&#x636E;&#x3002;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#x5C31;&#x662F;&#x54C8;&#x5E0C;&#x7B97;&#x6CD5;&#xFF0C;&#x53E6;&#x5916;&#x4E00;&#x4E2A;&#x662F;&#x52A0;&#x5BC6;&#x7B97;&#x6CD5;&#x3002;&#x6CE8;&#x610F;&#xFF0C;&#x54C8;&#x5E0C;&#x7B97;&#x6CD5;&#x548C;&#x52A0;&#x5BC6;&#x7B97;&#x6CD5;&#x662F;&#x5B8C;&#x5168;&#x4E0D;&#x540C;&#x7684;&#x3002;&#x9996;&#x5148;&#x54C8;&#x5E0C;&#x7B97;&#x6CD5;&#x7684;&#x8F93;&#x51FA;&#x957F;&#x5EA6;&#x662F;&#x56FA;&#x5B9A;&#x7684;&#xFF0C;&#x800C;&#x52A0;&#x5BC6;&#x7B97;&#x6CD5;&#x7684;&#x8F93;&#x51FA;&#x957F;&#x5EA6;&#x662F;&#x8DDF;&#x6570;&#x636E;&#x672C;&#x8EAB;&#x957F;&#x5EA6;&#x76F4;&#x63A5;&#x76F8;&#x5173;&#x7684;&#xFF0C;&#x7B2C;&#x4E8C;&#xFF0C;&#x54C8;&#x5E0C;&#x662F;&#x4E0D;&#x53EF;&#x4EE5;&#x9006;&#x5411;&#x8FD0;&#x7B97;&#x51FA;&#x6570;&#x636E;&#x7684;&#xFF0C;&#x800C;&#x52A0;&#x5BC6;&#x7B97;&#x6CD5;&#x7684;&#x8F93;&#x51FA;&#x662F;&#x8981;&#x80FD;&#x591F;&#x9006;&#x5411;&#x8FD0;&#x7B97;&#x51FA;&#x6570;&#x636E;&#x7684;&#x3002;&#x5173;&#x4E8E;&#x52A0;&#x5BC6;&#x7B97;&#x6CD5;&#xFF0C;&#x6211;&#x4EEC;&#x8FD9;&#x91CC;&#x5C31;&#x4E0D;&#x5C55;&#x5F00;&#x804A;&#x4E86;&#x3002;Peter &#x8FD9;&#x91CC;&#x4E3B;&#x8981;&#x662F;&#x5F3A;&#x8C03;&#x52A0;&#x5BC6;&#x54C8;&#x5E0C;&#x7B97;&#x6CD5;&#x53EA;&#x662F;&#x88AB;&#x7528;&#x5728;&#x52A0;&#x5BC6;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x4F46;&#x662F;&#x5B83;&#x672C;&#x8EAB;&#x4E0D;&#x662F;&#x52A0;&#x5BC6;&#x7B97;&#x6CD5;&#x3002;</p>
<p>&#x603B;&#x4E4B;&#xFF0C;&#x54C8;&#x5E0C;&#x7B97;&#x6CD5;&#x6709;&#x5F88;&#x591A;&#x79CD;&#xFF0C;&#x957F;&#x5EA6;&#x8D8A;&#x957F;&#x7684;&#x7B97;&#x6CD5;&#x57FA;&#x672C;&#x8BA4;&#x4E3A;&#x8D8A;&#x5B89;&#x5168;&#x3002;&#x5B89;&#x5168;&#x5EA6;&#x4F4E;&#x7684;&#x54C8;&#x5E0C;&#x7B97;&#x6CD5;&#x88AB;&#x8BA4;&#x4E3A;&#x662F;&#x666E;&#x901A;&#x54C8;&#x5E0C;&#x7B97;&#x6CD5;&#xFF0C;&#x4E3B;&#x8981;&#x7528;&#x6765;&#x505A;&#x5B8C;&#x6574;&#x6027;&#x6821;&#x9A8C;&#x3002;&#x5B89;&#x5168;&#x5EA6;&#x9AD8;&#x7684;&#x88AB;&#x79F0;&#x4E3A;&#x52A0;&#x5BC6;&#x54C8;&#x5E0C;&#x7B97;&#x6CD5;&#xFF0C;&#x4F1A;&#x88AB;&#x7528;&#x5728;&#x52A0;&#x5BC6;&#x7B97;&#x6CD5;&#x4E2D;&#x3002;&#x6240;&#x8C13;&#x7684;&#x9AD8;&#x4F4E;&#x90FD;&#x662F;&#x76F8;&#x5BF9;&#x6982;&#x5FF5;&#xFF0C;&#x4F8B;&#x5982; MD5 &#x66FE;&#x7ECF;&#x5C5E;&#x4E8E;&#x52A0;&#x5BC6;&#x54C8;&#x5E0C;&#xFF0C;&#x4F46;&#x662F;&#x76EE;&#x524D;&#x53EA;&#x80FD;&#x7528;&#x6765;&#x505A;&#x5B89;&#x5168;&#x6821;&#x9A8C;&#x4E86;&#x3002;&#x800C;&#x4ECE;2017&#x5E74;&#x5F00;&#x59CB;&#xFF0C;SHA-1 &#x7B97;&#x6CD5;&#x751F;&#x6210;&#x7684;&#x52A0;&#x5BC6;&#x8BC1;&#x4E66;&#x4E5F;&#x4F1A;&#x88AB;&#x5404;&#x5927;&#x6D4F;&#x89C8;&#x5668;&#x62D2;&#x7EDD;&#x4E86;&#x3002;&#x76EE;&#x524D;&#x6700;&#x6D41;&#x884C;&#x7684;&#x52A0;&#x5BC6;&#x7B97;&#x6CD5;&#x662F; SHA-2 &#xFF0C;&#x4F46;&#x662F;&#x8DDF; SHA-1 &#x4E0D;&#x540C;&#xFF0C;SHA-2 &#x4E0D;&#x662F;&#x4E00;&#x79CD;&#x7B97;&#x6CD5;&#xFF0C;&#x800C;&#x662F;&#x4E00;&#x7CFB;&#x5217;&#x7B97;&#x6CD5;&#x7684;&#x7EDF;&#x79F0;&#xFF0C;&#x5176;&#x4E2D;&#x5C31;&#x5305;&#x62EC;&#x54B1;&#x4EEC;&#x4E4B;&#x524D;&#x63D0;&#x8FC7;&#x7684; SHA-256 &#x3002;</p>
<h2 id="&#x5B9E;&#x7528;&#x4F8B;&#x5B50;">&#x5B9E;&#x7528;&#x4F8B;&#x5B50;</h2>
<p>&#x8BF4;&#x4E86;&#x8FD9;&#x4E48;&#x591A;&#x57FA;&#x7840;&#x77E5;&#x8BC6;&#xFF0C;&#x6700;&#x540E;&#x4E00;&#x90E8;&#x5206;&#x54B1;&#x4EEC;&#x804A;&#x804A;&#x54C8;&#x5E0C;&#x5728;&#x73B0;&#x5B9E;&#x4E2D;&#x7684;&#x5E94;&#x7528;&#x3002;</p>
<p>&#x9996;&#x5148;&#x4E00;&#x4E2A;&#x573A;&#x666F;&#x662F;&#x7F51;&#x7AD9;&#x6CE8;&#x518C;&#x3002;&#x5F53;&#x6211;&#x4EEC;&#x63D0;&#x4EA4;&#x7528;&#x6237;&#x540D;&#x5BC6;&#x7801;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x7528;&#x6237;&#x540D;&#x88AB;&#x4F1A;&#x76F4;&#x63A5;&#x4FDD;&#x5B58;&#x5230;&#x7F51;&#x7AD9;&#x7684;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#xFF0C;&#x4F46;&#x662F;&#x5BC6;&#x7801;&#x5374;&#x4E0D;&#x662F;&#x76F4;&#x63A5;&#x4FDD;&#x5B58;&#x7684;&#xFF0C;&#x800C;&#x662F;&#x5148;&#x628A;&#x5BC6;&#x7801;&#x8F6C;&#x6362;&#x6210;&#x54C8;&#x5E0C;&#xFF0C;&#x4FDD;&#x5B58;&#x5230;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x7684;&#x5176;&#x5B9E;&#x662F;&#x54C8;&#x5E0C;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x5373;&#x4F7F;&#x662F;&#x516C;&#x53F8;&#x540E;&#x53F0;&#x7BA1;&#x7406;&#x4EBA;&#x5458;&#xFF0C;&#x4E5F;&#x62FF;&#x4E0D;&#x5230;&#x7528;&#x6237;&#x7684;&#x5BC6;&#x7801;&#x3002;&#x8FD9;&#x6837;&#xFF0C;&#x5982;&#x679C;&#x4E07;&#x4E00;&#x516C;&#x53F8;&#x6570;&#x636E;&#x5E93;&#x6CC4;&#x9732;&#x4E86;&#xFF0C;&#x7528;&#x6237;&#x7684;&#x5BC6;&#x7801;&#x4F9D;&#x7136;&#x662F;&#x5B89;&#x5168;&#x7684;&#x3002;&#x800C;&#x5F53;&#x7528;&#x6237;&#x81EA;&#x5DF1;&#x767B;&#x5F55;&#x7F51;&#x7AD9;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x8F93;&#x5165;&#x5BC6;&#x7801;&#x63D0;&#x4EA4;&#x5230;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x670D;&#x52A1;&#x5668;&#x4E0A;&#x8FDB;&#x884C;&#x76F8;&#x540C;&#x7684;&#x54C8;&#x5E0C;&#x8FD0;&#x7B97;&#xFF0C;&#x56E0;&#x4E3A;&#x8F93;&#x5165;&#x6570;&#x636E;&#x6CA1;&#x53D8;&#xFF0C;&#x6240;&#x4EE5;&#x54C8;&#x5E0C;&#x4E5F;&#x4E0D;&#x4F1A;&#x53D8;&#xFF0C;&#x767B;&#x5F55;&#x4E5F;&#x5C31;&#x6210;&#x529F;&#x4E86;&#x3002;</p>
<p>&#x53E6;&#x5916;&#x4E00;&#x4E2A;&#x573A;&#x666F;&#x662F;&#x533A;&#x5757;&#x94FE;&#x548C;&#x52A0;&#x5BC6;&#x8D27;&#x5E01;&#x4E2D;&#x3002;&#x6BD4;&#x7279;&#x5E01;&#x5730;&#x5740;&#x751F;&#x6210;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5C31;&#x7528;&#x5230;&#x4E86; SHA-256 &#x7B97;&#x6CD5;&#xFF0C;POW &#x4E5F;&#x5C31;&#x662F;&#x5DE5;&#x4F5C;&#x91CF;&#x8BC1;&#x660E;&#xFF0C;&#x7528;&#x7684;&#x4E5F;&#x662F;&#x8FD9;&#x4E2A;&#x7B97;&#x6CD5;&#x3002;</p>
<p>&#x57FA;&#x672C;&#x4E0A;&#x51E1;&#x662F;&#x6D89;&#x53CA;&#x5230;&#x5BC6;&#x7801;&#x5B66;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x90FD;&#x4F1A;&#x6216;&#x591A;&#x6216;&#x5C11;&#x7684;&#x7528;&#x5230;&#x54C8;&#x5E0C;&#x51FD;&#x6570;&#x3002;</p>
<h2 id="&#x603B;&#x7ED3;">&#x603B;&#x7ED3;</h2>
<p>&#x5173;&#x4E8E;&#x54C8;&#x5E0C;&#x548C;&#x54C8;&#x5E0C;&#x51FD;&#x6570;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x804A;&#x5230;&#x8FD9;&#x91CC;&#xFF0C;&#x4E0B;&#x9762;&#x6765;&#x603B;&#x7ED3;&#x51E0;&#x53E5;&#x3002;&#x54C8;&#x5E0C;&#x7684;&#x57FA;&#x672C;&#x4F5C;&#x7528;&#x5C31;&#x662F;&#x63D0;&#x4F9B;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x7684;&#x6458;&#x8981;&#x6216;&#x8005;&#x6307;&#x7EB9;&#xFF0C;&#x901A;&#x5E38;&#x7684;&#x4F7F;&#x7528;&#x573A;&#x666F;&#x5C31;&#x662F;&#x5B8C;&#x6574;&#x6027;&#x6821;&#x9A8C;&#x3002;&#x54C8;&#x5E0C;&#x7B97;&#x6CD5;&#x6709;&#x5F88;&#x591A;&#x79CD;&#xFF0C;&#x4E00;&#x822C;&#x6765;&#x8BB2;&#x54C8;&#x5E0C;&#x8D8A;&#x957F;&#x7684;&#x7B97;&#x6CD5;&#xFF0C;&#x5B89;&#x5168;&#x6027;&#x4E5F;&#x5C31;&#x8D8A;&#x9AD8;&#xFF0C;&#x5B89;&#x5168;&#x5EA6;&#x8DB3;&#x591F;&#x9AD8;&#x7684;&#x54C8;&#x5E0C;&#xFF0C;&#x6216;&#x8005;&#x8BF4;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x4EBA;&#x80FD;&#x591F;&#x6210;&#x529F;&#x5B9E;&#x73B0;&#x78B0;&#x649E;&#x7684;&#x54C8;&#x5E0C;&#xFF0C;&#x624D;&#x6709;&#x8D44;&#x683C;&#x88AB;&#x8003;&#x8651;&#x7528;&#x5728;&#x52A0;&#x5BC6;&#x573A;&#x5408;&#xFF0C;&#x800C;&#x8FD9;&#x7C7B;&#x7684;&#x54C8;&#x5E0C;&#x7B97;&#x6CD5;&#x4E5F;&#x88AB;&#x53EB;&#x505A;&#x52A0;&#x5BC6;&#x54C8;&#x5E0C;&#x7B97;&#x6CD5;&#x3002;&#x5B9E;&#x9645;&#x4E2D;&#x5E38;&#x89C1;&#x7684;&#x54C8;&#x5E0C;&#x7B97;&#x6CD5;&#x6709; MD5 &#xFF0C;SHA-1 &#xFF0C;&#x548C; SHA-256 &#x7B49;&#x7B49;&#xFF0C;&#x5176;&#x4E2D; MD5 &#x901A;&#x5E38;&#x7528;&#x6765;&#x8FDB;&#x884C;&#x6570;&#x636E;&#x6821;&#x9A8C;&#xFF0C;SHA-1 &#x66FE;&#x7ECF;&#x662F;&#x52A0;&#x5BC6;&#x54C8;&#x5E0C;&#x7B97;&#x6CD5;&#xFF0C;&#x4F46;&#x662F;&#x76EE;&#x524D;&#x5DF2;&#x7ECF;&#x88AB;&#x9664;&#x540D;&#xFF0C;&#x4E5F;&#x53EA;&#x80FD;&#x505A;&#x4E3A;&#x4E00;&#x79CD;&#x5B89;&#x5168;&#x5EA6;&#x66F4;&#x9AD8;&#x7684;&#x6821;&#x9A8C;&#x7B97;&#x6CD5;&#x4E86;&#x3002;SHA-256 &#x4F9D;&#x7136;&#x662F;&#x5E7F;&#x6CDB;&#x4F7F;&#x7528;&#x7684;&#x52A0;&#x5BC6;&#x54C8;&#x5E0C;&#x7B97;&#x6CD5;&#xFF0C;&#x5728;&#x6BD4;&#x7279;&#x5E01;&#x751F;&#x6210;&#x5730;&#x5740;&#x4EE5;&#x53CA; POW &#x5DE5;&#x4F5C;&#x91CF;&#x8BC1;&#x660E;&#x7B97;&#x6CD5;&#x4E2D;&#x90FD;&#x4F1A;&#x7528;&#x5230;&#x3002;</p>
<p>&#x53C2;&#x8003;&#xFF1A;</p>
<ul>
<li><a href="https://www.youtube.com/watch?v=xsp--srKWKw&amp;list=PLSNNzog5eydvsPPMwn-6waomQXOOxZew4&amp;index=2" target="_blank">https://www.youtube.com/watch?v=xsp--srKWKw&amp;list=PLSNNzog5eydvsPPMwn-6waomQXOOxZew4&amp;index=2</a>)</li>
<li><a href="https://en.wikipedia.org/wiki/Hash_function" target="_blank">https://en.wikipedia.org/wiki/Hash_function</a></li>
<li><a href="https://en.wikipedia.org/wiki/Cryptographic_hash_function" target="_blank">https://en.wikipedia.org/wiki/Cryptographic_hash_function</a></li>
</ul>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="2-crypto.html" class="navigation navigation-prev " aria-label="Previous page: 什么是密码学">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="4-pub.html" class="navigation navigation-next " aria-label="Next page: 公开密钥加密">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"id":"3-hash","title":"哈希算法","permalink":"crypto-block/3-hash.html","prev":"2-crypto.html","next":{"title":"公开密钥加密","level":"1.5","depth":1,"path":"4-pub.md","ref":"4-pub.md","articles":[]},"level":"1.4","depth":1,"previous":{"title":"什么是密码学","level":"1.3","depth":1,"path":"2-crypto.md","ref":"2-crypto.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["livereload"],"pluginsConfig":{"livereload":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"3-hash.md","mtime":"2019-07-30T23:37:08.637Z","type":"markdown"},"gitbook":{"version":"3.2.2","time":"2019-07-30T23:38:07.793Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

