
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>数字签名 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.2">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="7-ca.html" />
    
    
    <link rel="prev" href="5-com.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="1-punk.html">
            
                <a href="1-punk.html">
            
                    
                    密码朋克运动
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="2-crypto.html">
            
                <a href="2-crypto.html">
            
                    
                    什么是密码学
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="3-hash.html">
            
                <a href="3-hash.html">
            
                    
                    哈希算法
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="4-pub.html">
            
                <a href="4-pub.html">
            
                    
                    公开密钥加密
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="5-com.html">
            
                <a href="5-com.html">
            
                    
                    加密通信
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.7" data-path="6-sign.html">
            
                <a href="6-sign.html">
            
                    
                    数字签名
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="7-ca.html">
            
                <a href="7-ca.html">
            
                    
                    数字证书
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="8-idea.html">
            
                <a href="8-idea.html">
            
                    
                    RSA 算法--基本原理篇
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="9-math.html">
            
                <a href="9-math.html">
            
                    
                    RSA 算法--粗略数学推导篇
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="10-merk.html">
            
                <a href="10-merk.html">
            
                    
                    Merkle Tree
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="11-ecc.html">
            
                <a href="11-ecc.html">
            
                    
                    椭圆曲线密码学简介
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >数字签名</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <p>&#x516C;&#x5F00;&#x5BC6;&#x94A5;&#x52A0;&#x5BC6;&#x6280;&#x672F;&#x6709;&#x4E24;&#x5927;&#x5E94;&#x7528;&#xFF0C;&#x4E4B;&#x524D;&#x5DF2;&#x7ECF;&#x804A;&#x4E86;&#x4E00;&#x4E2A;&#xFF0C;&#x5C31;&#x662F;&#x52A0;&#x5BC6;&#x901A;&#x4FE1;&#xFF0C;&#x672C;&#x8282;&#x6765;&#x804A;&#x53E6;&#x5916;&#x4E00;&#x4E2A;&#xFF1A;&#x6570;&#x5B57;&#x7B7E;&#x540D;&#x3002;&#x6570;&#x5B57;&#x7B7E;&#x540D;&#x7684;&#x57FA;&#x672C;&#x4F5C;&#x7528;&#x8DDF;&#x73B0;&#x5B9E;&#x4E16;&#x754C;&#x7684;&#x7EB8;&#x7B14;&#x5F62;&#x5F0F;&#x7684;&#x7B7E;&#x540D;&#x6709;&#x4EC0;&#x4E48;&#x76F8;&#x540C;&#x70B9;&#x548C;&#x4E0D;&#x540C;&#x70B9;&#xFF0C;&#x6570;&#x5B57;&#x7B7E;&#x540D;&#x7684;&#x57FA;&#x672C;&#x539F;&#x7406;&#x548C;&#x6D41;&#x7A0B;&#x53C8;&#x662F;&#x4EC0;&#x4E48;&#x5462;&#xFF1F;&#x4E14;&#x542C; Peter &#x4E00;&#x4E00;&#x9053;&#x6765;&#x3002;</p>
<h2 id="&#x57FA;&#x672C;&#x539F;&#x7406;">&#x57FA;&#x672C;&#x539F;&#x7406;</h2>
<p>&#x5148;&#x8BF4;&#x6570;&#x5B57;&#x7B7E;&#x540D;&#x7684;&#x57FA;&#x672C;&#x539F;&#x7406;&#x3002;&#x6570;&#x5B57;&#x7B7E;&#x540D;&#x8FC7;&#x7A0B;&#x8DDF;&#x52A0;&#x5BC6;&#x901A;&#x4FE1;&#x6709;&#x7740;&#x4E00;&#x5B9A;&#x7684;&#x5BF9;&#x79F0;&#x6027;&#xFF0C;&#x8FD9;&#x79CD;&#x5BF9;&#x79F0;&#x6709;&#x7740;&#x4E00;&#x79CD;&#x903B;&#x8F91;&#x4E0A;&#x7684;&#x7F8E;&#x3002;</p>
<p>&#x52A0;&#x5BC6;&#x901A;&#x4FE1;&#x662F;&#x7528;&#x516C;&#x94A5;&#x8FDB;&#x884C;&#x52A0;&#x5BC6;&#xFF0C;&#x800C;&#x7528;&#x79C1;&#x94A5;&#x8FDB;&#x884C;&#x89E3;&#x5BC6;&#x3002;&#x800C;&#x6570;&#x5B57;&#x7B7E;&#x540D;&#x521A;&#x597D;&#x76F8;&#x53CD;&#xFF0C;&#x662F;&#x91C7;&#x7528;&#x79C1;&#x94A5;&#x52A0;&#x5BC6;&#xFF0C;&#x516C;&#x94A5;&#x89E3;&#x5BC6;&#x3002;&#x5BF9;&#x4E8E;&#x52A0;&#x5BC6;&#x901A;&#x4FE1;&#xFF0C;&#x516C;&#x94A5;&#x52A0;&#x5BC6;&#x8FC7;&#x7A0B;&#x5C31;&#x662F;&#x901A;&#x8FC7;&#x52A0;&#x5BC6;&#x7B97;&#x6CD5;&#x628A;&#x4FE1;&#x606F;&#x52A0;&#x5BC6;&#x6210;&#x5BC6;&#x6587;&#xFF0C;&#x79C1;&#x94A5;&#x89E3;&#x5BC6;&#x8FC7;&#x7A0B;&#x5C31;&#x662F;&#x901A;&#x8FC7;&#x89E3;&#x5BC6;&#x7B97;&#x6CD5;&#x89E3;&#x5BC6;&#x5BC6;&#x6587;&#x3002;&#x800C;&#x5BF9;&#x4E8E;&#x6570;&#x5B57;&#x7B7E;&#x540D;&#xFF0C;&#x79C1;&#x94A5;&#x52A0;&#x5BC6;&#x8FC7;&#x7A0B;&#x662F;&#x901A;&#x8FC7;&#x7B7E;&#x540D;&#x7B97;&#x6CD5;&#x6765;&#x751F;&#x6210;&#x6570;&#x5B57;&#x7B7E;&#x540D;&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x800C;&#x516C;&#x94A5;&#x89E3;&#x5BC6;&#x8FC7;&#x7A0B;&#x662F;&#x901A;&#x8FC7;&#x9A8C;&#x8BC1;&#x7B97;&#x6CD5;&#x6765;&#x786E;&#x5B9A;&#x6570;&#x5B57;&#x7B7E;&#x540D;&#x662F;&#x4E0D;&#x662F;&#x6709;&#x79C1;&#x94A5;&#x6301;&#x6709;&#x8005;&#x7B7E;&#x7F72;&#x7684;&#x3002;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#xFF0C;&#x52A0;&#x5BC6;&#x7B97;&#x6CD5;&#xFF0C;&#x89E3;&#x5BC6;&#x7B97;&#x6CD5;&#xFF0C;&#x7B7E;&#x540D;&#x7B97;&#x6CD5;&#xFF0C;&#x9A8C;&#x8BC1;&#x7B97;&#x6CD5;&#xFF0C;&#x5BF9;&#x79F0;&#x6027;&#x662F;&#x5F88;&#x660E;&#x663E;&#x7684;&#x3002;</p>
<p><img src="https://img.haoqicat.com/2018092901.jpg" alt=""></p>
<p>&#x6570;&#x5B57;&#x7B7E;&#x540D;&#x7684;&#x4E3B;&#x8981;&#x7684;&#x4F5C;&#x7528;&#x662F;&#x8BA4;&#x8BC1;&#x7B7E;&#x7F72;&#x4EBA;&#x8EAB;&#x4EFD;&#xFF0C;&#x8BF4;&#x5F97;&#x5177;&#x4F53;&#x70B9;&#xFF0C;&#x5C31;&#x662F;&#x8BA9;&#x6240;&#x6709;&#x4EBA;&#x80FD;&#x591F;&#x786E;&#x8BA4;&#x8FD9;&#x4E2A;&#x6570;&#x5B57;&#x7B7E;&#x540D;&#x662F;&#x4E0D;&#x662F;&#x7531;&#x79C1;&#x94A5;&#x7684;&#x6301;&#x6709;&#x4EBA;&#x521B;&#x5EFA;&#x7684;&#x3002;&#x6570;&#x5B57;&#x7B7E;&#x540D;&#x662F;&#x7531;&#x7B7E;&#x540D;&#x7B97;&#x6CD5;&#x53BB;&#x751F;&#x6210;&#x7684;&#xFF0C;&#x7B7E;&#x540D;&#x7B97;&#x6CD5;&#x7684;&#x8F93;&#x5165;&#x6709;&#x4E24;&#x4E2A;&#xFF0C;&#x4E00;&#x4E2A;&#x662F;&#x79C1;&#x94A5;&#xFF0C;&#x53E6;&#x4E00;&#x4E2A;&#x662F;&#x88AB;&#x7B7E;&#x7F72;&#x7684;&#x4FE1;&#x606F;&#xFF0C;&#x8F93;&#x51FA;&#x7684;&#x4E00;&#x4E2A;&#x5B57;&#x7B26;&#x4E32;&#x5C31;&#x662F;&#x6570;&#x5B57;&#x7B7E;&#x540D;&#x4E86;&#x3002;&#x7B7E;&#x540D;&#x5230;&#x5E95;&#x662F;&#x4E0D;&#x662F;&#x7531;&#x79C1;&#x94A5;&#x6301;&#x6709;&#x4EBA;&#x7B7E;&#x7F72;&#x7684;&#xFF0C;&#x8981;&#x901A;&#x8FC7;&#x9A8C;&#x8BC1;&#x7B97;&#x6CD5;&#x5224;&#x65AD;&#x3002;&#x9A8C;&#x8BC1;&#x7B97;&#x6CD5;&#x6709;&#x4E09;&#x4E2A;&#x8F93;&#x5165;&#xFF0C;&#x4E00;&#x4E2A;&#x662F;&#x4FE1;&#x606F;&#x672C;&#x8EAB;&#xFF0C;&#x53E6;&#x5916;&#x4E00;&#x4E2A;&#x662F;&#x6570;&#x5B57;&#x7B7E;&#x540D;&#xFF0C;&#x7B2C;&#x4E09;&#x4E2A;&#x662F;&#x516C;&#x94A5;&#xFF0C;&#x8F93;&#x51FA;&#x7684;&#x7ED3;&#x679C;&#x5C31;&#x662F;&#x9A8C;&#x8BC1;&#x6210;&#x529F;&#x6216;&#x8005;&#x9A8C;&#x8BC1;&#x5931;&#x8D25;&#x3002;&#x6570;&#x5B57;&#x7B7E;&#x540D;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x79C1;&#x94A5;&#x662F;&#x201C;&#x7B7E;&#x540D; key&#x201D;&#xFF0C;&#x516C;&#x94A5;&#x662F;&#x201C;&#x9A8C;&#x8BC1; key&#x201D;&#x3002;</p>
<p><img src="https://img.haoqicat.com/2018092902.jpg" alt=""></p>
<p>&#x6240;&#x4EE5;&#x8BF4;&#x6570;&#x5B57;&#x7B7E;&#x540D;&#x7684;&#x539F;&#x7406;&#x662F;&#x975E;&#x5E38;&#x6E05;&#x6670;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x6570;&#x5B57;&#x7B7E;&#x540D;&#x672C;&#x8EAB;&#x8DDF;&#x52A0;&#x5BC6;&#x901A;&#x4FE1;&#x5F62;&#x6210;&#x4E00;&#x4E2A;&#x5BF9;&#x79F0;&#x5173;&#x7CFB;&#xFF0C;&#x800C;&#x6570;&#x5B57;&#x7B7E;&#x540D;&#x81EA;&#x5DF1;&#x7684;&#x7B7E;&#x540D;&#x8FC7;&#x7A0B;&#x8DDF;&#x9A8C;&#x8BC1;&#x8FC7;&#x7A0B;&#xFF0C;&#x4E5F;&#x662F;&#x4E2A;&#x5BF9;&#x79F0;&#x5173;&#x7CFB;&#x3002;&#x628A;&#x63E1;&#x8FD9;&#x79CD;&#x5BF9;&#x79F0;&#x6027;&#xFF0C;&#x5C31;&#x6BD4;&#x8F83;&#x5BB9;&#x6613;&#x8BB0;&#x4F4F;&#x57FA;&#x672C;&#x539F;&#x7406;&#x4E86;&#x3002;</p>
<h2 id="&#x57FA;&#x672C;&#x6D41;&#x7A0B;">&#x57FA;&#x672C;&#x6D41;&#x7A0B;</h2>
<p>&#x9759;&#x6001;&#x7684;&#x57FA;&#x672C;&#x539F;&#x7406;&#x61C2;&#x4E86;&#xFF0C;&#x54B1;&#x4EEC;&#x518D;&#x6765;&#x4ECE;&#x65F6;&#x95F4;&#x7EF4;&#x5EA6;&#x770B;&#x770B;&#x6570;&#x5B57;&#x7B7E;&#x540D;&#x52A8;&#x6001;&#x6D41;&#x7A0B;&#x3002;</p>
<p>Alice &#x8981;&#x7B7E;&#x7F72;&#x4E00;&#x4E2A;&#x6587;&#x4EF6;&#xFF0C;&#x4E8E;&#x662F;&#x5979;&#x5C31;&#x62FF;&#x51FA;&#x81EA;&#x5DF1;&#x7684;&#x79C1;&#x94A5;&#xFF0C;&#x6267;&#x884C;&#x7B7E;&#x540D;&#x7B97;&#x6CD5;&#xFF0C;&#x5F97;&#x5230;&#x6570;&#x5B57;&#x7B7E;&#x540D;&#x3002;&#x90A3;&#x4E48;&#x5176;&#x4ED6;&#x4EBA;&#x5982;&#x4F55;&#x53BB;&#x9A8C;&#x8BC1;&#x8FD9;&#x4E2A;&#x6570;&#x5B57;&#x7B7E;&#x540D;&#x7684;&#x786E;&#x51FA;&#x81EA; Alice &#x5462;&#xFF1F;&#x9996;&#x5148;&#xFF0C;Alice &#x8981;&#x628A;&#x81EA;&#x5DF1;&#x7684;&#x516C;&#x94A5;&#x653E;&#x5230;&#x4E00;&#x4E2A;&#x5927;&#x5BB6;&#x90FD;&#x53EF;&#x4EE5;&#x8BBF;&#x95EE;&#x5230;&#x7684;&#x670D;&#x52A1;&#x5668;&#x4E0A;&#xFF0C;&#x8FD9;&#x6837;&#x5176;&#x4ED6;&#x4EBA;&#x90FD;&#x53EF;&#x4EE5;&#x83B7;&#x5F97; Alice &#x7684;&#x516C;&#x94A5;&#xFF0C;&#x5927;&#x5BB6;&#x628A;&#x6587;&#x4EF6;&#xFF0C;&#x6570;&#x5B57;&#x7B7E;&#x540D;&#x4EE5;&#x53CA;&#x516C;&#x94A5;&#x4E0B;&#x8F7D;&#x5230;&#x81EA;&#x5DF1;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x4E0A;&#xFF0C;&#x8C03;&#x7528;&#x9A8C;&#x8BC1;&#x7B97;&#x6CD5;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x5224;&#x65AD;&#x8FD9;&#x4E2A;&#x6587;&#x4EF6;&#x662F;&#x4E0D;&#x662F; Alice &#x7B7E;&#x7F72;&#x7684;&#x4E86;&#x3002;&#x4E0D;&#x7BA1;&#x662F;&#x7B7E;&#x540D;&#x7B97;&#x6CD5;&#x8FD8;&#x662F;&#x9A8C;&#x8BC1;&#x7B97;&#x6CD5;&#x90FD;&#x662F;&#x5168;&#x7403;&#x516C;&#x5F00;&#x7684;&#xFF0C;&#x6BCF;&#x4E2A;&#x4EBA;&#x90FD;&#x53EF;&#x4EE5;&#x5728;&#x81EA;&#x5DF1;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x4E0A;&#x5B89;&#x88C5;&#x8F6F;&#x4EF6;&#x6765;&#x6267;&#x884C;&#x8FD9;&#x4E24;&#x4E2A;&#x7B97;&#x6CD5;&#x3002;</p>
<p><img src="https://img.haoqicat.com/2018092903.jpg" alt=""></p>
<p>&#x8FD9;&#x5C31;&#x662F;&#x4E00;&#x4E2A; Alice &#x7B7E;&#x7F72;&#x6587;&#x4EF6;&#xFF0C;&#x5176;&#x4ED6;&#x4EBA;&#x9A8C;&#x8BC1;&#x7B7E;&#x540D;&#x7684;&#x5B8C;&#x6574;&#x8FC7;&#x7A0B;&#x4E86;&#x3002;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x4E2D;&#x6709;&#x4E00;&#x70B9;&#x8981;&#x6CE8;&#x610F;&#xFF0C;&#x5C31;&#x662F;&#x7B7E;&#x540D;&#x672C;&#x8EAB;&#x662F;&#x4E0D;&#x4F1A;&#x52A0;&#x5BC6;&#x6587;&#x4EF6;&#x672C;&#x8EAB;&#x7684;&#x3002;&#x5728;&#x5E95;&#x5C42;&#xFF0C;&#x7B7E;&#x540D;&#x8FC7;&#x7A0B;&#x5176;&#x5B9E;&#x662F;&#x52A0;&#x5BC6;&#x4E86;&#x6587;&#x4EF6;&#x7684;&#x54C8;&#x5E0C;&#x503C;&#xFF0C;&#x603B;&#x4E4B;&#x7B7E;&#x540D;&#x7684;&#x76EE;&#x7684;&#x4E0D;&#x5728;&#x4E8E;&#x52A0;&#x5BC6;&#x6587;&#x4EF6;&#x4FE1;&#x606F;&#xFF0C;&#x800C;&#x5728;&#x4E8E;&#x751F;&#x6210;&#x6570;&#x5B57;&#x7B7E;&#x540D;&#x3002;</p>
<h2 id="&#x5B9E;&#x9645;&#x4F5C;&#x7528;">&#x5B9E;&#x9645;&#x4F5C;&#x7528;</h2>
<p>&#x6700;&#x540E;&#x6765;&#x804A;&#x804A;&#x6570;&#x5B57;&#x7B7E;&#x540D;&#x7684;&#x4F5C;&#x7528;&#x3002;&#x6570;&#x5B57;&#x7B7E;&#x540D;&#x6709;&#x4E09;&#x5927;&#x4F5C;&#x7528;&#xFF0C;&#x7B2C;&#x4E00;&#x4E2A;&#x662F;&#x8BA4;&#x8BC1;&#xFF0C;&#x7B2C;&#x4E8C;&#x4E2A;&#x662F;&#x9632;&#x6B62;&#x62B5;&#x8D56;&#xFF0C;&#x7B2C;&#x4E09;&#x4E2A;&#x662F;&#x4FDD;&#x8BC1;&#x6587;&#x4EF6;&#x5B8C;&#x6574;&#x6027;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x6CA1;&#x6709;&#x88AB;&#x7BE1;&#x6539;&#x8FC7;&#x3002;</p>
<p>&#x5148;&#x770B;&#x7B2C;&#x4E00;&#x4E2A;&#x8BA4;&#x8BC1;&#xFF0C;&#x610F;&#x601D;&#x5C31;&#x662F;&#x786E;&#x8BA4;&#x7B7E;&#x7F72;&#x4EBA;&#x8EAB;&#x4EFD;&#xFF0C;&#x8FD9;&#x4E2A;&#x8DDF;&#x7EB8;&#x7B14;&#x7B7E;&#x540D;&#x7684;&#x4F5C;&#x7528;&#x662F;&#x4E00;&#x81F4;&#x7684;&#x3002;&#x518D;&#x770B;&#x7B2C;&#x4E8C;&#x4E2A;&#x9632;&#x6B62;&#x62B5;&#x8D56;&#xFF0C;&#x540C;&#x6837;&#x662F;&#x7EB8;&#x7B14;&#x7B7E;&#x540D;&#x4E5F;&#x62E5;&#x6709;&#x7684;&#x7279;&#x6027;&#xFF0C;&#x4E00;&#x4EFD;&#x5408;&#x540C;&#x7B7E;&#x7F72;&#x4E86;&#xFF0C;&#x5C31;&#x8981;&#x627F;&#x62C5;&#x8D23;&#x4EFB;&#xFF0C;&#x767D;&#x7EB8;&#x9ED1;&#x5B57;&#xFF0C;&#x4E0D;&#x80FD;&#x800D;&#x8D56;&#x3002;&#x7B2C;&#x4E09;&#x4E2A;&#x4F5C;&#x7528;&#x662F;&#x4FDD;&#x8BC1;&#x6587;&#x4EF6;&#x6CA1;&#x6709;&#x88AB;&#x7BE1;&#x6539;&#x8FC7;&#xFF0C;&#x8FD9;&#x4E2A;&#x4F5C;&#x7528;&#x7EB8;&#x7B14;&#x7B7E;&#x540D;&#x5F88;&#x96BE;&#x4FDD;&#x8BC1;&#xFF0C;&#x6BD4;&#x5982;&#x7B7E;&#x540D;&#x53EA;&#x7B7E;&#x7F72;&#x4E86;&#x6700;&#x540E;&#x4E00;&#x9875;&#xFF0C;&#x90A3;&#x4E48;&#x5982;&#x679C;&#x6709;&#x4EBA;&#x60F3;&#x6084;&#x6084;&#x6362;&#x6389;&#x4E86;&#x524D;&#x51E0;&#x9875;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x7B7E;&#x540D;&#x672C;&#x8EAB;&#x662F;&#x963B;&#x6B62;&#x4E0D;&#x4E86;&#x7684;&#x3002;&#x4F46;&#x662F;&#x6570;&#x5B57;&#x7B7E;&#x540D;&#x5C31;&#x53EF;&#x4EE5;&#xFF0C;&#x56E0;&#x4E3A;&#x6570;&#x5B57;&#x7B7E;&#x540D;&#x662F;&#x7531;&#x4E24;&#x4E2A;&#x8F93;&#x5165;&#x8FD0;&#x7B97;&#x5F97;&#x51FA;&#x7684;&#xFF0C;&#x4E00;&#x4E2A;&#x662F;&#x79C1;&#x94A5;&#xFF0C;&#x53E6;&#x4E00;&#x4E2A;&#x5C31;&#x662F;&#x6587;&#x4EF6;&#xFF0C;&#x6240;&#x4EE5;&#x5982;&#x679C;&#x5728;&#x9A8C;&#x8BC1;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x53D1;&#x73B0;&#x6587;&#x4EF6;&#x6709;&#x6539;&#x52A8;&#xFF0C;&#x9A8C;&#x8BC1;&#x4F1A;&#x5931;&#x8D25;&#x3002;&#x8FD9;&#x4E2A;&#x5F88;&#x7C7B;&#x4F3C;&#x4E8E;&#x73B0;&#x5B9E;&#x4E16;&#x754C;&#x7B7E;&#x5408;&#x540C;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6709;&#x65F6;&#x5019;&#x9700;&#x8981;&#x6545;&#x610F;&#x7528;&#x7B7E;&#x540D;&#x6216;&#x8005;&#x56FE;&#x7AE0;&#x8986;&#x76D6;&#x6709;&#x6587;&#x5B57;&#x7684;&#x533A;&#x57DF;&#xFF0C;&#x6216;&#x8005;&#x5728;&#x5199;&#x4FE1;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x7ED9;&#x4FE1;&#x5C01;&#x52A0;&#x4E0A;&#x8721;&#x5C01;&#xFF0C;&#x8FD9;&#x4E9B;&#x63AA;&#x65BD;&#x4E5F;&#x90FD;&#x662F;&#x4E3A;&#x4E86;&#x9632;&#x7BE1;&#x6539;&#x3002;</p>
<p>&#x8FD9;&#x5C31;&#x662F;&#x6570;&#x5B57;&#x7B7E;&#x540D;&#x7684;&#x4E09;&#x5927;&#x4F5C;&#x7528;&#xFF0C;&#x4E3B;&#x8981;&#x7528;&#x5728;&#x5404;&#x79CD;&#x9632;&#x4F2A;&#x9020;&#x573A;&#x5408;&#xFF0C;&#x5728;&#x4E16;&#x754C;&#x4E0A;&#x5F88;&#x591A;&#x56FD;&#x5BB6;&#xFF0C;&#x6570;&#x5B57;&#x7B7E;&#x540D;&#x90FD;&#x662F;&#x6709;&#x6CD5;&#x5F8B;&#x6548;&#x529B;&#x7684;&#x3002;&#x53E6;&#x5916;&#x8981;&#x6CE8;&#x610F;&#xFF0C;&#x6570;&#x5B57;&#x7B7E;&#x540D;&#x5C5E;&#x4E8E;&#x7535;&#x5B50;&#x7B7E;&#x540D;&#x7684;&#x4E00;&#x79CD;&#xFF0C;&#x4F46;&#x5E76;&#x4E0D;&#x662F;&#x6240;&#x6709;&#x7684;&#x7535;&#x5B50;&#x7B7E;&#x540D;&#x90FD;&#x662F;&#x6570;&#x5B57;&#x7B7E;&#x540D;&#xFF0C;&#x8FD9;&#x4E24;&#x4E2A;&#x6982;&#x5FF5;&#x8981;&#x533A;&#x5206;&#x4E00;&#x4E0B;&#x3002;</p>
<h2 id="&#x603B;&#x7ED3;">&#x603B;&#x7ED3;</h2>
<p>&#x5173;&#x4E8E;&#x6570;&#x5B57;&#x7B7E;&#x540D;&#xFF0C;&#x672C;&#x8282;&#x5C31;&#x804A;&#x8FD9;&#x4E48;&#x591A;&#x3002;&#x6570;&#x5B57;&#x7B7E;&#x540D;&#x662F;&#x516C;&#x94A5;&#x52A0;&#x5BC6;&#x6280;&#x672F;&#x7684;&#x4E24;&#x5927;&#x5E94;&#x7528;&#x4E4B;&#x4E00;&#x3002;&#x4E3B;&#x8981;&#x91C7;&#x7528;&#x4E86;&#x79C1;&#x94A5;&#x52A0;&#x5BC6;&#xFF0C;&#x516C;&#x94A5;&#x89E3;&#x5BC6;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x6587;&#x4EF6;&#x7B7E;&#x7F72;&#x8005;&#x7528;&#x79C1;&#x94A5;&#x7B7E;&#x7F72;&#x6587;&#x4EF6;&#xFF0C;&#x5C31;&#x8868;&#x793A;&#x4ED6;&#x8BA4;&#x53EF;&#x4E86;&#x8FD9;&#x4E2A;&#x6587;&#x4EF6;&#x7684;&#x5185;&#x5BB9;&#x3002;&#x8981;&#x9A8C;&#x8BC1;&#x6570;&#x5B57;&#x7B7E;&#x540D;&#xFF0C;&#x53EA;&#x9700;&#x8981;&#x7B7E;&#x540D;&#x4EBA;&#x516C;&#x5E03;&#x81EA;&#x5DF1;&#x7684;&#x516C;&#x94A5;&#x5373;&#x53EF;&#xFF0C;&#x5176;&#x4ED6;&#x4EBA;&#x901A;&#x8FC7;&#x9A8C;&#x8BC1;&#x6570;&#x5B57;&#x7B7E;&#x540D;&#x5373;&#x53EF;&#x9A8C;&#x8BC1;&#x6587;&#x4EF6;&#x662F;&#x79C1;&#x94A5;&#x7B7E;&#x7F72;&#x7684;&#x3002;&#x7B7E;&#x7F72;&#x4EBA;&#x4E0D;&#x9700;&#x8981;&#x66B4;&#x9732;&#x81EA;&#x5DF1;&#x7684;&#x79C1;&#x94A5;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x95F4;&#x63A5;&#x8BC1;&#x660E;&#x81EA;&#x5DF1;&#x62E5;&#x6709;&#x79C1;&#x94A5;&#x3002;&#x9664;&#x4E86;&#x8BA4;&#x8BC1;&#x7B7E;&#x7F72;&#x4EBA;&#x8EAB;&#x4EFD;&#xFF0C;&#x6570;&#x5B57;&#x7B7E;&#x540D;&#x8FD8;&#x6709;&#x4E24;&#x4E2A;&#x4F5C;&#x7528;&#xFF0C;&#x5206;&#x522B;&#x662F;&#x9632;&#x6B62;&#x62B5;&#x8D56;&#x548C;&#x4FDD;&#x8BC1;&#x6587;&#x4EF6;&#x5B8C;&#x6574;&#x6027;&#x3002;</p>
<p>&#x53C2;&#x8003;&#xFF1A;</p>
<ul>
<li><a href="https://upload.wikimedia.org/wikipedia/commons/thumb/a/a7/Private_key_signing.png/500px-Private_key_signing.png" target="_blank">https://upload.wikimedia.org/wikipedia/commons/thumb/a/a7/Private_key_signing.png/500px-Private_key_signing.png</a></li>
<li><a href="https://www.youtube.com/watch?v=TmA2QWSLSPg&amp;list=PLSNNzog5eydtwsdT__t5WtRgvpfMzpTc7" target="_blank">https://www.youtube.com/watch?v=TmA2QWSLSPg&amp;list=PLSNNzog5eydtwsdT__t5WtRgvpfMzpTc7</a></li>
<li><a href="https://en.wikipedia.org/wiki/Digital_signature" target="_blank">https://en.wikipedia.org/wiki/Digital_signature</a></li>
</ul>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="5-com.html" class="navigation navigation-prev " aria-label="Previous page: 加密通信">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="7-ca.html" class="navigation navigation-next " aria-label="Next page: 数字证书">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"数字签名","level":"1.7","depth":1,"next":{"title":"数字证书","level":"1.8","depth":1,"path":"7-ca.md","ref":"7-ca.md","articles":[]},"previous":{"title":"加密通信","level":"1.6","depth":1,"path":"5-com.md","ref":"5-com.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["livereload"],"pluginsConfig":{"livereload":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"6-sign.md","mtime":"2019-07-30T23:37:08.638Z","type":"markdown"},"gitbook":{"version":"3.2.2","time":"2019-07-30T23:38:07.793Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

