
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>数字证书 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.2">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="8-idea.html" />
    
    
    <link rel="prev" href="6-sign.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="1-punk.html">
            
                <a href="1-punk.html">
            
                    
                    密码朋克运动
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="2-crypto.html">
            
                <a href="2-crypto.html">
            
                    
                    什么是密码学
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="3-hash.html">
            
                <a href="3-hash.html">
            
                    
                    哈希算法
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="4-pub.html">
            
                <a href="4-pub.html">
            
                    
                    公开密钥加密
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="5-com.html">
            
                <a href="5-com.html">
            
                    
                    加密通信
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="6-sign.html">
            
                <a href="6-sign.html">
            
                    
                    数字签名
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.8" data-path="7-ca.html">
            
                <a href="7-ca.html">
            
                    
                    数字证书
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="8-idea.html">
            
                <a href="8-idea.html">
            
                    
                    RSA 算法--基本原理篇
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="9-math.html">
            
                <a href="9-math.html">
            
                    
                    RSA 算法--粗略数学推导篇
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="10-merk.html">
            
                <a href="10-merk.html">
            
                    
                    Merkle Tree
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="11-ecc.html">
            
                <a href="11-ecc.html">
            
                    
                    椭圆曲线密码学简介
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >数字证书</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <p>&#x672C;&#x8282;&#x804A;&#x7684;&#x8BDD;&#x9898;&#x662F;&#x6570;&#x5B57;&#x8BC1;&#x4E66;&#x3002;&#x5148;&#x6765;&#x4E2A;&#x9884;&#x8B66;&#xFF0C;&#x6CA1;&#x6709;&#x5A5A;&#x59FB;&#x7684;&#x793E;&#x4F1A;&#x91CC;&#x9762;&#xFF0C;&#x6CA1;&#x6709;&#x4EBA;&#x80FD;&#x7406;&#x89E3;&#x7ED3;&#x5A5A;&#x8BC1;&#x662F;&#x5E72;&#x4EC0;&#x4E48;&#x7684;&#xFF0C;&#x540C;&#x7406;&#xFF0C;&#x4E0D;&#x7406;&#x89E3;&#x516C;&#x5F00;&#x5BC6;&#x94A5;&#x52A0;&#x5BC6;&#x6280;&#x672F;&#x7684;&#x52A0;&#x5BC6;&#x901A;&#x4FE1;&#x548C;&#x6570;&#x5B57;&#x7B7E;&#x540D;&#x8FD9;&#x4E24;&#x4E2A;&#x6982;&#x5FF5;&#xFF0C;&#x4E5F;&#x4E0D;&#x4F1A;&#x7406;&#x89E3;&#x6570;&#x5B57;&#x8BC1;&#x4E66;&#x4EC0;&#x4E48;&#x7528;&#x3002;&#x8FD9;&#x4E9B;&#x8BDD;&#x9898;&#x4E4B;&#x524D;&#xFF0C;&#x524D;&#x9762;&#x5C0F;&#x8282;&#x4E2D;&#x54B1;&#x4EEC;&#x90FD;&#x804A;&#x8FC7;&#x4E86;&#xFF0C;&#x4E0D;&#x77E5;&#x9053;&#x4F60;&#x6709;&#x6CA1;&#x6709;&#x8BB0;&#x4F4F;&#x5462;&#xFF1F;&#x597D;&#xFF0C;&#x90A3;&#x4E48;&#x4EC0;&#x4E48;&#x662F;&#x6570;&#x5B57;&#x8BC1;&#x4E66;&#xFF0C;&#x53D1;&#x8BC1;&#x673A;&#x6784;&#x7684;&#x4F5C;&#x7528;&#x662F;&#x4EC0;&#x4E48;&#xFF0C;&#x52A0;&#x5BC6;&#x901A;&#x4FE1;&#x548C;&#x6570;&#x5B57;&#x7B7E;&#x540D;&#x8FC7;&#x7A0B;&#x4E2D;&#x8BC1;&#x4E66;&#x53D1;&#x6325;&#x4EC0;&#x4E48;&#x4F5C;&#x7528;&#x5462;&#xFF1F;&#x4E0B;&#x9762;&#x4E00;&#x4E00;&#x63ED;&#x6653;&#x3002;</p>
<h2 id="&#x4EC0;&#x4E48;&#x662F;&#x6570;&#x5B57;&#x8BC1;&#x4E66;&#xFF1F;">&#x4EC0;&#x4E48;&#x662F;&#x6570;&#x5B57;&#x8BC1;&#x4E66;&#xFF1F;</h2>
<p>&#x5148;&#x7ED9;&#x51FA;&#x4E00;&#x4E2A;&#x7CBE;&#x786E;&#x7684;&#x5B9A;&#x4E49;&#xFF0C;&#x7A76;&#x7ADF;&#x4EC0;&#x4E48;&#x662F;&#x6570;&#x5B57;&#x8BC1;&#x4E66;&#x5462;&#xFF1F;&#x6570;&#x5B57;&#x8BC1;&#x4E66;&#x662F;&#x4E00;&#x4E2A;&#x7531;&#x53EF;&#x4FE1;&#x7684;&#x7B2C;&#x4E09;&#x65B9;&#x53D1;&#x51FA;&#x7684;&#xFF0C;&#x7528;&#x6765;&#x8BC1;&#x660E;&#x6240;&#x6709;&#x4EBA;&#x8EAB;&#x4EFD;&#x4EE5;&#x53CA;&#x6240;&#x6709;&#x4EBA;&#x62E5;&#x6709;&#x8FD9;&#x4E2A;&#x516C;&#x94A5;&#x7684;&#x7535;&#x5B50;&#x6587;&#x4EF6;&#x3002;</p>
<p>&#x62FF;&#x51FA;&#x4E00;&#x4EFD;&#x5178;&#x578B;&#x7684;&#x6570;&#x5B57;&#x8BC1;&#x4E66;&#xFF0C;&#x770B;&#x770B;&#x91CC;&#x9762;&#x5230;&#x5E95;&#x90FD;&#x5305;&#x542B;&#x54EA;&#x51E0;&#x9879;&#x5185;&#x5BB9;&#x3002;&#x9996;&#x5148;&#x662F;&#x53D1;&#x8BC1;&#x673A;&#x6784; CA&#x3002;&#x7B2C;&#x4E8C;&#x4E2A;&#x662F;&#x6240;&#x6709;&#x4EBA;&#x59D3;&#x540D;&#xFF0C;&#x4F8B;&#x5982; Peter &#x3002;&#x7B2C;&#x4E09;&#x4E2A;&#x662F;&#x6240;&#x6709;&#x4EBA;&#x516C;&#x94A5;&#xFF0C;&#x4EE5;&#x53CA;&#x516C;&#x94A5;&#x7684;&#x8FC7;&#x671F;&#x65F6;&#x95F4;&#x3002;&#x6700;&#x540E;&#x4E00;&#x9879;&#x5C31;&#x662F; CA &#x7684;&#x6570;&#x5B57;&#x7B7E;&#x540D;&#x3002;&#x597D;&#xFF0C;&#x6839;&#x636E;&#x54B1;&#x4EEC;&#x5DF2;&#x6709;&#x7684;&#x6570;&#x5B57;&#x7B7E;&#x540D;&#x7684;&#x77E5;&#x8BC6;&#xFF0C;&#x53EF;&#x4EE5;&#x5F97;&#x51FA;&#x51E0;&#x4E2A;&#x7ED3;&#x8BBA;&#x3002;&#x9996;&#x5148;&#xFF0C;&#x6570;&#x5B57;&#x7B7E;&#x540D;&#x662F; CA &#x53D1;&#x51FA;&#x7684;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4; CA &#x7528;&#x81EA;&#x5DF1;&#x7684;&#x4FE1;&#x7528;&#x4E3A;&#x8FD9;&#x4E2A;&#x8BC1;&#x4E66;&#x505A;&#x80CC;&#x4E66;&#x3002;&#x7B2C;&#x4E8C;&#x70B9;&#xFF0C;&#x8BC1;&#x4E66;&#x4E0A;&#x540C;&#x65F6;&#x5E26;&#x6709;&#x6240;&#x6709;&#x4EBA;&#x4FE1;&#x606F;&#x548C;&#x516C;&#x94A5;&#xFF0C;&#x6570;&#x5B57;&#x7B7E;&#x540D;&#x4FDD;&#x8BC1;&#x4E86;&#x8BC1;&#x4E66;&#x662F;&#x4E0D;&#x53EF;&#x7BE1;&#x6539;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x8BF4;&#xFF0C;&#x53EA;&#x8981;&#x5927;&#x5BB6;&#x4FE1;&#x4EFB; CA &#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x4FE1;&#x4EFB;&#x6240;&#x6709;&#x4EBA;&#x548C;&#x516C;&#x94A5;&#x4E4B;&#x95F4;&#x7684;&#x7ED1;&#x5B9A;&#x5173;&#x7CFB;&#x3002;</p>
<p><img src="https://img.haoqicat.com/2018093001.jpg" alt=""></p>
<p>&#x6240;&#x4EE5;&#x8BF4;&#xFF0C;&#x6570;&#x5B57;&#x8BC1;&#x4E66;&#x5C31;&#x662F;&#x7B2C;&#x4E09;&#x65B9;&#x673A;&#x6784;&#x53D1;&#x884C;&#x7684;&#x8BC1;&#x4E66;&#xFF0C;&#x4E3B;&#x8981;&#x4F5C;&#x7528;&#x5C31;&#x662F;&#x8BC1;&#x660E;&#x4F60;&#x7684;&#x516C;&#x94A5;&#x7684;&#x786E;&#x662F;&#x5C5E;&#x4E8E;&#x4F60;&#x7684;&#xFF0C;&#x800C;&#x516C;&#x94A5;&#x5176;&#x5B9E;&#x5C31;&#x662F;&#x6211;&#x4EEC;&#x5728;&#x6570;&#x5B57;&#x4E16;&#x754C;&#x7684;&#x8EAB;&#x4EFD;&#xFF0C;&#x6240;&#x4EE5;&#x8BF4;&#x6570;&#x5B57;&#x8BC1;&#x4E66;&#x7684;&#x4F5C;&#x7528;&#x5B9E;&#x9645;&#x4E0A;&#x5C31;&#x662F;&#x8BC1;&#x660E;&#x4F60;&#x662F;&#x4F60;&#x81EA;&#x5DF1;&#x3002;</p>
<h2 id="&#x6570;&#x5B57;&#x8BC1;&#x4E66;&#x7684;&#x4F5C;&#x7528;">&#x6570;&#x5B57;&#x8BC1;&#x4E66;&#x7684;&#x4F5C;&#x7528;</h2>
<p>&#x4E0B;&#x9762;&#x6211;&#x4EEC;&#x8BE6;&#x7EC6;&#x8BF4;&#x8BF4;&#x6570;&#x5B57;&#x8BC1;&#x4E66;&#x7684;&#x4F5C;&#x7528;&#x3002;&#x5E38;&#x89C1;&#x7684;&#x4E24;&#x4E2A;&#x5E94;&#x7528;&#x573A;&#x5408;&#xFF0C;&#x4E00;&#x4E2A;&#x662F;&#x7528;&#x5728;&#x6570;&#x5B57;&#x7B7E;&#x540D;&#x65B9;&#x9762;&#xFF0C;&#x53E6;&#x5916;&#x4E00;&#x4E2A;&#x5C31;&#x662F; HTTPS &#x3002;&#x6211;&#x4EEC;&#x9996;&#x5148;&#x770B;&#x4E00;&#x4E2A;&#x5B8C;&#x6574;&#x7684;&#x6570;&#x5B57;&#x7B7E;&#x540D;&#x7684;&#x4F7F;&#x7528;&#x8FC7;&#x7A0B;&#xFF0C;&#x5206;&#x6790;&#x5176;&#x4E2D;&#x7684;&#x5B89;&#x5168;&#x9690;&#x60A3;&#xFF0C;&#x518D;&#x770B;&#x770B;&#x6570;&#x5B57;&#x8BC1;&#x4E66;&#x662F;&#x600E;&#x4E48;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x7684;&#x3002;</p>
<p>Bob &#x60F3;&#x8981;&#x628A;&#x4E00;&#x4E2A;&#x5E26;&#x6570;&#x5B57;&#x7B7E;&#x540D;&#x7684;&#x6587;&#x4EF6;&#x4F20;&#x9012;&#x7ED9; Alice &#x3002;&#x4E8E;&#x662F; Bob &#x751F;&#x6210;&#x4E86;&#x516C;&#x94A5;&#x548C;&#x79C1;&#x94A5;&#xFF0C;&#x7528;&#x79C1;&#x94A5;&#x7B7E;&#x7F72;&#x4E86;&#x6587;&#x4EF6;&#x3002;&#x7136;&#x540E;&#x628A;&#x516C;&#x94A5;&#x4E0A;&#x4F20;&#x5230;&#x4E00;&#x4E2A;&#x516C;&#x5171;&#x670D;&#x52A1;&#x5668;&#x4E0A;&#x3002;&#x5982;&#x679C;&#x4E00;&#x5207;&#x987A;&#x5229;&#xFF0C;&#x90A3; Alice &#x53BB;&#x4E0B;&#x8F7D;&#x8FD9;&#x4E2A;&#x516C;&#x94A5;&#xFF0C;&#x7136;&#x540E;&#x5C31;&#x53EF;&#x4EE5;&#x9A8C;&#x8BC1;&#x7B7E;&#x540D;&#xFF0C;&#x786E;&#x8BA4;&#x6587;&#x4EF6;&#x7684;&#x786E;&#x662F; Bob &#x53D1;&#x51FA;&#x7684;&#xFF0C;&#x540C;&#x65F6;&#x6CA1;&#x6709;&#x88AB;&#x7BE1;&#x6539;&#x8FC7;&#x3002;&#x4F46;&#x662F;&#x8FD9;&#x91CC;&#x7684;&#x5B89;&#x5168;&#x6F0F;&#x6D1E;&#x662F;&#x660E;&#x663E;&#x7684;&#xFF0C;&#x90A3;&#x5C31;&#x662F; Alice &#x65E0;&#x6CD5;&#x786E;&#x8BA4;&#x5979;&#x4E0B;&#x8F7D;&#x7684;&#x516C;&#x94A5;&#x662F;&#x4E0D;&#x662F;&#x771F;&#x7684;&#x662F; Bob &#x7684;&#x3002;&#x8FD9;&#x5C31;&#x7ED9;&#x6240;&#x8C13;&#x7684;&#x201C;&#x4E2D;&#x95F4;&#x4EBA;&#x653B;&#x51FB;&#x201D;&#x63D0;&#x4F9B;&#x4E86;&#x53EF;&#x80FD;&#x3002;&#x5047;&#x8BBE;&#x5728; Bob &#x7684;&#x6587;&#x4EF6;&#x8FD8;&#x6CA1;&#x6709;&#x5230;&#x8FBE; Alice &#x4E4B;&#x524D;&#xFF0C;&#x9ED1;&#x5BA2;&#x53D1;&#x8D77;&#x4E86;&#x4E2D;&#x95F4;&#x4EBA;&#x653B;&#x51FB;&#xFF0C;&#x5220;&#x9664; Bob &#x7684;&#x6587;&#x4EF6;&#xFF0C;&#x7136;&#x540E;&#x7B7E;&#x7F72;&#x4E00;&#x4E2A;&#x5047;&#x6587;&#x4EF6;&#x53D1;&#x9001;&#x7ED9; Alice &#xFF0C;Alice &#x6536;&#x5230;&#x540E;&#x53BB;&#x516C;&#x5171;&#x670D;&#x52A1;&#x4E0A;&#x4E0B;&#x8F7D;&#x7684;&#x516C;&#x94A5;&#x5176;&#x5B9E;&#x4E5F;&#x88AB;&#x9ED1;&#x5BA2;&#x66FF;&#x6362;&#x8FC7;&#x7684;&#xFF0C;&#x5979;&#x7528;&#x8FD9;&#x4E2A;&#x516C;&#x94A5;&#x53BB;&#x9A8C;&#x8BC1;&#x4E86;&#x7B7E;&#x540D;&#xFF0C;&#x81EA;&#x8BA4;&#x4E3A;&#x6587;&#x4EF6;&#x5C31;&#x662F; Bob &#x53D1;&#x51FA;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x88AB;&#x9A97;&#x4E86;&#x3002;&#x5176;&#x5B9E;&#x4ED4;&#x7EC6;&#x60F3;&#x60F3;&#xFF0C;&#x95EE;&#x9898;&#x5C31;&#x51FA;&#x5728;&#x516C;&#x94A5;&#x672C;&#x8EAB;&#x6CA1;&#x6709;&#x529E;&#x6CD5;&#x8BC1;&#x660E;&#x81EA;&#x5DF1;&#x7684;&#x4E3B;&#x4EBA;&#x662F;&#x8C01;&#x3002;</p>
<p>&#x6240;&#x4EE5;&#x8981;&#x907F;&#x514D;&#x4E2D;&#x95F4;&#x4EBA;&#x653B;&#x51FB;&#xFF0C;&#x5C31;&#x8981;&#x4F7F;&#x7528;&#x6570;&#x5B57;&#x8BC1;&#x4E66;&#x3002;Bob &#x7B7E;&#x540D;&#x6587;&#x4EF6;&#x4E4B;&#x540E;&#xFF0C;&#x7ED9; Alice &#x53D1;&#x9001;&#x65F6;&#x9644;&#x4E0A;&#x81EA;&#x5DF1;&#x7684;&#x8BC1;&#x4E66;&#x3002;Alice &#x6536;&#x5230;&#x8BC1;&#x4E66;&#x4E4B;&#x540E;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x4FE1;&#x4EFB;&#x8BC1;&#x4E66;&#x4E2D;&#x7684;&#x516C;&#x94A5;&#x7684;&#x786E;&#x5C31;&#x662F; Bob &#x7684;&#x4E86;&#x3002;&#x6709;&#x4E86;&#x8FD9;&#x4E2A;&#x516C;&#x94A5;&#xFF0C;&#x53EF;&#x4EE5;&#x9A8C;&#x8BC1;&#x6587;&#x4EF6;&#x9644;&#x5E26;&#x7684;&#x6570;&#x5B57;&#x7B7E;&#x540D;&#x662F; Bob &#x7684;&#x3002;&#x6570;&#x5B57;&#x7B7E;&#x540D;&#x6CA1;&#x95EE;&#x9898;&#xFF0C;&#x5C31;&#x4FDD;&#x8BC1;&#x4E86;&#x6587;&#x4EF6;&#x662F;&#x6CA1;&#x6709;&#x88AB;&#x7BE1;&#x6539;&#x8FC7;&#x7684;&#x3002;&#x81F3;&#x4E8E; Alice &#x5982;&#x4F55;&#x786E;&#x8BA4;&#x8BC1;&#x4E66;&#x672C;&#x8EAB;&#x662F;&#x53EF;&#x4FE1;&#x7684;&#xFF0C;&#x7A0D;&#x540E;&#x6211;&#x4EEC;&#x804A; HTTPS &#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#x518D;&#x5C55;&#x5F00;&#x804A;&#x3002;</p>
<p>&#x5230;&#x8FD9;&#x91CC;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x660E;&#x767D;&#x4E86;&#x6570;&#x5B57;&#x8BC1;&#x4E66;&#x5728;&#x9A8C;&#x8BC1;&#x6570;&#x5B57;&#x7B7E;&#x540D;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#x53D1;&#x6325;&#x7684;&#x4F5C;&#x7528;&#x4E86;&#x3002;</p>
<h2 id="&#x901A;&#x8FC7;-https-&#x7406;&#x89E3;&#x8BC1;&#x4E66;">&#x901A;&#x8FC7; HTTPS &#x7406;&#x89E3;&#x8BC1;&#x4E66;</h2>
<p>&#x65E5;&#x5E38;&#x4E2D;&#x975E;&#x5E38;&#x5E38;&#x89C1;&#x7684;&#x52A0;&#x5BC6;&#x901A;&#x4FE1;&#x8FC7;&#x7A0B;&#x5C31;&#x662F; HTTPS &#xFF0C;&#x4E0B;&#x9762;&#x6211;&#x4EEC;&#x5C31;&#x8BE6;&#x7EC6;&#x804A;&#x804A; HTTPS &#x7684;&#x539F;&#x7406;&#xFF0C;&#x6765;&#x5E2E;&#x5927;&#x5BB6;&#x52A0;&#x6DF1;&#x4E00;&#x4E0B;&#x5BF9;&#x6570;&#x5B57;&#x8BC1;&#x4E66;&#x7684;&#x7406;&#x89E3;&#x3002;</p>
<p>HTTPS &#x5C31;&#x662F;&#x5B89;&#x5168;&#x7684; HTTP &#x7684;&#x610F;&#x601D;&#xFF0C;&#x662F;&#x4E00;&#x5957;&#x7528;&#x5728;&#x6D4F;&#x89C8;&#x5668;&#x548C;&#x670D;&#x52A1;&#x5668;&#x4E4B;&#x95F4;&#x901A;&#x4FE1;&#x7684;&#x534F;&#x8BAE;&#x3002;&#x4F7F;&#x7528;&#x4E86; HTTPS &#x540E;&#xFF0C;&#x6D4F;&#x89C8;&#x5668;&#x8DDF;&#x670D;&#x52A1;&#x5668;&#x4E4B;&#x95F4;&#x6240;&#x6709;&#x7684;&#x901A;&#x4FE1;&#x5185;&#x5BB9;&#x90FD;&#x662F;&#x52A0;&#x5BC6;&#x8FC7;&#x7684;&#x3002;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x4E2D;&#x7684;&#x4E3B;&#x89D2;&#x5C31;&#x662F; SSL &#x8BC1;&#x4E66;&#xFF0C;SSL &#x8BC1;&#x4E66;&#x5C31;&#x662F;&#x7528;&#x5728; HTTPS &#x6761;&#x4EF6;&#x4E0B;&#x7684;&#x6570;&#x5B57;&#x8BC1;&#x4E66;&#xFF0C;&#x4E5F;&#x662F;&#x7531;&#x53EF;&#x4FE1;&#x7684;&#x7B2C;&#x4E09;&#x65B9; CA &#x6765;&#x9881;&#x53D1;&#x3002;&#x53EA;&#x4E0D;&#x8FC7;&#x9A8C;&#x8BC1;&#x7684;&#x4E0D;&#x662F;&#x4EBA;&#x7684;&#x8EAB;&#x4EFD;&#xFF0C;&#x800C;&#x662F;&#x7528;&#x6765;&#x9A8C;&#x8BC1;&#x670D;&#x52A1;&#x5668;&#x8EAB;&#x4EFD;&#x548C;&#x5B83;&#x7684;&#x516C;&#x94A5;&#xFF0C;&#x76EE;&#x7684;&#x662F;&#x5EFA;&#x7ACB;&#x6D4F;&#x89C8;&#x5668;&#x548C;&#x670D;&#x52A1;&#x5668;&#x4E4B;&#x95F4;&#x7684;&#x4FE1;&#x4EFB;&#x3002;</p>
<p>&#x6BD4;&#x5982;&#xFF0C;&#x6211;&#x73B0;&#x5728;&#x7528;&#x6D4F;&#x89C8;&#x5668;&#x6765;&#x8BBF;&#x95EE;&#x8C37;&#x6B4C;&#x670D;&#x52A1;&#x5668;&#x3002;&#x8981;&#x5EFA;&#x7ACB;&#x52A0;&#x5BC6;&#x901A;&#x9053;&#xFF0C;&#x9996;&#x5148;&#x7B2C;&#x4E00;&#x6B65;&#x662F;&#x8981;&#x4F20;&#x9012;&#x516C;&#x94A5;&#x8FC7;&#x6765;&#xFF0C;&#x4F46;&#x662F;&#x670D;&#x52A1;&#x5668;&#x4F20;&#x9012;&#x8FC7;&#x6765;&#x7684;&#x516C;&#x94A5;&#x5982;&#x679C;&#x8FC7;&#x7A0B;&#x4E2D;&#x88AB;&#x7BE1;&#x6539;&#x8FC7;&#xFF0C;&#x90A3;&#x4E48;&#x540E;&#x7EED;&#x7684;&#x52A0;&#x5BC6;&#x901A;&#x4FE1;&#x4E5F;&#x5C31;&#x5168;&#x65E0;&#x5B89;&#x5168;&#x6027;&#x53EF;&#x8A00;&#x4E86;&#x3002;&#x6240;&#x4EE5;&#x8C37;&#x6B4C;&#x9700;&#x8981;&#x5148;&#x53BB; CA &#x673A;&#x6784;&#x7533;&#x8BF7; SSL &#x8BC1;&#x4E66;&#xFF0C;&#x653E;&#x5230;&#x81EA;&#x5DF1;&#x7684;&#x670D;&#x52A1;&#x5668;&#x4E0A;&#x3002;&#x8FD9;&#x6837;&#xFF0C;&#x6211;&#x5728;&#x6D4F;&#x89C8;&#x5668;&#x4E2D;&#x8F93;&#x5165;&#x8C37;&#x6B4C;&#x7684;&#x7F51;&#x5740;&#xFF0C;&#x8C37;&#x6B4C;&#x90A3;&#x8FB9;&#x4F1A;&#x9996;&#x5148;&#x7ED9;&#x6D4F;&#x89C8;&#x5668;&#x53D1;&#x9001; SSL &#x8BC1;&#x4E66;&#x3002;&#x6CE8;&#x610F;&#xFF0C;&#x5404;&#x4E2A;&#x6D4F;&#x89C8;&#x5668;&#x4E2D;&#x90FD;&#x5185;&#x7F6E;&#x4E86;&#x5BF9;&#x5168;&#x7403;&#x5404;&#x5927; CA &#x673A;&#x6784;&#x7684;&#x9A8C;&#x8BC1;&#x673A;&#x5236;&#xFF0C;&#x5E95;&#x5C42;&#x7684;&#x539F;&#x7406;&#x5C31;&#x662F;&#x62E5;&#x6709; CA &#x4EEC;&#x7684;&#x516C;&#x94A5;&#xFF0C;&#x53EF;&#x4EE5;&#x9A8C;&#x8BC1;&#x8BC1;&#x4E66;&#x4E0A; CA &#x7684;&#x7B7E;&#x540D;&#x3002;&#x5982;&#x679C;&#x8BC1;&#x4E66;&#x6CA1;&#x6709;&#x95EE;&#x9898;&#xFF0C;&#x6D4F;&#x89C8;&#x5668;&#x5C31;&#x53EF;&#x4EE5;&#x65AD;&#x5B9A;&#x8BC1;&#x4E66;&#x4E2D;&#x643A;&#x5E26;&#x8FC7;&#x6765;&#x7684;&#x516C;&#x94A5;&#x5C31;&#x662F;&#x8C37;&#x6B4C;&#x7684;&#x3002;&#x8FD9;&#x65F6;&#x5019;&#xFF0C;&#x6D4F;&#x89C8;&#x5668;&#x4F1A;&#x751F;&#x6210;&#x4E00;&#x4E2A;&#x79D8;&#x94A5;&#xFF0C;&#x6CE8;&#x610F;&#x8FD9;&#x91CC;&#x5C31;&#x662F;&#x5BF9;&#x79F0;&#x52A0;&#x5BC6;&#x7684;&#x601D;&#x8DEF;&#x4E86;&#xFF0C;&#x53D1;&#x9001;&#x7ED9;&#x8C37;&#x6B4C;&#x670D;&#x52A1;&#x5668;&#x3002;&#x8FD9;&#x6837;&#xFF0C;&#x8C37;&#x6B4C;&#x62E5;&#x6709;&#x6D4F;&#x89C8;&#x5668;&#x7684;&#x52A0;&#x5BC6;&#x79D8;&#x94A5;&#xFF0C;&#x53EF;&#x4EE5;&#x7528;&#x5BF9;&#x79F0;&#x52A0;&#x5BC6;&#x7684;&#x601D;&#x8DEF;&#x6765;&#x8DDF;&#x6D4F;&#x89C8;&#x5668;&#x901A;&#x4FE1;&#x4E86;&#xFF0C;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x53CC;&#x5411;&#x7684;&#x52A0;&#x5BC6;&#x901A;&#x4FE1;&#x901A;&#x9053;&#x4E5F;&#x5C31;&#x5F00;&#x901A;&#x4E86;&#x3002;&#x5BF9;&#x79F0;&#x52A0;&#x5BC6;&#x7684;&#x52A0;&#x5BC6;&#x6548;&#x7387;&#x8981;&#x6BD4;&#x975E;&#x5BF9;&#x79F0;&#x9AD8;&#xFF0C;&#x6240;&#x4EE5;&#x5927;&#x91CF;&#x6570;&#x636E;&#x7684;&#x4F20;&#x9012;&#x9996;&#x9009;&#x5BF9;&#x79F0;&#x52A0;&#x5BC6;&#x3002;</p>
<p><img src="https://img.haoqicat.com/2018093002.jpg" alt=""></p>
<p>&#x8FD9;&#x4E2A;&#x5C31;&#x662F; HTTPS &#x7684;&#x57FA;&#x672C;&#x539F;&#x7406;&#x4E86;&#x3002;&#x52A0;&#x5BC6;&#x901A;&#x4FE1;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x8BC1;&#x4E66;&#x7684;&#x4F5C;&#x7528;&#x662F;&#x5224;&#x65AD;&#x516C;&#x94A5;&#x6240;&#x6709;&#x4EBA;&#x3002;HTTPS &#x6574;&#x4E2A;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x540C;&#x65F6;&#x6D89;&#x53CA;&#x5230;&#x4E86;&#x6570;&#x5B57;&#x7B7E;&#x540D;&#x548C;&#x52A0;&#x5BC6;&#x901A;&#x4FE1;&#xFF0C;&#x8FD8;&#x7528;&#x5230;&#x4E86;&#x5BF9;&#x79F0;&#x52A0;&#x5BC6;&#x548C;&#x516C;&#x94A5;&#x52A0;&#x5BC6;&#x4E24;&#x79CD;&#x4E0D;&#x540C;&#x7684;&#x52A0;&#x5BC6;&#x65B9;&#x5F0F;&#xFF0C;&#x7B97;&#x662F;&#x6BD4;&#x8F83;&#x7EFC;&#x5408;&#x7684;&#x4E00;&#x4E2A;&#x77E5;&#x8BC6;&#x70B9;&#x4E86;&#x3002;&#x4F46;&#x662F;&#x8981;&#x63D0;&#x9192;&#x4E00;&#x4E0B;&#xFF0C;SSL &#x8BC1;&#x4E66;&#xFF0C;&#x5C24;&#x5176;&#x662F;&#x514D;&#x8D39;&#x7684; SSL &#x8BC1;&#x4E66;&#xFF0C;&#x4E00;&#x822C;&#x5BF9;&#x4E8E;&#x7533;&#x8BF7;&#x4EBA;&#x7684;&#x8EAB;&#x4EFD;&#x672C;&#x8EAB;&#x6CA1;&#x6709;&#x5F88;&#x4E25;&#x683C;&#x7684;&#x5BA1;&#x67E5;&#xFF0C;CA &#x53EA;&#x80FD;&#x4FDD;&#x969C;&#x6211;&#x62E5;&#x6709;&#x8FD9;&#x4E2A;&#x57DF;&#x540D;&#x548C;&#x8FD9;&#x4E2A;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x800C;&#x4E14;&#x8FD9;&#x4E2A;&#x516C;&#x94A5;&#x662F;&#x8DDF;&#x8FD9;&#x4E2A;&#x57DF;&#x540D;&#x548C;&#x670D;&#x52A1;&#x5668;&#x7ED1;&#x5B9A;&#x7684;&#x3002;&#x4F46;&#x662F;&#x7A76;&#x7ADF;&#x6211;&#x662F;&#x4E0D;&#x662F;&#x597D;&#x4EBA;&#xFF0C;&#x7F51;&#x7AD9;&#x662F;&#x4E0D;&#x662F;&#x4F1A;&#x5E72;&#x574F;&#x4E8B;&#xFF0C;CA &#x673A;&#x6784;&#x4E5F;&#x4E0D;&#x77E5;&#x9053;&#x3002;&#x6240;&#x4EE5;&#x4E00;&#x4E2A;&#x7F51;&#x7AD9;&#x62E5;&#x6709;&#x4E86; HTTPS&#xFF0C;&#x6D4F;&#x89C8;&#x5668;&#x5730;&#x5740;&#x680F;&#x4E0A;&#x9762;&#x51FA;&#x73B0;&#x4E86;&#x7EFF;&#x8272;&#x7684;&#x5B89;&#x5168;&#x5C0F;&#x9501;&#xFF0C;&#x4E5F;&#x5E76;&#x4E0D;&#x4EE3;&#x8868;&#x4F60;&#x5C31;&#x53EF;&#x4EE5;&#x5B8C;&#x5168;&#x4FE1;&#x4EFB;&#x8FD9;&#x4E2A;&#x7F51;&#x7AD9;&#x3002;</p>
<h2 id="&#x603B;&#x7ED3;">&#x603B;&#x7ED3;</h2>
<p>&#x5173;&#x4E8E;&#x6570;&#x5B57;&#x8BC1;&#x4E66;&#x6211;&#x4EEC;&#x8981;&#x804A;&#x7684;&#x5C31;&#x662F;&#x8FD9;&#x4E9B;&#x4E86;&#x3002;&#x8BC1;&#x4E66;&#x7684;&#x4F5C;&#x7528;&#x5C31;&#x662F;&#x8BA4;&#x8BC1;&#x6240;&#x6709;&#x4EBA;&#x548C;&#x516C;&#x94A5;&#x7684;&#x5173;&#x7CFB;&#x3002;&#x6709;&#x4E86;&#x8BC1;&#x4E66;&#x5C31;&#x53EF;&#x4EE5;&#x907F;&#x514D;&#x4E2D;&#x95F4;&#x4EBA;&#x653B;&#x51FB;&#xFF0C;&#x53EF;&#x4EE5;&#x5B89;&#x5168;&#x7684;&#x5EFA;&#x7ACB;&#x8D77;&#x52A0;&#x5BC6;&#x901A;&#x9053;&#x3002;&#x4F46;&#x662F;&#x6211;&#x4EEC;&#x8981;&#x77E5;&#x9053;&#x7684;&#x662F;&#xFF0C;&#x8FD9;&#x91CC;&#x7684;&#x5B89;&#x5168;&#x5B8C;&#x5168;&#x57FA;&#x4E8E;&#x5BF9;&#x4E00;&#x4E2A;&#x7B2C;&#x4E09;&#x65B9;&#x673A;&#x6784;&#xFF0C;&#x4E5F;&#x5C31;&#x662F; CA &#xFF0C;&#x7684;&#x4FE1;&#x4EFB;&#x3002;&#x800C; CA &#x4E3A;&#x4F55;&#x503C;&#x5F97;&#x4FE1;&#x4EFB;&#x5462;&#xFF1F;&#x57FA;&#x672C;&#x4E0A;&#x5C31;&#x662F;&#x56E0;&#x4E3A; CA &#x4E00;&#x822C;&#x90FD;&#x662F;&#x5927;&#x673A;&#x6784;&#xFF0C;&#x90FD;&#x662F;&#x653F;&#x5E9C;&#x8BA4;&#x8BC1;&#x7684;&#xFF0C;&#x7B49;&#x7B49;&#x8FD9;&#x4E9B;&#x4F20;&#x7EDF;&#x7684;&#x4FE1;&#x4EFB;&#x673A;&#x5236;&#x3002;&#x4E0D;&#x8FC7;&#x5F53;&#x524D;&#xFF0C;&#x5DF2;&#x7ECF;&#x6709;&#x533A;&#x5757;&#x94FE;&#x516C;&#x53F8;&#x4F1A;&#x901A;&#x8FC7;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x7684;&#x601D;&#x8DEF;&#x6765;&#x201C;&#x53BB;&#x4FE1;&#x4EFB;&#x201D;&#xFF0C;&#x6765;&#x5B9E;&#x73B0;&#x65E0; CA &#x673A;&#x6784;&#x7684;&#x6570;&#x5B57;&#x8BC1;&#x4E66;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x5171;&#x540C;&#x671F;&#x5F85;&#x3002;</p>
<p>&#x53C2;&#x8003;&#xFF1A;</p>
<ul>
<li><a href="https://www.youtube.com/watch?v=33VYnE7Bzpk" target="_blank">https://www.youtube.com/watch?v=33VYnE7Bzpk</a></li>
<li><a href="https://www.youtube.com/watch?v=UbMlPIgzTxc&amp;list=PLSNNzog5eyduzyJ8_6Je-tYOgMHvo344c" target="_blank">https://www.youtube.com/watch?v=UbMlPIgzTxc&amp;list=PLSNNzog5eyduzyJ8_6Je-tYOgMHvo344c</a></li>
<li><a href="https://en.wikipedia.org/wiki/Certificate_authority" target="_blank">https://en.wikipedia.org/wiki/Certificate_authority</a></li>
</ul>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="6-sign.html" class="navigation navigation-prev " aria-label="Previous page: 数字签名">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="8-idea.html" class="navigation navigation-next " aria-label="Next page: RSA 算法--基本原理篇">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"数字证书","level":"1.8","depth":1,"next":{"title":"RSA 算法--基本原理篇","level":"1.9","depth":1,"path":"8-idea.md","ref":"8-idea.md","articles":[]},"previous":{"title":"数字签名","level":"1.7","depth":1,"path":"6-sign.md","ref":"6-sign.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["livereload"],"pluginsConfig":{"livereload":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"7-ca.md","mtime":"2019-07-30T23:37:08.639Z","type":"markdown"},"gitbook":{"version":"3.2.2","time":"2019-07-30T23:38:07.793Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

