
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>RSA 算法--粗略数学推导篇 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.2">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="10-merk.html" />
    
    
    <link rel="prev" href="8-idea.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="1-punk.html">
            
                <a href="1-punk.html">
            
                    
                    密码朋克运动
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="2-crypto.html">
            
                <a href="2-crypto.html">
            
                    
                    什么是密码学
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="3-hash.html">
            
                <a href="3-hash.html">
            
                    
                    哈希算法
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="4-pub.html">
            
                <a href="4-pub.html">
            
                    
                    公开密钥加密
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="5-com.html">
            
                <a href="5-com.html">
            
                    
                    加密通信
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="6-sign.html">
            
                <a href="6-sign.html">
            
                    
                    数字签名
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="7-ca.html">
            
                <a href="7-ca.html">
            
                    
                    数字证书
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="8-idea.html">
            
                <a href="8-idea.html">
            
                    
                    RSA 算法--基本原理篇
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.10" data-path="9-math.html">
            
                <a href="9-math.html">
            
                    
                    RSA 算法--粗略数学推导篇
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="10-merk.html">
            
                <a href="10-merk.html">
            
                    
                    Merkle Tree
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="11-ecc.html">
            
                <a href="11-ecc.html">
            
                    
                    椭圆曲线密码学简介
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >RSA 算法--粗略数学推导篇</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <p>&#x4E0A;&#x8282;&#x6211;&#x4EEC;&#x4ECB;&#x7ECD;&#x5B8C; RSA &#x7B97;&#x6CD5;&#x7684;&#x57FA;&#x672C;&#x539F;&#x7406;&#x4E86;&#xFF0C;&#x4E86;&#x89E3;&#x4E86; RSA &#x7B97;&#x6CD5;&#x7684;&#x52A0;&#x5BC6;&#x9501;&#x5C31;&#x662F;&#x5148;&#x5E42;&#x540E;&#x6A21;&#x7684;&#x8FD0;&#x7B97;&#x3002;&#x8FD9;&#x4E2A;&#x9501;&#x7684;&#x7279;&#x70B9;&#x662F;&#x6B63;&#x5411;&#x8FD0;&#x7B97;&#x5F88;&#x5BB9;&#x6613;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x52A0;&#x5BC6;&#x8FC7;&#x7A0B;&#x5F88;&#x5BB9;&#x6613;&#xFF0C;&#x4F46;&#x662F;&#x89E3;&#x5BC6;&#x8FC7;&#x7A0B;&#x5F88;&#x96BE;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8981;&#x76F4;&#x63A5;&#x53CD;&#x5411;&#x8FD0;&#x7B97;&#x662F;&#x4E0D;&#x53EF;&#x80FD;&#x7684;&#x3002;&#x800C;&#x8981;&#x60F3;&#x8BA9;&#x53CD;&#x5411;&#x8FD0;&#x7B97;&#x6210;&#x4E3A;&#x53EF;&#x80FD;&#xFF0C;&#x5C31;&#x8981;&#x5728;&#x5148;&#x5E42;&#x540E;&#x6A21;&#x8FD0;&#x7B97;&#x7684;&#x5404;&#x9879;&#x53C2;&#x6570;&#x4E0A;&#x505A;&#x6587;&#x7AE0;&#xFF0C;&#x8BA9;&#x5404;&#x9879;&#x53C2;&#x6570;&#x4E4B;&#x95F4;&#x901A;&#x8FC7;&#x6574;&#x6570;&#x5206;&#x89E3;&#x95EE;&#x9898;&#x5EFA;&#x7ACB;&#x5173;&#x7CFB;&#xFF0C;&#x8FD9;&#x6837;&#x53EA;&#x8981;&#x6211;&#x4EEC;&#x628A;&#x63E1;&#x4F4F;&#x8FD9;&#x79CD;&#x5173;&#x7CFB;&#xFF0C;&#x90A3;&#x4E48;&#x53CD;&#x5411;&#x8FD0;&#x7B97;&#x5C31;&#x53D8;&#x5F97;&#x5BB9;&#x6613;&#x4E86;&#x3002;&#x6240;&#x4EE5;&#x672C;&#x8282;&#x5C31;&#x6765;&#x6DF1;&#x5165;&#x5230;&#x6574;&#x6570;&#x5206;&#x89E3;&#x95EE;&#x9898;&#xFF0C;&#x770B;&#x770B;&#x5982;&#x4F55;&#x6765;&#x6784;&#x5EFA;&#x5148;&#x5E42;&#x540E;&#x6A21;&#x4E2D;&#x7684;&#x5404;&#x9879;&#x53C2;&#x6570;&#x4E4B;&#x95F4;&#x7684;&#x5173;&#x7CFB;&#xFF0C;&#x8FDB;&#x800C;&#x5F15;&#x7533;&#x51FA;&#x5982;&#x4F55;&#x751F;&#x6210;&#x516C;&#x94A5;&#x548C;&#x79C1;&#x94A5;&#x3002;</p>
<h2 id="&#x63D0;&#x51FA;&#x95EE;&#x9898;">&#x63D0;&#x51FA;&#x95EE;&#x9898;</h2>
<p>&#x4E0B;&#x9762;&#x6211;&#x4EEC;&#x628A;&#x8981;&#x89E3;&#x51B3;&#x7684;&#x95EE;&#x9898;&#x8FDB;&#x4E00;&#x6B65;&#x660E;&#x786E;&#x4E00;&#x4E0B;&#xFF0C;&#x62BD;&#x8C61;&#x6210;&#x5177;&#x4F53;&#x7684;&#x6570;&#x5B66;&#x4EFB;&#x52A1;&#x3002;&#x5148;&#x5E42;&#x540E;&#x6A21;&#x51FD;&#x6570;&#x7684;&#x6B63;&#x5411;&#x8FD0;&#x7B97;&#xFF0C;&#x4ECE;&#x4FE1;&#x606F; m &#x83B7;&#x5F97;&#x5BC6;&#x6587; c &#x662F;&#x7B80;&#x5355;&#x7684;&#xFF0C;&#x800C;&#x53CD;&#x5411;&#x8FD0;&#x7B97;&#xFF0C;&#x4ECE; c &#x8FD0;&#x7B97;&#x83B7;&#x5F97; m &#x662F;&#x5F88;&#x96BE;&#x7684;&#x3002;&#x4F46;&#x662F;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x80FD;&#x591F;&#x5408;&#x7406;&#x7684;&#x6784;&#x5EFA; e &#x548C; N &#x4E4B;&#x95F4;&#x7684;&#x5173;&#x7CFB;&#xFF0C;&#x540C;&#x65F6;&#x628A;&#x63E1;&#x4F53;&#x73B0; e &#x548C; N &#x4E4B;&#x95F4;&#x5173;&#x7CFB;&#x7684;&#x5173;&#x952E;&#x4FE1;&#x606F;&#xFF0C;&#x8FD9;&#x4E2A;&#x53CD;&#x5411;&#x8FD0;&#x7B97;&#x5C06;&#x4E0D;&#x518D;&#x56F0;&#x96BE;&#x3002;</p>
<p><img src="https://img.haoqicat.com/2018100402.jpg" alt=""></p>
<p>&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;&#x6211;&#x4EEC;&#x603B;&#x80FD;&#x627E;&#x5230;&#x4E00;&#x4E2A;&#x5408;&#x9002;&#x7684; d &#xFF0C;&#x4F7F;&#x5F97; c &#x7684; d &#x6B21;&#x65B9;&#x5BF9; N &#x6C42;&#x6A21;&#x7684;&#x7ED3;&#x679C;&#x5C31;&#x662F; m &#x3002;&#x6240;&#x4EE5;&#x95EE;&#x9898;&#x8FDB;&#x4E00;&#x6B65;&#x7684;&#x5C31;&#x662F;&#x8981;&#x6784;&#x5EFA; e , d &#x4EE5;&#x53CA; N &#x7684;&#x6570;&#x5B66;&#x8054;&#x7CFB;&#x3002;</p>
<p><img src="https://img.haoqicat.com/2018100403.jpg" alt=""></p>
<p>&#x5B9E;&#x9645;&#x4E0A;&#x6211;&#x4EEC;&#x8981;&#x505A;&#x5230;&#x7684;&#x662F;&#xFF0C;&#x7ED9;&#x5B9A;&#x4E24;&#x4E2A;&#x5927;&#x7D20;&#x6570; p1 &#x548C; p2 &#xFF0C;&#x8BA9; p1*p2 = N &#xFF0C;&#x7531; e &#x5BB9;&#x6613;&#x7B97;&#x51FA; d &#x7684;&#x524D;&#x63D0;&#x662F;&#x6211;&#x4EEC;&#x77E5;&#x9053; p1 &#x548C; p2 &#x7684;&#x503C;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x662F;&#x77E5;&#x9053; N &#x7684;&#x6574;&#x6570;&#x5206;&#x89E3;&#x7684;&#x7ED3;&#x679C;&#x3002;&#x800C;&#x5982;&#x679C;&#x4E0D;&#x77E5;&#x9053; &#xFF0C;&#x90A3;&#x4E48;&#x6839;&#x636E; e &#x548C; N &#x7B97;&#x51FA; d &#x7684;&#x96BE;&#x5EA6;&#x5C31;&#x76F8;&#x5F53;&#x4E8E;&#x5BF9;&#x4E24;&#x4E2A;&#x5927;&#x7D20;&#x6570;&#x7684;&#x4E58;&#x79EF;&#x505A;&#x53CD;&#x5411;&#x5206;&#x89E3;&#xFF0C;&#x8FD9;&#x4E2A;&#x662F;&#x5F88;&#x96BE;&#x7684;&#x3002;&#x201C;&#x5F88;&#x96BE;&#x201D;&#x5728;&#x8FD9;&#x91CC;&#x7684;&#x610F;&#x601D;&#x5C31;&#x662F;&#x6CA1;&#x6709;&#x6709;&#x6548;&#x7684;&#x6C42;&#x89E3;&#x65B9;&#x6CD5;&#xFF0C;&#x53EA;&#x80FD;&#x9760;&#x66B4;&#x529B;&#x641C;&#x7D22;&#x53BB;&#x89E3;&#x51B3;&#xFF0C;&#x4E8E;&#x662F;&#x8FD0;&#x7B97;&#x91CF;&#x8D85;&#x5927;&#xFF0C;&#x6240;&#x4EE5;&#x5B9E;&#x9645;&#x4E2D;&#x4E0D;&#x53EF;&#x80FD;&#x505A;&#x5230;&#x3002;</p>
<p>&#x597D;&#xFF0C;&#x770B;&#x5230;&#x8FD9;&#x91CC;&#xFF0C;&#x6211;&#x4EEC;&#x8981;&#x89E3;&#x51B3;&#x7684;&#x95EE;&#x9898;&#x5C31;&#x63CF;&#x8FF0;&#x6E05;&#x695A;&#x4E86;&#xFF0C;&#x600E;&#x4E48;&#x89E3;&#x51B3;&#x5462;&#xFF1F;&#x6765;&#x7EE7;&#x7EED;&#x770B;&#x4E0B;&#x9762;&#x7684;&#x6570;&#x5B66;&#x63A8;&#x5BFC;&#x3002;</p>
<h2 id="&#x89E3;&#x51B3;&#x6B65;&#x9AA4;">&#x89E3;&#x51B3;&#x6B65;&#x9AA4;</h2>
<p>&#x95EE;&#x9898;&#x7684;&#x5173;&#x952E;&#x5C31;&#x662F;&#x4F7F;&#x7528;&#x6B27;&#x62C9;&#x51FD;&#x6570;&#x3002;</p>
<p>&#x5728; RSA &#x8FD9;&#x91CC;&#xFF0C;&#x6B27;&#x62C9;&#x51FD;&#x6570;&#x7684;&#x672C;&#x6765;&#x76EE;&#x7684;&#x4E0D;&#x91CD;&#x8981;&#xFF0C;&#x91CD;&#x8981;&#x7684;&#x662F;&#x8981;&#x4F7F;&#x7528;&#x7684;&#x662F;&#x5B83;&#x7684;&#x4E00;&#x4E2A;&#x5C5E;&#x6027;&#xFF1A;&#x4E5F;&#x5C31;&#x662F;&#xFF0C;&#x53EA;&#x6709;&#x6EE1;&#x8DB3;&#x7279;&#x5B9A;&#x6761;&#x4EF6;&#x4E0B;&#x624D;&#x5BB9;&#x6613;&#x8BA1;&#x7B97;&#x51FA;&#x5B83;&#x7684;&#x7ED3;&#x679C;&#xFF0C;&#x5426;&#x5219;&#xFF0C;&#x5C31;&#x5F88;&#x96BE;&#x3002;&#x63A8;&#x5BFC;&#x8FC7;&#x7A0B;&#x6211;&#x4EEC;&#x5C31;&#x4E0D;&#x8BF4;&#x4E86;&#xFF0C;&#x90A3;&#x8FD9;&#x4E2A;&#x7279;&#x5B9A;&#x6761;&#x4EF6;&#x662F;&#x4EC0;&#x4E48;&#x5462;&#xFF1F;&#x5176;&#x5B9E;&#x5C31;&#x662F;&#x5F53; N &#x662F;&#x4E24;&#x4E2A;&#x7D20;&#x6570; p1 &#x548C; p2 &#x7684;&#x4E58;&#x79EF;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x56E0;&#x4E3A;&#x6B64;&#x65F6;&#x53EF;&#x4EE5;&#x4FDD;&#x8BC1;&#x4E0B;&#x9762;&#x7684;&#x7B49;&#x5F0F;&#x6210;&#x7ACB;&#x3002;</p>
<pre><code>&#x3C6;(N) = (p1-1)(p2-1)
</code></pre><p>&#x4F8B;&#x5982; &#xFF0C;77 &#x7684;&#x6B27;&#x62C9;&#x51FD;&#x6570;&#x5176;&#x5B9E;&#x662F;&#x5F88;&#x96BE;&#x8FD0;&#x7B97;&#x51FA;&#x6765;&#x4E86;&#xFF0C;&#x4F46;&#x662F;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x77E5;&#x9053; 77 &#x53EF;&#x4EE5;&#x5206;&#x89E3;&#x4E3A; 7 &#x548C; 11&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x53EF;&#x4EE5;&#x5F88;&#x5BB9;&#x6613;&#x5F97;&#x5230;&#x7ED3;&#x679C; 60 &#x4E86;&#x3002;</p>
<pre><code>&#x3C6;(77) = (7-1)*(11-1) = 60
</code></pre><p>&#x57FA;&#x4E8E;&#x6B27;&#x62C9;&#x51FD;&#x6570;&#x7684;&#x8FD9;&#x4E2A;&#x7279;&#x70B9;&#xFF0C;&#x53EA;&#x8981;&#x6211;&#x4EEC;&#x80FD;&#x63A8;&#x5BFC;&#x51FA; e &#xFF0C;d &#x8DDF; &#x3C6;(n) &#x7684;&#x5173;&#x7CFB;&#xFF0C;&#x90A3;&#x5C31;&#x80FD;&#x4FDD;&#x8BC1;&#x5728; &#x3C6;&#xFF08;n) &#x80FD;&#x591F;&#x8FD0;&#x7B97;&#x51FA;&#x7ED3;&#x679C;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4ECE; e &#x5F88;&#x5BB9;&#x6613;&#x5F97;&#x5230; d &#xFF0C;&#x5426;&#x5219;&#xFF0C;&#x4ECE; e &#x5C31;&#x5F88;&#x96BE;&#x7B97;&#x51FA; d &#x3002;&#x63A8;&#x5BFC;&#x8FC7;&#x7A0B;&#x8981;&#x57FA;&#x4E8E;&#x6B27;&#x62C9;&#x5B9A;&#x7406;&#x6765;&#x8FDB;&#x884C;&#x3002;&#x6B27;&#x62C9;&#x5B9A;&#x7406;&#x7684;&#x5177;&#x4F53;&#x610F;&#x4E49;&#x6211;&#x4EEC;&#x4E0D;&#x5FC5;&#x6DF1;&#x7A76;&#x3002;</p>
<p><img src="https://img.haoqicat.com/2018100601.jpg" alt=""></p>
<p>&#x5176;&#x4E2D;&#x4E09;&#x4E2A;&#x6A2A;&#x6760;&#x662F;&#x7EC4;&#x6210;&#x7684;&#x7B49;&#x5F0F;&#x53EB;&#x505A;&#x540C;&#x4F59;&#x5F0F;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x6B63;&#x6574;&#x6570; a&#xFF0C;b &#x5BF9; p &#x53D6;&#x6A21;&#xFF0C;&#x5B83;&#x4EEC;&#x7684;&#x4F59;&#x6570;&#x76F8;&#x540C;&#xFF0C;&#x5C31;&#x8BB0;&#x505A; a &#x2261; b (mod p)&#x3002;</p>
<p>&#x63A8;&#x5BFC;&#x8FC7;&#x7A0B;&#x6211;&#x4EEC;&#x4E5F;&#x4ECE;&#x7565;&#x4E86;&#x3002;&#x6700;&#x7EC8;&#xFF0C;&#x7ECF;&#x8FC7;&#x6B27;&#x62C9;&#x5B9A;&#x4E49;&#x548C;&#x4E0A;&#x9762;&#x5176;&#x4ED6;&#x7ED3;&#x8BBA;&#x8FDB;&#x884C;&#x63A8;&#x5BFC;&#xFF0C;&#x53EF;&#x4EE5;&#x5F97;&#x5230;&#x4E0B;&#x9762;&#x4E24;&#x4E2A;&#x7B49;&#x5F0F;&#x662F;&#x540C;&#x65F6;&#x6210;&#x7ACB;&#x7684;&#x3002;</p>
<p><img src="https://img.haoqicat.com/2018100602.jpg" alt=""></p>
<p>&#x8FD9;&#x6837;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x5F97;&#x5230; e &#x548C; d &#x7684;&#x5173;&#x7CFB;&#x4E86;&#xFF1A;&#x4E5F;&#x5C31;&#x662F; e &#x548C; d &#x7684;&#x4E58;&#x79EF;&#xFF0C;&#x7B49;&#x4E8E; k &#x4E58;&#x4EE5; &#x3C6;(N) &#x52A0; 1 &#xFF1A;</p>
<pre><code>d = (k*&#x3C6;(N) + 1)/e
</code></pre><p>&#x53EA;&#x8981;&#x77E5;&#x9053; &#x3C6;(N) &#xFF0C;d &#x5C31;&#x53EF;&#x4EE5;&#x7B97;&#x51FA;&#x6765;&#x4E86;&#x3002;&#x800C;&#x5982;&#x679C;&#x4E0D;&#x77E5;&#x9053; &#x3C6;(N) &#xFF0C;&#x6709;&#x4E86; e &#x4E5F;&#x6839;&#x672C;&#x7B97;&#x4E0D;&#x51FA; d &#x6765;&#x3002;&#x4E0A;&#x9762;&#x7684; k &#x6CA1;&#x6709;&#x9884;&#x5148;&#x7684;&#x56FA;&#x5B9A;&#x503C;&#xFF0C;&#x800C;&#x662F;&#x8981;&#x5728;&#x8FD0;&#x7B97;&#x8FC7;&#x7A0B;&#x4E2D;&#x7B97;&#x51FA;&#x6765;&#x7684;&#x3002;k &#x7684;&#x53D6;&#x503C;&#x8981;&#x4FDD;&#x8BC1;&#x7ED9;&#x5B9A;&#x4E00;&#x4E2A; e &#x7684;&#x6570;&#x503C;&#xFF0C; d &#x6700;&#x7EC8;&#x53EF;&#x4EE5;&#x7B97;&#x51FA;&#x6574;&#x6570;&#x6765;&#x3002;</p>
<p>&#x901A;&#x8FC7;&#x4E0A;&#x9762;&#x7684;&#x8BA8;&#x8BBA;&#xFF0C;&#x5982;&#x4F55;&#x751F;&#x6210;&#x516C;&#x94A5;&#x548C;&#x79C1;&#x94A5;&#x7684;&#x65B9;&#x6CD5;&#x5C31;&#x6709;&#x4E86;&#xFF0C;&#x516C;&#x94A5;&#x662F; N &#x548C; e &#xFF0C;e &#x662F;&#x5728;&#x4E00;&#x5B9A;&#x8303;&#x56F4;&#x5185;&#x968F;&#x673A;&#x9009;&#x62E9;&#x7684;&#xFF0C;&#x800C;&#x4E14;&#x662F;&#x516C;&#x5F00;&#x7684;&#x3002;&#x79C1;&#x94A5;&#x662F;&#x7531; N &#x548C; d &#x7EC4;&#x6210;&#x7684;&#xFF0C;&#x800C; d &#x662F;&#x5728;&#x77E5;&#x9053; N &#x7684;&#x6574;&#x6570;&#x5206;&#x89E3;&#x7ED3;&#x679C;&#x7684;&#x6761;&#x4EF6;&#x4E0B;&#xFF0C;&#x901A;&#x8FC7;&#x4E0A;&#x9762;&#x7684;&#x8FD0;&#x7B97;&#x8BA1;&#x7B97;&#x51FA;&#x6765;&#x7684;&#x3002;&#x540C;&#x65F6;&#xFF0C;&#x52A0;&#x5BC6;&#x51FD;&#x6570;&#x4E5F;&#x6709;&#x4E86;&#xFF0C;&#x5C31;&#x662F;&#x4FE1;&#x606F; m &#x7684; e &#x6B21;&#x65B9;&#x5BF9; N &#x53D6;&#x6A21;&#xFF0C;&#x89E3;&#x5BC6;&#x51FD;&#x6570;&#x5C31;&#x662F;&#x5BC6;&#x6587; c &#x7684; d &#x6B21;&#x65B9;&#x5BF9; N &#x53D6;&#x6A21;&#x3002;</p>
<h2 id="&#x8FD0;&#x7B97;&#x516C;&#x94A5;&#x548C;&#x79C1;&#x94A5;">&#x8FD0;&#x7B97;&#x516C;&#x94A5;&#x548C;&#x79C1;&#x94A5;</h2>
<p>&#x4E0B;&#x9762;&#x6211;&#x4EEC;&#x5C31;&#x6765;&#x5B9E;&#x9645;&#x4F7F;&#x7528;&#x4E00;&#x4E0B;&#x4E0A;&#x9762;&#x7684;&#x7ED3;&#x8BBA;&#xFF0C;&#x751F;&#x6210;&#x4E00;&#x4E0B;&#x516C;&#x94A5;&#x548C;&#x79C1;&#x94A5;&#xFF0C;&#x5E76;&#x4E14;&#x505A;&#x4E00;&#x904D;&#x52A0;&#x5BC6;&#x548C;&#x89E3;&#x5BC6;&#x3002;</p>
<p>&#x9996;&#x5148;&#x9009;&#x62E9;&#x4E24;&#x4E2A;&#x6BD4;&#x8F83;&#x5927;&#x7684;&#x7D20;&#x6570;&#xFF0C;&#x5B9E;&#x9645;&#x4E2D;&#x4E00;&#x822C;&#x662F;&#x51E0;&#x767E;&#x4F4D;&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x4EEC;&#x8FD9;&#x91CC;&#x4E3A;&#x4E86;&#x6F14;&#x793A;&#x65B9;&#x4FBF;&#xFF0C;&#x9009;&#x62E9;&#x5C0F;&#x7684;&#x4E00;&#x70B9;&#x7684;&#x3002;p1 = 53 , p2 = 59 &#xFF0C;&#x8FD9;&#x6837; N = 53*59=3127 &#x3002;</p>
<p>&#x9996;&#x5148;&#x6765;&#x751F;&#x6210;&#x516C;&#x94A5;&#x548C;&#x79C1;&#x94A5;&#xFF0C;Alice &#x9009;&#x53D6; e = 3 &#x3002;&#x4E8E;&#x662F;&#x516C;&#x94A5;&#x5C31;&#x662F; e &#x548C; N &#x8FD9;&#x4E24;&#x4E2A;&#x6570;&#x7684;&#x7EC4;&#x5408;&#x3002;&#x516C;&#x94A5;&#x6709;&#x4E86;&#x3002;&#x4E0B;&#x4E00;&#x6B65;&#x6765;&#x751F;&#x6210;&#x79C1;&#x94A5;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x53BB;&#x8FD0;&#x7B97; d &#x3002; &#x56E0;&#x4E3A;&#x77E5;&#x9053; p1 &#x548C; p2 &#x7684;&#x503C;&#xFF0C;&#x6240;&#x4EE5; &#x3C6;(N) &#x5F88;&#x5BB9;&#x6613;&#x7B97;&#x51FA;&#x7ED3;&#x679C;&#xFF0C;&#x5C31;&#x662F; 3016 &#x3002;&#x6839;&#x636E;&#x4E0A;&#x9762;&#x8FD0;&#x7B97; d &#x7684;&#x516C;&#x5F0F;&#xFF0C;&#x5F53; k &#x7B49;&#x4E8E; 2 &#x7684;&#x65F6;&#x5019;&#xFF0C;d &#x53EF;&#x4EE5;&#x53D6;&#x5F97;&#x6574;&#x6570;&#x503C;&#xFF0C;d &#x5C31;&#x7B49;&#x4E8E;</p>
<pre><code>d = (2*3016+1)/3 = 2011
</code></pre><p>&#x79C1;&#x94A5;&#x5C31;&#x662F; N &#x548C; d &#x7684;&#x7EC4;&#x5408;&#x3002;</p>
<p>&#x63A5;&#x4E0B;&#x6765;&#x770B;&#x52A0;&#x5BC6;&#x548C;&#x89E3;&#x5BC6;&#x8FC7;&#x7A0B;&#x3002;Alice &#x628A; e &#x548C; N &#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x516C;&#x94A5;&#x53D1;&#x9001;&#x7ED9;&#x4E86; Bob &#x3002;</p>
<pre><code>89^3 mod 3127 = 1394
</code></pre><p>Bob &#x628A;&#x539F;&#x6587; 89 &#xFF0C;e &#x548C; N &#x5E26;&#x5165;&#x5230;&#x52A0;&#x5BC6;&#x51FD;&#x6570;&#x4E2D;&#xFF0C;&#x6700;&#x7EC8;&#x5F97;&#x5230;&#x5BC6;&#x6587; c = 1394 &#x3002;&#x52A0;&#x5BC6;&#x8FC7;&#x7A0B;&#x5B8C;&#x6210;&#x3002;</p>
<p>Alice &#x6536;&#x5230;&#x5BC6;&#x6587;&#x4E4B;&#x540E;&#xFF0C;&#x53EF;&#x4EE5;&#x7528;&#x79C1;&#x94A5;&#x8FDB;&#x884C;&#x89E3;&#x5BC6;&#x3002;</p>
<pre><code>1394^2011 mod 3127 = 89
</code></pre><p>&#x4E5F;&#x5C31;&#x662F;&#xFF0C;&#x628A;&#x5BC6;&#x6587;&#xFF0C;d &#x548C; n &#x90FD;&#x5E26;&#x5165;&#x89E3;&#x5BC6;&#x51FD;&#x6570;&#xFF0C;&#x8FD9;&#x6837;&#x5C31;&#x5F97;&#x5230;&#x4E86;&#x4FE1;&#x606F; m = 89 &#x3002;</p>
<p>&#x8FD9;&#x6837;&#x6211;&#x4EEC;&#x5C31;&#x5B8C;&#x6210;&#x4E86;&#x6574;&#x4E2A;&#x7684;&#x8FC7;&#x7A0B;&#x3002;</p>
<h2 id="&#x603B;&#x7ED3;">&#x603B;&#x7ED3;</h2>
<p>&#x6700;&#x540E;&#x603B;&#x7ED3;&#x4E00;&#x4E0B;&#x3002;&#x6211;&#x4EEC;&#x7684;&#x95EE;&#x9898;&#x662F;&#xFF0C;&#x5982;&#x4F55;&#x6784;&#x5EFA;&#x5148;&#x5E42;&#x540E;&#x6A21;&#x8FD0;&#x7B97;&#x7684;&#x5404;&#x9879;&#x53C2;&#x6570;&#x4E4B;&#x95F4;&#x7684;&#x5173;&#x7CFB;&#xFF0C;&#x4ECE;&#x800C;&#x4FDD;&#x8BC1;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x4EBA;&#x638C;&#x63E1;&#x4E86;&#x8FD9;&#x79CD;&#x5173;&#x7CFB;&#xFF0C;&#x662F;&#x53EF;&#x4EE5;&#x5BF9;&#x52A0;&#x5BC6;&#x9501;&#x8FDB;&#x884C;&#x53CD;&#x5411;&#x8FD0;&#x7B97;&#x7684;&#x3002;&#x5173;&#x7CFB;&#x662F;&#x901A;&#x8FC7;&#x6574;&#x6570;&#x5206;&#x89E3;&#x95EE;&#x9898;&#x53BB;&#x6784;&#x5EFA;&#x7684;&#xFF0C;&#x63A8;&#x5BFC;&#x8FC7;&#x7A0B;&#x4E2D;&#x4F1A;&#x7528;&#x5230;&#x6B27;&#x62C9;&#x51FD;&#x6570;&#x7684;&#x4E00;&#x4E2A;&#x91CD;&#x8981;&#x7279;&#x6027;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x5982;&#x679C;&#x53C2;&#x6570;&#x7684;&#x6574;&#x6570;&#x5206;&#x89E3;&#x7ED3;&#x679C;&#x662F;&#x77E5;&#x9053;&#x7684;&#xFF0C;&#x90A3;&#x4E48;&#x6B27;&#x62C9;&#x51FD;&#x6570;&#x7684;&#x7ED3;&#x679C;&#x4E5F;&#x5C31;&#x5F88;&#x5BB9;&#x6613;&#x7B97;&#x51FA;&#x6765;&#xFF0C;&#x5426;&#x5219;&#x6B27;&#x62C9;&#x51FD;&#x6570;&#x5F88;&#x96BE;&#x88AB;&#x6C42;&#x89E3;&#x3002;&#x4E8E;&#x662F;&#x7ECF;&#x8FC7;&#x63A8;&#x5BFC;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5F97;&#x51FA; <code>e*d</code> &#x8DDF;&#x6B27;&#x62C9;&#x51FD;&#x6570;&#x7684;&#x503C;&#x6709;&#x7740;&#x56FA;&#x5B9A;&#x7684;&#x8054;&#x7CFB;&#xFF0C;&#x4E8E;&#x662F;&#x5F97;&#x5230;&#x4E86;&#x4ECE;&#x516C;&#x94A5;&#xFF08;&#x57FA;&#x672C;&#x5C31;&#x662F; e &#xFF09;&#x8FD0;&#x7B97;&#x51FA;&#x79C1;&#x94A5;&#xFF08;&#x57FA;&#x672C;&#x5C31;&#x662F; d &#xFF09;&#x7684;&#x65B9;&#x6CD5;&#x3002;</p>
<p>&#x53C2;&#x8003;&#xFF1A;</p>
<ul>
<li><a href="https://www.youtube.com/watch?v=wXB-V_Keiu8" target="_blank">https://www.youtube.com/watch?v=wXB-V_Keiu8</a></li>
<li><a href="https://www.kancloud.cn/kancloud/rsa_algorithm/48488" target="_blank">https://www.kancloud.cn/kancloud/rsa_algorithm/48488</a></li>
</ul>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="8-idea.html" class="navigation navigation-prev " aria-label="Previous page: RSA 算法--基本原理篇">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="10-merk.html" class="navigation navigation-next " aria-label="Next page: Merkle Tree">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"RSA 算法--粗略数学推导篇","level":"1.10","depth":1,"next":{"title":"Merkle Tree","level":"1.11","depth":1,"path":"10-merk.md","ref":"10-merk.md","articles":[]},"previous":{"title":"RSA 算法--基本原理篇","level":"1.9","depth":1,"path":"8-idea.md","ref":"8-idea.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["livereload"],"pluginsConfig":{"livereload":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"9-math.md","mtime":"2019-07-30T23:37:08.639Z","type":"markdown"},"gitbook":{"version":"3.2.2","time":"2019-07-30T23:38:07.793Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

